{
  "id": 4,
  "title": "netstat",
  "lessonContent": "<b>Известные порты</b>\n\nМы обсудили передачу данных через порты на нашей машине, давайте посмотрим на некоторые известные порты.\n\nВы можете получить список известных портов, посмотрев файл <b>/etc/services</b>: \n\n<pre>\nftp             21/tcp\nssh             22/tcp\nsmtp            25/tcp \ndomain          53/tcp  # DNS\nhttp            80/tcp\nhttps           443/tcp\n..и так далее..\n</pre>\n\nПервый столбец - это название службы, затем номер порта и используемый протокол транспортного уровня.\n\n<b>netstat</b>\n\nЧрезвычайно полезный инструмент для получения подробной информации о вашей сети - это <b>netstat</b>. Netstat отображает различную информацию, связанную с сетью, такую как сетевые соединения, таблицы маршрутизации, информацию о сетевых интерфейсах и многое другое, это швейцарский нож сетевых инструментов. Мы сосредоточимся в основном на одной функции, которую предлагает netstat, и это состояние сетевых соединений. Прежде чем мы рассмотрим пример, давайте сначала поговорим о сокетах и портах. Сокет - это интерфейс, который позволяет программам отправлять и получать данные, в то время как порт используется для идентификации того, какое приложение должно отправлять или получать данные. Адрес сокета - это комбинация IP-адреса и порта. Для каждого соединения между хостом и местом назначения требуется уникальный сокет. Например, HTTP - это служба, которая работает на порту 80, однако у нас может быть много соединений HTTP, и для поддержания каждого соединения создается сокет.\n\n<pre>\npete@icebox:~$ netstat -at\nActive Internet connections (servers and established)\nProto Recv-Q Send-Q Local Address           Foreign Address         State      \ntcp        0      0 icebox:domain           *:*                     LISTEN     \ntcp        0      0 localhost:ipp           *:*                     LISTEN     \ntcp        0      0 icebox.lan:44468        124.28.28.50:http       TIME_WAIT  \ntcp        0      0 icebox.lan:34751        124.28.29.50:http       TIME_WAIT  \ntcp        0      0 icebox.lan:34604        economy.canonical.:http TIME_WAIT  \ntcp6       0      0 ip6-localhost:ipp       [::]:*                  LISTEN     \ntcp6       1      0 ip6-localhost:35094     ip6-localhost:ipp       CLOSE_WAIT \ntcp6       0      0 ip6-localhost:ipp       ip6-localhost:35094     FIN_WAIT2\n</pre>\n\nКоманда netstat -a показывает прослушивающие и непрослушивающие сокеты для сетевых соединений, флаг -t показывает только tcp-соединения. \n\nСтолбцы следующие слева направо:\n\n<ul>\n<li>Proto: Используемый протокол, TCP или UDP.</li>\n<li>Recv-Q: Данные, ожидающие получения</li>\n<li>Send-Q: Данные, ожидающие отправки</li>\n<li>Local Address: Локально подключенный хост</li>\n<li>Foreign Address: Удаленно подключенный хост</li>\n<li>State: Состояние сокета</li>\n</ul>\n\nСмотрите страницу руководства для списка состояний сокетов, но вот некоторые из них:\n\n<ul>\n<li>LISTENING: Сокет прослушивает входящие соединения, помните, что когда мы устанавливаем TCP-соединение, наш пункт назначения должен слушать нас, прежде чем мы сможем подключиться.</li>\n<li>SYN_SENT: Сокет активно пытается установить соединение.</li>\n<li>ESTABLISHED: Сокет имеет установленное соединение</li>\n<li>CLOSE_WAIT: Удаленный хост завершил работу, и мы ждем закрытия сокета</li>\n<li>TIME_WAIT: Сокет ожидает после закрытия обработки пакетов, которые все еще находятся в сети</li>\n </ul>",
  "exercise": "Посмотрите страницу руководства для netstat и изучите все функции, которые он предлагает.",
  "quizQuestion": "Какой порт используется для HTTPS?",
  "quizAnswer": "443",
  "slug": "netstat"
}