{
  "id": 5,
  "title": "Анализ пакетов",
  "lessonContent": "Тема анализа пакетов может заполнить целый курс, и существует много книг, написанных исключительно о анализе пакетов. Однако сегодня мы просто изучим основы. Существуют две чрезвычайно популярные программы для анализа пакетов: Wireshark и tcpdump. Эти инструменты сканируют ваши сетевые интерфейсы, захватывают активность пакетов, разбирают пакеты и выводят информацию для нас. Они позволяют нам погрузиться в детали анализа сети и изучить низкоуровневые вещи. Мы будем использовать tcpdump, поскольку у него более простой интерфейс, однако если вы решите освоить анализ пакетов, я бы порекомендовал обратить внимание на Wireshark.\n\n<b>Установите tcpdump</b>\n\n<pre>\n$ sudo apt install tcpdump\n</pre>\n\n<b>Захват данных пакетов на интерфейсе</b>\n\n<pre>\npete@icebox:~$ sudo tcpdump -i wlan0\ntcpdump: verbose output suppressed, use -v or -vv for full protocol decode\nlistening on wlan0, link-type EN10MB (Ethernet), capture size 65535 bytes\n11:28:23.958840 IP icebox.lan > nuq04s29-in-f4.1e100.net: ICMP echo request, id 1901, seq 2, length 64\n11:28:23.970928 IP nuq04s29-in-f4.1e100.net > icebox.lan: ICMP echo reply, id 1901, seq 2, length 64\n11:28:24.960464 IP icebox.lan > nuq04s29-in-f4.1e100.net: ICMP echo request, id 1901, seq 3, length 64\n11:28:24.979299 IP nuq04s29-in-f4.1e100.net > icebox.lan: ICMP echo reply, id 1901, seq 3, length 64\n11:28:25.961869 IP icebox.lan > nuq04s29-in-f4.1e100.net: ICMP echo request, id 1901, seq 4, length 64\n11:28:25.976176 IP nuq04s29-in-f4.1e100.net > icebox.lan: ICMP echo reply, id 1901, seq 4, length 64\n11:28:26.963667 IP icebox.lan > nuq04s29-in-f4.1e100.net: ICMP echo request, id 1901, seq 5, length 64\n11:28:26.976137 IP nuq04s29-in-f4.1e100.net > icebox.lan: ICMP echo reply, id 1901, seq 5, length 64\n11:28:30.674953 ARP, Request who-has 172.254.1.0 tell ThePickleParty.lan, length 28\n11:28:31.190665 IP ThePickleParty.lan.51056 > 192.168.86.255.rfe: UDP, length 306\n</pre>\n\nВы заметите много событий при выполнении захвата пакетов, это ожидаемо, так как в фоновом режиме происходит много сетевой активности. В моем примере выше я взял только фрагмент моего захвата, а именно время, когда я решил выполнить ping www.google.com.\n\n<b>Понимание вывода</b>\n\n<pre>\n11:28:23.958840 IP icebox.lan > nuq04s29-in-f4.1e100.net: ICMP echo request, id 1901, seq 2, length 64\n11:28:23.970928 IP nuq04s29-in-f4.1e100.net > icebox.lan: ICMP echo reply, id 1901, seq 2, length 64\n</pre>\n\n<ul>\n<li>Первое поле - временная метка сетевой активности</li>\n<li>IP, содержит информацию о протоколе</li>\n<li>Далее вы увидите адрес источника и адрес назначения: icebox.lan > nuq04s29-in-f4.1e100.net</li>\n<li>seq - это начальный и конечный номер последовательности TCP-пакетов</li>\n<li>length - длина в байтах</li>\n</ul>\n\nКак видно из вывода tcpdump, мы отправляем пакет запроса ICMP echo на www.google.com и получаем в ответ пакет ответа ICMP echo! Также обратите внимание, что разные пакеты будут выводить разную информацию, обратитесь к man-странице, чтобы узнать, что это за пакеты.\n\n<b>Запись вывода tcpdump в файл</b>\n\n<pre>\n$ sudo tcpdump -w /some/file\n</pre>\n\n\nНекоторые заключительные мысли: мы только коснулись поверхности темы анализа пакетов. Есть так много, на что можно посмотреть, и мы даже не затронули более глубокий анализ с выводом в шестнадцатеричном и ASCII форматах. Существует множество ресурсов в Интернете, которые помогут вам узнать больше о анализаторах пакетов, и я настоятельно рекомендую вам их найти!",
  "exercise": "Скачайте и установите инструмент Wireshark и поиграйтесь с интерфейсом.",
  "quizQuestion": "Какой флаг использовать для захвата конкретного интерфейса с помощью tcpdump?",
  "quizAnswer": "-i",
  "slug": "packetanalysis"
}