{
  "id": 2,
  "title": "ping",
  "lessonContent": "Один из самых простых сетевых инструментов <b>ping</b>, используется для проверки того, может ли пакет достичь хоста. Он работает путем отправки пакетов ICMP echo request (тип 8) на целевой хост и ожидания ICMP echo reply (тип 0). Ping успешен, когда хост отправляет запрос и получает ответ от цели. Давайте рассмотрим пример: \n\n<pre>\npete@icebox:~$ ping -c 3 www.google.com\nPING www.google.com (74.125.239.112) 56(84) байт данных.\n64 байта от nuq05s01-in-f16.1e100.net (74.125.239.112): icmp_seq=1 ttl=128 time=29.0 мс\n64 байта от nuq05s01-in-f16.1e100.net (74.125.239.112): icmp_seq=2 ttl=128 time=23.7 мс\n64 байта от nuq05s01-in-f16.1e100.net (74.125.239.112): icmp_seq=3 ttl=128 time=15.1 мс\n</pre>\n\nВ этом примере мы используем ping для проверки доступности www.google.com. Флаг -c (count) используется для остановки отправки пакетов echo request после достижения счетчика. \n\nПервая часть говорит о том, что мы отправляем 64-байтные пакеты на 74.125.239.112 (google.com), а остальное показывает нам детали поездки. По умолчанию отправляется один пакет в секунду.\n\n<b>icmp_seq</b>\n\nПоле icmp_seq используется для отображения номера последовательности отправленных пакетов, так что в этом случае я отправил 3 пакета, и мы видим, что 3 пакета вернулись. Если вы выполняете ping и видите пропущенные номера последовательности, это означает, что возникают проблемы с подключением, и не все ваши пакеты проходят. Если номер последовательности находится вне порядка, ваше подключение, вероятно, очень медленное, так как ваши пакеты превышают односекундный интервал по умолчанию. \n\n<b>ttl</b>\n\nПоле Time To Live (ttl) используется как счетчик переходов, по мере прохождения хопов счетчик уменьшается на один, и когда счетчик хопов достигает 0, наш пакет умирает. Это предназначено для того, чтобы дать пакету срок жизни, мы не хотим, чтобы наши пакеты бесконечно путешествовали. \n\n<b>time</b>\n\nВремя туда и обратно, которое потребовалось от отправки вами пакета echo request до получения ответа echo reply.",
  "exercise": "Выполните ping на веб-сайт и посмотрите на вывод, который вы получите.",
  "quizQuestion": "Какая единица измерения времени туда и обратно?",
  "quizAnswer": "мс",
  "slug": "ping"
}