{
  "id": 6,
  "title": "Objectifs de Systemd",
  "lessonContent": "Nous n'entrerons pas dans les détails de l'écriture des fichiers unités systemd. Nous allons cependant passer en revue un bref aperçu d'un fichier unité et comment contrôler manuellement les unités. \n\nVoici un fichier unité de service de base : foobar.service\n\n<pre>\n[Unit]\nDescription=Mon Foobar\nBefore=bar.target\n\n[Service]\nExecStart=/usr/bin/foobar\n\n[Install]\nWantedBy=multi-user.target\n</pre>\n\nIl s'agit d'une cible de service simple, au début du fichier nous voyons une section pour [Unit], cela nous permet de donner une description à notre fichier unité ainsi que de contrôler l'ordre d'activation de l'unité. La partie suivante est la section [Service], ici nous pouvons démarrer, arrêter ou recharger un service. Et la section [Install] est utilisée pour les dépendances. Ce n'est que la partie émergée de l'iceberg pour écrire des fichiers systemd, donc je vous implore de vous renseigner sur le sujet si vous voulez en savoir plus. \n\nMaintenant, passons à quelques commandes que vous pouvez utiliser avec les unités systemd : \n\n<b>Lister les unités</b>\n\n<pre>$ systemctl list-units</pre>\n\n<b>Afficher l'état d'une unité</b>\n\n<pre>$ systemctl status networking.service</pre>\n\n<b>Démarrer un service</b>\n\n<pre>$ sudo systemctl start networking.service</pre>\n\n<b>Arrêter un service</b>\n\n<pre>$ sudo systemctl stop networking.service</pre>\n\n<b>Redémarrer un service</b>\n\n<pre>$ sudo systemctl restart networking.service</pre>\n\n<b>Activer une unité</b>\n\n<pre>$ sudo systemctl enable networking.service</pre>\n\n<b>Désactiver une unité</b>\n\n<pre>$ sudo systemctl disable networking.service</pre>\n\nEncore une fois, vous n'avez pas encore vu toute la profondeur de systemd, donc renseignez-vous si vous voulez en apprendre davantage.",
  "exercise": "Consultez les statuts des unités et démarrez et arrêtez quelques services. Que observez-vous ?",
  "quizQuestion": "Quelle est la commande pour démarrer un service nommé peanut.service ?",
  "quizAnswer": "sudo systemctl start peanut.service",
  "slug": "systemdgoals"
}