{
  "id": 5,
  "title": "Présentation de Systemd",
  "lessonContent": "Systemd devient lentement la norme émergente pour l'initialisation. Si vous avez un répertoire /usr/lib/systemd, vous utilisez très probablement systemd.\n\nSystemd utilise des objectifs pour démarrer votre système. Fondamentalement, vous avez une cible que vous souhaitez atteindre et cette cible a également des dépendances que nous devons atteindre. Systemd est extrêmement flexible et robuste, il ne suit pas une séquence stricte pour démarrer les processus. Voici ce qui se passe pendant le démarrage typique de systemd:\n\n<ol>\n<li>Tout d'abord, systemd charge ses fichiers de configuration, généralement situés dans /etc/systemd/system ou /usr/lib/systemd/system</li>\n<li>Ensuite, il détermine son objectif de démarrage, qui est généralement default.target</li>\n<li>Systemd identifie les dépendances de la cible de démarrage et les active</l>\n</ol>\n\nSimilaire aux niveaux d'exécution de Sys V, systemd démarre dans différentes cibles:\n\n<ul>\n<li>poweroff.target - arrêt du système</li>\n<li>rescue.target - mode utilisateur unique</li>\n<li>multi-user.target - multi-utilisateur avec réseau</li>\n<li>graphical.target - multi-utilisateur avec réseau et interface graphique</li>\n<li>reboot.target - redémarrage</li>\n</ul>\n\nL'objectif de démarrage par défaut de default.target pointe généralement vers graphical.target. \n\nL'objet principal avec lequel systemd travaille est connu sous le nom d'unités. Systemd ne se contente pas d'arrêter et de démarrer des services, il peut monter des systèmes de fichiers, surveiller vos sockets réseau, etc. et en raison de cette robustesse, il a différents types d'unités sur lesquelles il opère. Les unités les plus courantes sont:\n\n<ul>\n<li>Unités de service - ce sont les services que nous avons démarrés et arrêtés, ces fichiers d'unités se terminent par .service</li>\n<li>Unités de montage - Ces unités montent des systèmes de fichiers, ces fichiers d'unités se terminent par .mount</li>\n<li>Unités de cible - Ces unités regroupent d'autres unités, les fichiers se terminent par .target</li>\n</ul>\n\nPar exemple, disons que nous démarrons dans notre default.target, eh bien cette cible regroupe l'unité networking.service, l'unité crond.service, etc., donc une fois que nous activons une seule unité, tout ce qui se trouve en dessous de cette unité est également activé.",
  "exercise": "Aucun exercice pour cette leçon.",
  "quizQuestion": "Quelle unité est utilisée pour regrouper d'autres unités?",
  "quizAnswer": "cible",
  "slug": "systemdoverview"
}