{
  "id": 1,
  "title": "Présentation de System V",
  "lessonContent": "Le but principal de init est de démarrer et d'arrêter les processus essentiels du système. Il existe trois implémentations majeures de init dans Linux, System V, Upstart et systemd. Dans cette leçon, nous allons passer en revue la version la plus traditionnelle de init, System V init ou Sys V (prononcé 'System Five'). \n\nPour savoir si vous utilisez l'implémentation Sys V init, si vous avez un fichier /etc/inittab, vous utilisez probablement Sys V. \n\nSys V démarre et arrête les processus séquentiellement, donc disons que vous vouliez démarrer un service nommé foo-a, eh bien avant que foo-b puisse fonctionner, vous devez vous assurer que foo-a est déjà en cours d'exécution. Sys V le fait avec des scripts, ces scripts démarrer et arrêter des services pour nous, nous pouvons écrire nos propres scripts ou la plupart du temps utiliser ceux qui sont déjà intégrés dans le système d'exploitation et sont utilisés pour charger des services essentiels. \n\nLes avantages de l'utilisation de cette implémentation de init sont qu'il est relativement facile de résoudre les dépendances, car vous savez que foo-a vient avant foo-b, cependant les performances ne sont pas excellentes car généralement une seule chose démarre ou s'arrête à la fois. \n\nLors de l'utilisation de Sys V, l'état de la machine est défini par des niveaux d'exécution qui vont de 0 à 6. Ces modes différents varieront en fonction de la distribution, mais la plupart du temps ressembleront à ce qui suit: \n\n<ul>\n<li>0: Arrêt</li>\n<li>1: Mode utilisateur unique</li>\n<li>2: Mode multi-utilisateur sans réseau</li>\n<li>3: Mode multi-utilisateur avec réseau</li>\n<li>4: Inutilisé</li>\n<li>5: Mode multi-utilisateur avec réseau et interface graphique</li>\n<li>6: Redémarrage</li>\n</ul>\n\nLorsque votre système démarre, il vérifie dans quel niveau d'exécution vous vous trouvez et exécute les scripts situés à l'intérieur de cette configuration de niveau d'exécution. Les scripts sont situés dans <b>/etc/rc.d/rc[numéro du niveau d'exécution].d/</b> ou <b>/etc/init.d</b>. Les scripts commençant par S(démarrage) ou K(arrêt) s'exécuteront au démarrage et à l'arrêt, respectivement. Les chiffres à côté de ces caractères indiquent la séquence dans laquelle ils s'exécutent. \n\nPar exemple:\n\n<pre>\npete@icebox:/etc/rc.d/rc0.d$ ls\nK10updates  K80openvpn        \n</pre>\n\nNous voyons que lorsque nous passons au niveau d'exécution 0 ou mode d'arrêt, notre machine essaiera d'exécuter un script pour arrêter les services de mises à jour puis openvpn. Pour savoir dans quel niveau d'exécution votre machine démarre, vous pouvez voir le niveau d'exécution par défaut dans le fichier /etc/inittab. Vous pouvez également modifier votre niveau d'exécution par défaut dans ce fichier également. \n\nÀ noter, System V est progressivement remplacé, peut-être pas aujourd'hui, ni même dans les années à venir. Cependant, vous pouvez voir des niveaux d'exécution apparaître dans d'autres implémentations de init, principalement pour prendre en charge les services qui ne sont démarrés ou arrêtés qu'en utilisant des scripts d'initialisation System V.",
  "exercise": "Si vous utilisez System V, changez le niveau d'exécution par défaut de votre machine pour quelque chose d'autre et voyez ce qui se passe.",
  "quizQuestion": "Quel niveau d'exécution est généralement utilisé pour l'arrêt ?",
  "quizAnswer": "0",
  "slug": "sysvoverview"
}