{
  "id": 3,
  "title": "Présentation d'Upstart",
  "lessonContent": "Upstart a été développé par Canonical, il était donc l'implémentation init sur Ubuntu pendant un certain temps, cependant sur les installations modernes d'Ubuntu, systemd est maintenant utilisé. Upstart a été créé pour améliorer les problèmes de Sys V, tels que les processus de démarrage stricts, le blocage des tâches, etc. Le modèle piloté par les événements et les tâches d'Upstart lui permet de répondre aux événements au fur et à mesure qu'ils se produisent. \n\nPour savoir si vous utilisez Upstart, si vous avez un répertoire /usr/share/upstart, c'est un indicateur assez fiable. \n\nLes tâches sont les actions qu'Upstart effectue et les événements sont des messages reçus d'autres processus pour déclencher des tâches. Pour voir une liste des tâches et leur configuration:\n\n<pre>\npete@icebox:~$ ls /etc/init\nacpid.conf                   mountnfs.sh.conf\nalsa-restore.conf            mtab.sh.conf\nalsa-state.conf              networking.conf\nalsa-store.conf              network-interface.conf\nanacron.conf                 network-interface-container.conf\n</pre>\n\nÀ l'intérieur de ces configurations de tâches, il y aura des informations sur la manière de démarrer les tâches et quand les démarrer.\n\nPar exemple, dans le fichier networking.conf, cela pourrait dire quelque chose d'aussi simple que:\n<pre>\nstart on runlevel [235]\nstop on runlevel [0]\n</pre>\n\nCela signifie qu'il démarrera la configuration du réseau sur les niveaux d'exécution 2, 3 ou 5 et arrêtera le réseau sur le niveau d'exécution 0. Il existe de nombreuses façons d'écrire le fichier de configuration et vous découvrirez cela en examinant les différentes configurations de tâches disponibles. \n\nLa façon dont Upstart fonctionne est la suivante: \n\n<ol>\n<li>Tout d'abord, il charge les configurations de tâches depuis /etc/init</li>\n<li>Une fois qu'un événement de démarrage se produit, il exécutera les tâches déclenchées par cet événement.</li>\n<li>Ces tâches créeront de nouveaux événements et ces événements déclencheront d'autres tâches</li>\n<li>Upstart continue à faire cela jusqu'à ce qu'il ait terminé toutes les tâches nécessaires</li>\n</ol>",
  "exercise": "Si vous utilisez Upstart, essayez de comprendre les configurations de tâches dans /etc/init.",
  "quizQuestion": "Quelle est l'implémentation init utilisée par Ubuntu?",
  "quizAnswer": "upstart",
  "slug": "upstartoverview"
}