{
  "id": 4,
  "title": "Emplois Upstart",
  "lessonContent": "Upstart peut déclencher de nombreux événements et emplois à exécuter, malheureusement il n'y a pas de moyen facile de voir d'où provient un événement ou un emploi, donc vous devrez fouiller dans les configurations d'emploi dans /etc/init. La plupart du temps, vous n'aurez jamais besoin de consulter les fichiers de configuration d'emploi Upstart, mais vous voudrez contrôler plus facilement certains emplois spécifiques. Il existe de nombreuses commandes utiles que vous pouvez utiliser dans un système Upstart. \n\n<b>Voir les emplois</b>\n\n<pre>initctl list\n\nshutdown stop/waiting\nconsole stop/waiting\n...\n</pre>\n\nVous verrez une liste d'emplois Upstart avec différents statuts qui leur sont appliqués. Sur chaque ligne, le nom de l'emploi est la première valeur et le deuxième champ (avant le /) est en fait l'objectif de l'emploi, la troisième valeur (après le /) est le statut actuel. Ainsi, nous voyons que notre emploi de shutdown veut finalement s'arrêter, mais il est actuellement dans un état d'attente. Le statut et les objectifs de l'emploi changeront lorsque vous démarrerez ou arrêterez des emplois. \n\n<b>Voir un emploi spécifique</b>\n\n<pre>initctl status networking\nnetworking start/running\n</pre>\n\nNous n'entrerons pas dans les détails de la rédaction d'une configuration d'emploi Upstart, cependant nous savons déjà que les emplois sont arrêtés, démarrés et redémarrés dans ces configurations. Ces emplois émettent également des événements, donc ils peuvent démarrer d'autres emplois. Nous passerons en revue les commandes manuelles de l'opération Upstart, mais si vous êtes curieux, vous devriez approfondir les fichiers .conf.\n\n<b>Démarrer manuellement un emploi</b>\n\n<pre>$ sudo initctl start networking</pre>\n\n<b>Arrêter manuellement un emploi</b>\n\n<pre>$ sudo initctl stop networking</pre>\n\n<b>Redémarrer manuellement un emploi</b>\n\n<pre>$ sudo initctl restart networking</pre>\n\n<b>Émettre manuellement un événement</b>\n\n<pre>$ sudo initctl emit some_event</pre>",
  "exercise": "Observez votre liste d'emplois Upstart, puis changez l'état de l'emploi avec l'une des commandes que nous avons apprises aujourd'hui. Que remarquez-vous ensuite?",
  "quizQuestion": "Comment redémarrer manuellement un emploi Upstart appelé peanuts?",
  "quizAnswer": "sudo initctl restart peanuts",
  "slug": "emplois-upstart"
}