{
  "id": 3,
  "title": "Anatomia de um Disco",
  "lessonContent": "Os discos rígidos podem ser subdivididos em partições, essencialmente criando vários dispositivos de bloco. Lembre-se de exemplos como, /dev/sda1 e /dev/sda2, /dev/sda é o disco inteiro, mas /dev/sda1 é a primeira partição nesse disco. As partições são extremamente úteis para separar dados e, se você precisar de um determinado sistema de arquivos, pode facilmente criar uma partição em vez de tornar o disco inteiro de um tipo de sistema de arquivos.\n\n<b>Tabela de Partições</b>\n\nCada disco terá uma tabela de partições, essa tabela informa ao sistema como o disco está particionado. Essa tabela informa onde as partições começam e terminam, quais partições são inicializáveis, quais setores do disco são alocados para qual partição, etc. Existem dois esquemas principais de tabela de partições usados, Registro de Inicialização Principal (MBR) e Tabela de Partição GUID (GPT).\n\n<b>Partição</b>\n\nOs discos são compostos por partições que nos ajudam a organizar nossos dados. Você pode ter várias partições em um disco e elas não podem se sobrepor umas às outras. Se houver espaço que não está alocado para uma partição, então é conhecido como espaço livre. Os tipos de partições dependem da sua tabela de partições. Dentro de uma partição, você pode ter um sistema de arquivos ou dedicar uma partição a outras coisas como swap (falaremos sobre isso em breve).\n\n<i>MBR</i>\n\n<ul>\n<li>Tabela de partição tradicional, era usada como padrão</li>\n<li>Pode ter partições primárias, estendidas e lógicas</li>\n<li>O MBR tem um limite de quatro partições primárias</li>\n<li>Partições adicionais podem ser feitas transformando uma partição primária em uma partição estendida (só pode haver uma partição estendida em um disco). Em seguida, dentro da partição estendida, você adiciona partições lógicas. As partições lógicas são usadas como qualquer outra partição. Bobo, eu sei.</li>\n<li>Suporta discos de até 2 terabytes</li>\n</ul>\n\n<i>GPT</i>\n\n<ul>\n<li>A Tabela de Partição GUID (GPT) está se tornando o novo padrão para particionamento de disco</li>\n<li>Possui apenas um tipo de partição e você pode criar muitas delas</li>\n<li>Cada partição tem um ID globalmente único (GUID)</li>\n<li>Usado principalmente em conjunto com inicialização baseada em UEFI (entraremos em detalhes em outro curso)</li>\n</ul>\n\n<b>Estrutura do Sistema de Arquivos</b>\n\nSabemos de nossa lição anterior que um sistema de arquivos é uma coleção organizada de arquivos e diretórios. Em sua forma mais simples, é composto por um banco de dados para gerenciar arquivos e os próprios arquivos, no entanto, vamos entrar em um pouco mais de detalhes.\n\n<ul>\n<li>Bloco de inicialização - Este está localizado nos primeiros setores do sistema de arquivos e não é realmente usado pelo sistema de arquivos. Em vez disso, contém informações usadas para inicializar o sistema operacional. Apenas um bloco de inicialização é necessário pelo sistema operacional. Se você tiver várias partições, elas terão blocos de inicialização, mas muitos deles não são usados.</li>\n<li>Bloco super - Este é um bloco único que vem após o bloco de inicialização e contém informações sobre o sistema de arquivos, como o tamanho da tabela de inode, o tamanho dos blocos lógicos e o tamanho do sistema de arquivos.</li>\n<li>Tabela de inode - Pense nisso como o banco de dados que gerencia nossos arquivos (temos uma lição inteira sobre inodes, então não se preocupe). Cada arquivo ou diretório tem uma entrada única na tabela de inode e possui várias informações sobre o arquivo.</li>\n<li>Blocos de dados - Estes são os dados reais dos arquivos e diretórios.</li>\n</ul>\n\nVamos dar uma olhada nas diferentes tabelas de partições. Abaixo está um exemplo de uma partição usando a tabela de partições MBR (msdos). Você pode ver as partições primárias, estendidas e lógicas na máquina.\n\n<pre>\npete@icebox:~$ sudo parted -l\nModelo: Seagate (scsi)\nDisco /dev/sda: 21.5GB\nTamanho do setor (lógico/físico): 512B/512B\nTabela de Partições: msdos\n\nNúmero  Início   Fim     Tamanho  Tipo      Sistema de arquivos     Flags\n 1      1049kB  6860MB  6859MB  primária   ext4                    boot\n 2      6861MB  21.5GB  14.6GB  estendida\n 5      6861MB  7380MB  519MB   lógica    linux-swap(v1)\n 6      7381MB  21.5GB  14.1GB  lógica    xfs\n</pre>\n\n\nEste exemplo é GPT, usando apenas um ID único para as partições.\n\n<pre>\nModelo: Thumb Drive (scsi)\nDisco /dev/sdb: 4041MB\nTamanho do setor (lógico/físico): 512B/512B\nTabela de Partições: gpt\n\nNúmero  Início   Fim     Tamanho   Sistema de arquivos  Nome        Flags\n 1      17.4kB  1000MB  1000MB                  primeiro\n 2      1000MB  4040MB  3040MB                  segundo\n</pre>",
  "exercise": "Execute <b>parted -l</b> em sua máquina e avalie seus resultados.",
  "quizQuestion": "Que tipo de partição é usada para criar mais de 4 partições no esquema de particionamento MBR?",
  "quizAnswer": "estendida",
  "slug": "anatomia-de-um-disco"
}