{
  "id": 4,
  "title": "Particionamento de Disco",
  "lessonContent": "Vamos fazer algumas coisas práticas com sistemas de arquivos trabalhando no processo em uma unidade USB. Se você não tiver uma, não se preocupe, você ainda pode acompanhar as próximas lições. \n\nPrimeiro, precisamos particionar nosso disco. Existem muitas ferramentas disponíveis para fazer isso: \n\n<ul>\n<li>fdisk - ferramenta básica de particionamento de linha de comando, não suporta GPT</li>\n<li>parted - esta é uma ferramenta de linha de comando que suporta particionamento MBR e GPT</li>\n<li>gparted - esta é a versão GUI do parted</li>\n<li>gdisk - fdisk, mas não suporta MBR, apenas GPT</li>\n</ul>\n\nVamos usar o parted para fazer nosso particionamento. Digamos que eu conecte o dispositivo USB e vejamos que o nome do dispositivo é /dev/sdb2. \n\n<b>Iniciar o parted</b>\n\n<pre>$ sudo parted</pre>\n\nVocê entrará na ferramenta parted, onde poderá executar comandos para particionar seu dispositivo. \n\n<b>Selecionar o dispositivo</b>\n\n<pre>select /dev/sdb2</pre>\n\nPara selecionar o dispositivo com o qual você estará trabalhando, selecione-o pelo nome do dispositivo.\n\n<b>Visualizar a tabela de partições atual</b>\n\n<pre>\n(parted) print                                                            \nModelo: Seagate (scsi)\nDisco /dev/sda: 21.5GB\nTamanho do setor (lógico/físico): 512B/512B\nTabela de Partições: msdos\n\nNúmero  Início   Fim     Tamanho  Tipo      Sistema de arquivos     Flags\n 1      1049kB  6860MB  6859MB  primária   ext4                    boot\n 2      6861MB  21.5GB  14.6GB  estendida\n 5      6861MB  7380MB  519MB   lógica    linux-swap(v1)\n 6      7381MB  21.5GB  14.1GB  lógica    xfs\n</pre>\n\nAqui você verá as partições disponíveis no dispositivo. Os pontos de <b>início</b> e <b>fim</b> são onde as partições ocupam espaço no disco rígido, você deve encontrar um bom local de início e fim para suas partições. \n\n<b>Particionar o dispositivo</b>\n\n<pre>mkpart primária 123 4567</pre>\n\nAgora basta escolher um ponto de início e fim e fazer a partição, você precisará especificar o tipo de partição dependendo da tabela que você usou. \n\n<b>Redimensionar uma partição</b>\n\nVocê também pode redimensionar uma partição se não tiver espaço. \n\n<pre>resize 2 1245 3456</pre>\n\nSelecione o número da partição e, em seguida, os pontos de início e fim para onde deseja redimensioná-la. \n\nO parted é uma ferramenta muito poderosa e você deve ter cuidado ao particionar seus discos.",
  "exercise": "Particionar uma unidade USB com metade do disco como ext4 e a outra metade como espaço livre.",
  "quizQuestion": "Qual é o comando do parted para fazer uma partição?",
  "quizAnswer": "mkpart",
  "slug": "particionamentodedisco"
}