{
  "id": 2,
  "title": "Tipos de Sistemas de Arquivos",
  "lessonContent": "Existem muitas implementações de sistemas de arquivos disponíveis. Alguns são mais rápidos do que outros, alguns suportam armazenamento de maior capacidade e outros funcionam apenas em armazenamentos de capacidade menor. Diferentes sistemas de arquivos têm maneiras diferentes de organizar seus dados e vamos detalhar quais tipos de sistemas de arquivos existem. Como há tantas implementações diferentes disponíveis, as aplicações precisam de uma maneira de lidar com as diferentes operações. Então existe algo chamado de camada de abstração do Sistema de Arquivos Virtual (VFS). É uma camada entre as aplicações e os diferentes tipos de sistemas de arquivos, para que, não importa qual sistema de arquivos você tenha, suas aplicações consigam trabalhar com ele. \n\nVocê pode ter muitos sistemas de arquivos em seus discos, dependendo de como eles estão particionados e vamos abordar isso em uma próxima lição.\n\n<b>Journaling</b>\n\nO journaling vem por padrão na maioria dos tipos de sistemas de arquivos, mas caso não tenha, você deve saber o que ele faz. Digamos que você esteja copiando um arquivo grande e de repente perca energia. Bem, se estiver em um sistema de arquivos sem journaling, o arquivo acabaria corrompido e seu sistema de arquivos ficaria inconsistente e então, quando você reiniciar, seu sistema fará uma verificação do sistema de arquivos para garantir que tudo está ok. No entanto, os reparos podem demorar dependendo do tamanho do seu sistema de arquivos. \n\nAgora, se você estivesse em um sistema com journaling, antes mesmo de sua máquina começar a copiar o arquivo, ele escreverá o que você vai fazer em um arquivo de log (journal). Agora, quando você realmente copiar o arquivo, uma vez concluído, o journal marca essa tarefa como concluída. O sistema de arquivos está sempre em um estado consistente por causa disso, então ele saberá exatamente onde você parou se sua máquina desligar repentinamente. Isso também diminui o tempo de inicialização, pois em vez de verificar o sistema de arquivos inteiro, ele apenas olha para o seu journal.\n\n<b>Tipos Comuns de Sistemas de Arquivos de Desktop</b>\n\n<ul>\n<li>ext4 - Esta é a versão mais atual dos sistemas de arquivos nativos do Linux. É compatível com as versões mais antigas ext2 e ext3. Suporta volumes de disco de até 1 exabyte e tamanhos de arquivo de até 16 terabytes e muito mais. É a escolha padrão para sistemas de arquivos do Linux.</li>\n<li>Btrfs - \"Better or Butter FS\", é um novo sistema de arquivos para o Linux que vem com snapshots, backups incrementais, aumento de desempenho e muito mais. Está amplamente disponível, mas ainda não é totalmente estável e compatível.</li>\n<li>XFS - Sistema de arquivos de journaling de alto desempenho, ótimo para um sistema com arquivos grandes, como um servidor de mídia.</li>\n<li>NTFS e FAT - Sistemas de arquivos do Windows</li>\n<li>HFS+ - Sistema de arquivos do Macintosh</li>\n</ul>\n\nConfira quais sistemas de arquivos estão em sua máquina: \n\n<pre>\npete@icebox:~$ df -T\nFilesystem     Type     1K-blocks    Used Available Use% Mounted on\n/dev/sda1      ext4       6461592 2402708   3707604  40% /\nudev           devtmpfs    501356       4    501352   1% /dev\ntmpfs          tmpfs       102544    1068    101476   2% /run\n/dev/sda6      xfs       13752320  460112  13292208   4% /home\n</pre>\n\nO comando <b>df</b> relata o uso do espaço em disco do sistema de arquivos e outros detalhes sobre seu disco, falaremos mais sobre essa ferramenta posteriormente.",
  "exercise": "Faça um pouco de pesquisa online sobre os outros tipos de sistemas de arquivos: ReiserFS, ZFS, JFS e outros que você encontrar.",
  "quizQuestion": "Qual é o tipo comum de sistema de arquivos do Linux?",
  "quizAnswer": "ext4",
  "slug": "tipos-de-sistemas-de-arquivos"
}