{
  "id": 1,
  "title": "Hierarquia do Sistema de Arquivos",
  "lessonContent": "Neste ponto, você provavelmente está bem familiarizado com a estrutura de diretórios do seu sistema, se não estiver, em breve estará. Os sistemas de arquivos podem variar quanto à sua estrutura, mas em sua maior parte devem estar em conformidade com o Padrão de Hierarquia do Sistema de Arquivos. \n\nVá em frente e execute um <b>ls -l /</b> para ver os diretórios listados sob o diretório raiz, o seu pode parecer diferente do meu, mas os diretórios devem, em sua maior parte, se parecer com o seguinte:\n\n<ul>\n<li>/ - O diretório raiz de toda a hierarquia do sistema de arquivos, tudo está aninhado sob este diretório.</li>\n<li>/bin - Programas essenciais prontos para serem executados (binários), inclui os comandos mais básicos como ls e cp.</li>\n<li>/boot - Contém arquivos do carregador de inicialização do kernel.</li>\n<li>/dev - Arquivos de dispositivo.</li>\n<li>/etc - Diretório de configuração do sistema central, deve conter apenas arquivos de configuração e não binários.</li>\n<li>/home - Diretórios pessoais para usuários, armazena seus documentos, arquivos, configurações, etc.</li>\n<li>/lib - Armazena arquivos de biblioteca que binários podem usar.</li>\n<li>/media - Usado como ponto de conexão para mídias removíveis como pen drives USB.</li>\n<li>/mnt - Sistemas de arquivos montados temporariamente.</li>\n<li>/opt - Pacotes de software de aplicativos opcionais.</li>\n<li>/proc - Informações sobre os processos em execução atualmente.</li>\n<li>/root - Diretório pessoal do usuário root.</li>\n<li>/run - Informações sobre o sistema em execução desde a última inicialização.</li>\n<li>/sbin - Contém binários essenciais do sistema, geralmente só podem ser executados pelo root.</li>\n<li>/srv - Dados específicos do site que são servidos pelo sistema.</li>\n<li>/tmp - Armazenamento para arquivos temporários.</li>\n<li>/usr - Infelizmente nomeado, na maioria das vezes não contém arquivos de usuário no sentido de uma pasta pessoal. Destina-se a software e utilitários instalados pelo usuário, no entanto, isso não impede que você adicione diretórios pessoais lá. Dentro deste diretório estão subdiretórios para /usr/bin, /usr/local, etc.</li>\n<li>/var - Diretório variável, é usado para registro do sistema, rastreamento de usuários, caches, etc. Basicamente qualquer coisa que está sujeita a mudanças o tempo todo.</li>\n</ul>",
  "exercise": "Olhe dentro do seu diretório /usr, que tipo de informações estão localizadas lá?",
  "quizQuestion": "Em qual diretório são armazenados os logs?",
  "quizAnswer": "/var",
  "slug": "hierarquiadosistemaarquivos"
}