{
  "id": 11,
  "title": "Inodes",
  "lessonContent": "Lembra como nosso sistema de arquivos é composto por todos os nossos arquivos reais e um banco de dados que gerencia esses arquivos? O banco de dados é conhecido como a tabela de inode. \n\n<b>O que é um inode?</b>\n\nUm inode (nó de índice) é uma entrada nesta tabela e há um para cada arquivo. Ele descreve tudo sobre o arquivo, como:\n\n<ul>\n<li>Tipo de arquivo - arquivo regular, diretório, dispositivo de caractere, etc</li>\n<li>Proprietário</li>\n<li>Grupo</li>\n<li>Permissões de acesso</li>\n<li>Carimbos de data/hora - mtime (hora da última modificação do arquivo), ctime (hora da última alteração de atributo), atime (hora do último acesso)</li>\n<li>Número de links rígidos para o arquivo</li>\n<li>Tamanho do arquivo</li>\n<li>Número de blocos alocados para o arquivo</li>\n<li>Ponteiros para os blocos de dados do arquivo - mais importante!</li>\n</ul>\n\nBasicamente, os inodes armazenam tudo sobre o arquivo, exceto o nome do arquivo e o arquivo em si!\n\n<b>Quando os inodes são criados?</b>\n\nQuando um sistema de arquivos é criado, espaço para inodes também é alocado. Existem algoritmos que determinam quanto espaço de inode você precisa, dependendo do volume do disco e mais. Você provavelmente em algum momento da sua vida viu erros de falta de espaço em disco. Bem, o mesmo pode ocorrer com os inodes também (embora menos comum), você pode ficar sem inodes e, portanto, ser incapaz de criar mais arquivos. Lembre-se de que o armazenamento de dados depende tanto dos dados quanto do banco de dados (inodes). \n\nPara ver quantos inodes restam no seu sistema, use o comando <b>df -i</b>\n\n<b>Informações de Inode</b>\n\nOs inodes são identificados por números, quando um arquivo é criado, é atribuído um número de inode, o número é atribuído em ordem sequencial. No entanto, às vezes você pode notar que ao criar um novo arquivo, ele recebe um número de inode menor que outros, isso ocorre porque uma vez que os inodes são excluídos, eles podem ser reutilizados por outros arquivos. Para visualizar os números de inode, execute <b>ls -li</b>:\n\n<pre>\npete@icebox:~$ ls -li\n140 drwxr-xr-x 2 pete pete 6 Jan 20 20:13 Desktop\n141 drwxr-xr-x 2 pete pete 6 Jan 20 20:01 Documents\n</pre>\n\nO primeiro campo neste comando lista o número de inode.\n\nVocê também pode ver informações detalhadas sobre um arquivo com stat, ele fornece informações sobre o inode também.\n\n<pre>\npete@icebox:~$ stat ~/Desktop/\n  Arquivo: ‘/home/pete/Desktop/’\n  Tamanho: 6               Blocos: 0          Bloco de E/S: 4096   diretório\nDispositivo: 806h/2054d      Inode: 140         Links: 2\nAcesso: (0755/drwxr-xr-x)  Uid: ( 1000/   pete)   Gid: ( 1000/   pete)\nAcesso: 2016-01-20 20:13:50.647435982 -0800\nModificar: 2016-01-20 20:13:06.191675843 -0800\nAlterar: 2016-01-20 20:13:06.191675843 -0800\n Criação: -\n</pre>\n\n\n<b>Como os inodes localizam arquivos?</b>\n\nSabemos que nossos dados estão em algum lugar no disco, infelizmente provavelmente não foram armazenados sequencialmente, então temos que usar inodes. Os inodes apontam para os blocos de dados reais de seus arquivos. Em um sistema de arquivos típico (nem todos funcionam da mesma maneira), cada inode contém 15 ponteiros, os primeiros 12 ponteiros apontam diretamente para os blocos de dados. O 13º ponteiro aponta para um bloco contendo ponteiros para mais blocos, o 14º ponteiro aponta para outro bloco aninhado de ponteiros e o 15º ponteiro aponta novamente para outro bloco de ponteiros! Confuso, eu sei! A razão para fazer isso dessa maneira é manter a estrutura do inode a mesma para cada inode, mas ser capaz de referenciar arquivos de tamanhos diferentes. Se você tiver um arquivo pequeno, poderá encontrá-lo mais rapidamente com os primeiros 12 ponteiros diretos, arquivos maiores podem ser encontrados com os aninhamentos de ponteiros. De qualquer forma, a estrutura do inode é a mesma.",
  "exercise": "Observe alguns números de inode para diferentes arquivos, quais costumam ser criados primeiro?",
  "quizQuestion": "Como você vê quantos inodes restam no seu sistema?",
  "quizAnswer": "df -i",
  "slug": "inodes"
}