{
  "id": 6,
  "title": "montar e desmontar",
  "lessonContent": "Antes de poder visualizar o conteúdo do seu sistema de arquivos, você terá que montá-lo. Para fazer isso, vou precisar da localização do dispositivo, do tipo de sistema de arquivos e de um ponto de montagem, o ponto de montagem é um diretório no sistema onde o sistema de arquivos será anexado. Então, basicamente queremos montar nosso dispositivo em um ponto de montagem. \n\nPrimeiro crie o ponto de montagem, no nosso caso <b>mkdir /mydrive</b>\n\n<pre>$ sudo mount -t ext4 /dev/sdb2 /mydrive</pre>\n\nSimples assim! Agora, quando formos para /mydrive, podemos ver o conteúdo do nosso sistema de arquivos, o <b>-t</b> especifica o tipo de sistema de arquivos, em seguida, temos a localização do dispositivo e, por fim, o ponto de montagem. \n\nPara desmontar um dispositivo de um ponto de montagem: \n\n<pre>$ sudo umount /mydrive \nou \n$ sudo umount /dev/sdb2</pre>\n\nLembre-se de que o kernel nomeia os dispositivos na ordem em que os encontra. E se o nome do nosso dispositivo mudar por algum motivo depois de montá-lo? Bem, felizmente, você pode usar o ID único universal (UUID) de um dispositivo em vez de um nome.\n\nPara visualizar os UUIDs no seu sistema para dispositivos de bloco:\n\n<pre>\npete@icebox:~$ sudo blkid\n/dev/sda1: UUID=\"130b882f-7d79-436d-a096-1e594c92bb76\" TYPE=\"ext4\" \n/dev/sda5: UUID=\"22c3d34b-467e-467c-b44d-f03803c2c526\" TYPE=\"swap\" \n/dev/sda6: UUID=\"78d203a0-7c18-49bd-9e07-54f44cdb5726\" TYPE=\"xfs\" \n</pre>\n\nPodemos ver os nomes dos nossos dispositivos, seus tipos de sistema de arquivos correspondentes e seus UUIDs. Agora, quando quisermos montar algo, podemos usar:\n\n<pre>$ sudo mount UUID=130b882f-7d79-436d-a096-1e594c92bb76 /mydrive</pre>\n\nNa maioria das vezes, você não precisará montar dispositivos via seus UUIDs, é muito mais fácil usar o nome do dispositivo e muitas vezes o sistema operacional saberá montar dispositivos comuns como unidades USB. Se você precisar montar automaticamente um sistema de arquivos na inicialização, como se adicionasse um disco rígido secundário, você vai querer usar o UUID e vamos abordar isso na próxima lição.",
  "exercise": "Olhe a página de manual para mount e umount e veja quais outras opções você pode usar.",
  "quizQuestion": "Qual comando é usado para anexar um sistema de arquivos?",
  "quizAnswer": "mount",
  "slug": "montagemedesmontagemdesistemasdearquivos"
}