{
  "id": 12,
  "title": "symlinks",
  "lessonContent": "Vamos usar um exemplo anterior de informações de inode: \n\n<pre>\npete@icebox:~$ ls -li\n140 drwxr-xr-x 2 pete pete 6 Jan 20 20:13 Desktop\n141 drwxr-xr-x 2 pete pete 6 Jan 20 20:01 Documents\n</pre>\n\nVocê pode ter notado que temos ignorado o terceiro campo no comando ls, esse campo é o contador de links. O contador de links é o número total de links rígidos que um arquivo possui, bem, isso não significa nada para você agora. Então vamos falar sobre links primeiro. \n\n<b>Symlinks</b>\n\nNo sistema operacional Windows, existem coisas conhecidas como atalhos, atalhos são apenas aliases para outros arquivos. Se você fizer algo no arquivo original, você poderia potencialmente quebrar o atalho. No Linux, o equivalente a atalhos são os links simbólicos (ou links suaves ou symlinks). Symlinks nos permitem linkar para outro arquivo pelo seu nome de arquivo. Outro tipo de links encontrados no Linux são os hardlinks, que são na verdade outro arquivo com um link para um inode. Vamos ver o que quero dizer na prática começando com symlinks.\n\n<pre>\npete@icebox:~/Desktop$ echo 'meuarquivo' > meuarquivo\npete@icebox:~/Desktop$ echo 'meuarquivo2' > meuarquivo2\npete@icebox:~/Desktop$ echo 'meuarquivo3' > meuarquivo3\n\npete@icebox:~/Desktop$ ln -s meuarquivo meulink\npete@icebox:~/Desktop$ ls -li\ntotal 12\n  151 -rw-rw-r-- 1 pete pete 7 Jan 21 21:36 meuarquivo\n93401 -rw-rw-r-- 1 pete pete 8 Jan 21 21:36 meuarquivo2\n93402 -rw-rw-r-- 1 pete pete 8 Jan 21 21:36 meuarquivo3\n93403 lrwxrwxrwx 1 pete pete 6 Jan 21 21:39 meulink -> meuarquivo\n</pre>\n\nVocê pode ver que eu criei um link simbólico chamado meulink que aponta para meuarquivo. Os links simbólicos são indicados por ->. Note como eu obtive um novo número de inode, no entanto, symlinks são apenas arquivos que apontam para nomes de arquivos. Quando você modifica um symlink, o arquivo também é modificado. Os números de inode são únicos para sistemas de arquivos, você não pode ter dois do mesmo número de inode em um único sistema de arquivos, o que significa que você não pode referenciar um arquivo em um sistema de arquivos diferente pelo seu número de inode. No entanto, se você usar symlinks, eles não usam números de inode, eles usam nomes de arquivos, então podem ser referenciados em diferentes sistemas de arquivos. \n\n<b>Hardlinks</b>\n\nVamos ver um exemplo de um hardlink:\n\n<pre>\npete@icebox:~/Desktop$ ln meuarquivo2 meuhardlink\npete@icebox:~/Desktop$ ls -li\ntotal 16\n  151 -rw-rw-r-- 1 pete pete 7 Jan 21 21:36 meuarquivo\n93401 -rw-rw-r-- 2 pete pete 8 Jan 21 21:36 meuarquivo2\n93402 -rw-rw-r-- 1 pete pete 8 Jan 21 21:36 meuarquivo3\n93403 lrwxrwxrwx 1 pete pete 6 Jan 21 21:39 meulink -> meuarquivo\n93401 -rw-rw-r-- 2 pete pete 8 Jan 21 21:36 meuhardlink\n</pre>\n\nUm hardlink apenas cria outro arquivo com um link para o mesmo inode. Então, se eu modificasse o conteúdo de meuarquivo2 ou meuhardlink, a mudança seria vista em ambos, mas se eu deletasse meuarquivo2, o arquivo ainda seria acessível através de meuhardlink. Aqui é onde entra em jogo o contador de links em o comando ls. O contador de links é o número de hardlinks que um inode possui, quando você remove um arquivo, ele diminuirá esse contador de links. O inode só é excluído quando todos os hardlinks para o inode forem excluídos. Quando você cria um arquivo, seu contador de links é 1 porque é o único arquivo que está apontando para aquele inode. Ao contrário dos symlinks, os hardlinks não abrangem sistemas de arquivos porque os inodes são únicos para o sistema de arquivos. \n\n<b>Criando um symlink</b>\n\n<pre>\n$ ln -s meuarquivo meulink</pre>\n\nPara criar um link simbólico, você usa o comando ln com -s para simbólico e especifica um arquivo de destino e depois um nome de link. \n\n<b>Criando um hardlink</b>\n\n<pre>\n$ ln algumArquivo algumLink</pre>\n\nSemelhante à criação de um symlink, exceto que desta vez você deixa de fora o -s.",
  "exercise": "Brinque fazendo symlinks e hardlinks, delete alguns e veja o que acontece.",
  "quizQuestion": "Qual é o comando usado para fazer um symlink?",
  "quizAnswer": "ln -s",
  "slug": "symlinks"
}