{
  "id": 1,
  "title": "stdout (Standard Out)",
  "lessonContent": "К настоящему моменту мы уже хорошо знакомы с многими командами и их выводом, и это приводит нас к следующей теме - потокам ввода/вывода (input/output). Давайте выполним следующую команду, и мы обсудим, как это работает. \n\n<pre>$ echo Hello World > peanuts.txt</pre>\n\nЧто только что произошло? Проверьте каталог, где вы выполнили эту команду, и о, чудо, вы должны увидеть файл с именем peanuts.txt, посмотрите внутрь этого файла, и вы увидите текст Hello World. В одной команде произошло много вещей, так что давайте разберем это. \n\nСначала давайте разберем первую часть: \n\n<pre>$ echo Hello World</pre>\n\nМы знаем, что это выводит Hello World на экран, но как? Процессы используют потоки ввода/вывода для получения ввода и возврата вывода. По умолчанию команда echo берет ввод (стандартный ввод или stdin) с клавиатуры и возвращает вывод (стандартный вывод или stdout) на экран. Поэтому, когда вы вводите echo Hello World в своем оболочке, вы видите Hello World на экране. Однако перенаправление ввода/вывода позволяет нам изменить это поведение по умолчанию, что дает нам большую гибкость с файлами. \n\nПерейдем к следующей части команды: \n\n<pre> > </pre>\n\n> - это оператор перенаправления, который позволяет нам изменить место, куда отправляется стандартный вывод. Он позволяет нам отправить вывод echo Hello World в файл вместо экрана. Если файл еще не существует, он будет создан. Однако, если файл уже существует, он будет перезаписан (в зависимости от оболочки, которую вы используете, можно добавить флаг оболочки, чтобы предотвратить это).\n\nИ вот как работает перенаправление stdout!\n\nДопустим, я не хочу перезаписывать мой peanuts.txt, к счастью, для этого также существует оператор перенаправления, >>: \n\n<pre>$ echo Hello World >> peanuts.txt</pre>\n\nЭто добавит Hello World в конец файла peanuts.txt, если файла еще не существует, он будет создан, как это было с оператором >!",
  "exercise": "Попробуйте несколько команд: \n\n<pre>\n$ ls -l /var/log > myoutput.txt\n$ echo Hello World > rm\n$ > somefile.txt \n</pre>",
  "quizQuestion": "Какой оператор перенаправления используется для добавления вывода в файл?",
  "quizAnswer": ">>",
  "slug": "stdoutstandardoutredirect"
}