{
  "id": 1,
  "title": "Interfaces de Red",
  "lessonContent": "Una interfaz de red es cómo el kernel vincula el lado del software de la red con el lado del hardware. Ya hemos visto un ejemplo de esto: \n\n<pre>\npete@icebox:~$ ifconfig -a\neth0      Link encap:Ethernet  HWaddr 1d:3a:32:24:4d:ce  \n          inet addr:192.168.1.129  Bcast:192.168.1.255  Mask:255.255.255.0\n          inet6 addr: fd60::21c:29ff:fe63:5cdc/64 Scope:Link\n</pre>\n\n<b> El comando ifconfig</b>\n\nLa herramienta <b>ifconfig</b> nos permite configurar nuestras interfaces de red, si no tenemos ninguna interfaz de red configurada, los controladores de dispositivos del kernel y la red no sabrán cómo comunicarse entre sí. Ifconfig se ejecuta al arrancar y configura nuestras interfaces a través de archivos de configuración, pero también podemos modificarlas manualmente. La salida de ifconfig muestra el nombre de la interfaz en el lado izquierdo y en el lado derecho muestra información detallada. Comúnmente verás interfaces nombradas eth0 (primera tarjeta Ethernet en la máquina), wlan0 (interfaz inalámbrica), lo (interfaz de bucle). La interfaz de bucle se utiliza para representar tu computadora, simplemente te devuelve a ti mismo. Esto es útil para depurar o conectarte a servidores que se ejecutan localmente. \n\nEl estado de las interfaces puede ser arriba o abajo, como puedes imaginar si quieres \"apagar\" una interfaz puedes establecerla en abajo. Los campos que probablemente verás más en la salida de ifconfig son HWaddr (dirección MAC de la interfaz), dirección inet (dirección IPv4) e inet6 (dirección IPv6). Por supuesto, también puedes ver que la máscara de subred y la dirección de difusión están allí. También puedes ver información de la interfaz en /etc/network/interfaces.\n\n<b>Para crear una interfaz y activarla</b>\n\n<pre>$ ifconfig eth0 192.168.2.1 netmask 255.255.255.0 up</pre>\n\nEsto asigna una dirección IP y máscara de red a la interfaz eth0 y también la activa.\n\n<b>Para activar o desactivar una interfaz</b>\n\n<pre>\n$ ifup eth0\n$ ifdown eth0\n</pre>\n\n<b> El comando ip </b>\n\nEl comando <b>ip</b> también nos permite manipular la pila de red de un sistema. Dependiendo de la distribución que estés utilizando, puede ser el método preferido para manipular la configuración de red. \n\nAquí tienes algunos ejemplos de su uso:\n\n<b>Para mostrar información de la interfaz para todas las interfaces </b>\n<pre>\n$ ip link show\n</pre>\n\n<b>Para mostrar las estadísticas de una interfaz</b>\n<pre>\n$ ip -s link show eth0\n</pre>\n\n\n<b>Para mostrar las direcciones IP asignadas a las interfaces</b>\n\n<pre>\n$ ip address show\n</pre>\n\n<b>Para activar y desactivar interfaces</b>\n\n<pre>\n$ ip link set eth0 up\n$ ip link set eth0 down\n</pre>\n\n<b>Para agregar una dirección IP a una interfaz</b>\n\n<pre>\n$ ip address add 192.168.1.1/24 dev eth0\n</pre>",
  "exercise": "Intenta cambiar el estado de tus interfaces de red a arriba o abajo y observa qué sucede.\n\n¿Puedes cambiar tus interfaces de red con los comandos ifconfig e ip?",
  "quizQuestion": "¿Cuál es el comando para configurar nuestras interfaces de red?",
  "quizAnswer": "ifconfig",
  "slug": "interfacesdered"
}