{
  "id": 4,
  "title": "netstat",
  "lessonContent": "<b>Ports Bien Connus</b>\n\nNous avons discuté de la transmission de données via les ports sur notre machine, regardons maintenant quelques ports bien connus.\n\nVous pouvez obtenir une liste des ports bien connus en regardant le fichier <b>/etc/services</b>: \n\n<pre>\nftp             21/tcp\nssh             22/tcp\nsmtp            25/tcp \ndomain          53/tcp  # DNS\nhttp            80/tcp\nhttps           443/tcp\n..etc..\n</pre>\n\nLa première colonne est le nom du service, puis le numéro de port et le protocole de la couche de transport qu'il utilise.\n\n<b>netstat</b>\n\nUn outil extrêmement utile pour obtenir des informations détaillées sur votre réseau est <b>netstat</b>. Netstat affiche diverses informations liées au réseau telles que les connexions réseau, les tables de routage, les informations sur les interfaces réseau et plus encore, c'est le couteau suisse des outils de mise en réseau. Nous nous concentrerons principalement sur une fonctionnalité que netstat possède et c'est l'état des connexions réseau. Avant de regarder un exemple, parlons d'abord des sockets et des ports. Un socket est une interface qui permet aux programmes d'envoyer et de recevoir des données tandis qu'un port est utilisé pour identifier quelle application doit envoyer ou recevoir des données. L'adresse du socket est la combinaison de l'adresse IP et du port. Chaque connexion entre un hôte et une destination nécessite un socket unique. Par exemple, HTTP est un service qui s'exécute sur le port 80, cependant nous pouvons avoir de nombreuses connexions HTTP et pour maintenir chaque connexion, un socket est créé par connexion.\n\n<pre>\npete@icebox:~$ netstat -at\nConnexions Internet actives (serveurs et établies)\nProto Recv-Q Send-Q Adresse locale           Adresse distante         État      \ntcp        0      0 icebox:domain           *:*                     LISTEN     \ntcp        0      0 localhost:ipp           *:*                     LISTEN     \ntcp        0      0 icebox.lan:44468        124.28.28.50:http       TIME_WAIT  \ntcp        0      0 icebox.lan:34751        124.28.29.50:http       TIME_WAIT  \ntcp        0      0 icebox.lan:34604        economy.canonical.:http TIME_WAIT  \ntcp6       0      0 ip6-localhost:ipp       [::]:*                  LISTEN     \ntcp6       1      0 ip6-localhost:35094     ip6-localhost:ipp       CLOSE_WAIT \ntcp6       0      0 ip6-localhost:ipp       ip6-localhost:35094     FIN_WAIT2\n</pre>\n\nLa commande netstat -a affiche les sockets en écoute et non en écoute pour les connexions réseau, le drapeau -t affiche uniquement les connexions tcp. \n\nLes colonnes sont les suivantes de gauche à droite:\n\n<ul>\n<li>Proto: Protocole utilisé, TCP ou UDP.</li>\n<li>Recv-Q: Données en attente de réception</li>\n<li>Send-Q: Données en attente d'envoi</li>\n<li>Adresse locale: Hôte connecté localement</li>\n<li>Adresse distante: Hôte connecté à distance</li>\n<li>État: L'état du socket</li>\n</ul>\n\nConsultez la page de manuel pour une liste des états de socket, mais voici quelques-uns:\n\n<ul>\n<li>LISTENING: Le socket écoute les connexions entrantes, rappelez-vous que lorsque nous établissons une connexion TCP, notre destination doit nous écouter avant que nous puissions nous connecter.</li>\n<li>SYN_SENT: Le socket tente activement d'établir une connexion.</li>\n<li>ESTABLISHED: Le socket a une connexion établie</li>\n<li>CLOSE_WAIT: L'hôte distant s'est arrêté et nous attendons que le socket se ferme</li>\n<li>TIME_WAIT: Le socket attend après la fermeture pour traiter les paquets encore dans le réseau</li>\n </ul>",
  "exercise": "Consultez la page de manuel de netstat et apprenez toutes les fonctionnalités qu'il offre.",
  "quizQuestion": "Quel port est utilisé pour HTTPS?",
  "quizAnswer": "443",
  "slug": "netstat"
}