{
  "id": 5,
  "title": "Analyse de paquets",
  "lessonContent": "Le sujet de l'analyse de paquets pourrait remplir tout un cours à lui seul et de nombreux livres ont été écrits uniquement sur l'analyse de paquets. Cependant, aujourd'hui nous allons simplement apprendre les bases. Il existe deux analyseurs de paquets extrêmement populaires, Wireshark et tcpdump. Ces outils analysent vos interfaces réseau, capturent l'activité des paquets, analysent les paquets et affichent les informations pour que nous puissions les voir. Ils nous permettent d'entrer dans les détails de l'analyse réseau et d'explorer les aspects les plus bas niveau. Nous utiliserons tcpdump car il a une interface plus simple, cependant si vous souhaitez vous lancer dans l'analyse de paquets, je vous recommande de vous intéresser à Wireshark.\n\n<b>Installer tcpdump</b>\n\n<pre>\n$ sudo apt install tcpdump\n</pre>\n\n<b>Capturer des données de paquets sur une interface</b>\n\n<pre>\npete@icebox:~$ sudo tcpdump -i wlan0\ntcpdump: sortie verbeuse supprimée, utilisez -v ou -vv pour un décodage complet des protocoles\nécoute sur wlan0, type de liaison EN10MB (Ethernet), taille de capture 65535 octets\n11:28:23.958840 IP icebox.lan > nuq04s29-in-f4.1e100.net: demande d'écho ICMP, id 1901, seq 2, longueur 64\n11:28:23.970928 IP nuq04s29-in-f4.1e100.net > icebox.lan: réponse d'écho ICMP, id 1901, seq 2, longueur 64\n11:28:24.960464 IP icebox.lan > nuq04s29-in-f4.1e100.net: demande d'écho ICMP, id 1901, seq 3, longueur 64\n11:28:24.979299 IP nuq04s29-in-f4.1e100.net > icebox.lan: réponse d'écho ICMP, id 1901, seq 3, longueur 64\n11:28:25.961869 IP icebox.lan > nuq04s29-in-f4.1e100.net: demande d'écho ICMP, id 1901, seq 4, longueur 64\n11:28:25.976176 IP nuq04s29-in-f4.1e100.net > icebox.lan: réponse d'écho ICMP, id 1901, seq 4, longueur 64\n11:28:26.963667 IP icebox.lan > nuq04s29-in-f4.1e100.net: demande d'écho ICMP, id 1901, seq 5, longueur 64\n11:28:26.976137 IP nuq04s29-in-f4.1e100.net > icebox.lan: réponse d'écho ICMP, id 1901, seq 5, longueur 64\n11:28:30.674953 ARP, Demande qui a 172.254.1.0 dit ThePickleParty.lan, longueur 28\n11:28:31.190665 IP ThePickleParty.lan.51056 > 192.168.86.255.rfe: UDP, longueur 306\n</pre>\n\nVous remarquerez beaucoup de choses se produire lorsque vous lancez une capture de paquets, c'est normal car il y a beaucoup d'activité réseau en arrière-plan. Dans mon exemple ci-dessus, j'ai pris seulement un extrait de ma capture, spécifiquement au moment où j'ai décidé de faire un ping sur www.google.com. \n\n<b>Comprendre la sortie</b>\n\n<pre>\n11:28:23.958840 IP icebox.lan > nuq04s29-in-f4.1e100.net: demande d'écho ICMP, id 1901, seq 2, longueur 64\n11:28:23.970928 IP nuq04s29-in-f4.1e100.net > icebox.lan: réponse d'écho ICMP, id 1901, seq 2, longueur 64\n</pre>\n\n<ul>\n<li>Le premier champ est un horodatage de l'activité réseau</li>\n<li>IP, contient les informations du protocole</li>\n<li>Ensuite, vous verrez l'adresse source et de destination : icebox.lan > nuq04s29-in-f4.1e100.net</li>\n<li>seq, il s'agit du numéro de séquence de début et de fin des paquets TCP</li>\n<li>longueur, longueur en octets</li>\n</ul>\n\nComme vous pouvez le voir dans notre sortie tcpdump, nous envoyons un paquet de demande d'écho ICMP à www.google.com et recevons en retour un paquet de réponse d'écho ICMP ! Notez également que différents paquets afficheront des informations différentes, consultez le manuel pour voir ce que sont ces informations.\n\n<b>Écrire la sortie de tcpdump dans un fichier</b>\n\n<pre>\n$ sudo tcpdump -w /some/file\n</pre>\n\n\nQuelques réflexions finales : nous avons seulement effleuré la surface du sujet de l'analyse de paquets. Il y a tellement de choses à explorer et nous n'avons même pas abordé l'approfondissement avec la sortie Hex et ASCII. Il existe de nombreuses ressources en ligne pour vous aider à en apprendre davantage sur les analyseurs de paquets et je vous encourage à les trouver !",
  "exercise": "Téléchargez et installez l'outil Wireshark et explorez l'interface.",
  "quizQuestion": "Quel est le drapeau pour capturer une interface spécifique avec tcpdump?",
  "quizAnswer": "-i",
  "slug": "analysepaquets"
}