{
  "id": 2,
  "title": "ping",
  "lessonContent": "Un des outils de réseau les plus simples <b>ping</b>, il est utilisé pour tester si un paquet peut atteindre un hôte ou non. Il fonctionne en envoyant des paquets de demande de type ICMP echo (Type 8) vers l'hôte de destination et en attendant une réponse de type ICMP echo (Type 0). Le ping réussit lorsque l'hôte envoie le paquet de demande et reçoit une réponse de la cible. Regardons un exemple: \n\n<pre>\npete@icebox:~$ ping -c 3 www.google.com\nPING www.google.com (74.125.239.112) 56(84) octets de données.\n64 octets de nuq05s01-in-f16.1e100.net (74.125.239.112): icmp_seq=1 ttl=128 temps=29.0 ms\n64 octets de nuq05s01-in-f16.1e100.net (74.125.239.112): icmp_seq=2 ttl=128 temps=23.7 ms\n64 octets de nuq05s01-in-f16.1e100.net (74.125.239.112): icmp_seq=3 ttl=128 temps=15.1 ms\n</pre>\n\nDans cet exemple, nous utilisons ping pour vérifier si nous pouvons accéder à www.google.com. Le drapeau -c (compter) est utilisé pour arrêter l'envoi de paquets de demande echo une fois que le nombre spécifié a été atteint. \n\nLa première partie indique que nous envoyons des paquets de 64 octets à 74.125.239.112 (google.com) et le reste nous montre les détails du trajet. Par défaut, il envoie un paquet par seconde.\n\n<b>icmp_seq</b>\n\nLe champ icmp_seq est utilisé pour montrer le numéro de séquence des paquets envoyés, donc dans ce cas, j'ai envoyé 3 paquets et nous pouvons voir que les 3 paquets sont revenus. Si vous faites un ping et que vous constatez que certains numéros de séquence manquent, cela signifie qu'un problème de connectivité se produit et que tous vos paquets ne passent pas. Si le numéro de séquence est désordonné, votre connexion est probablement très lente car vos paquets dépassent la valeur par défaut d'une seconde. \n\n<b>ttl</b>\n\nLe champ Time To Live (ttl) est utilisé comme compteur de saut, à chaque saut, il décrémente le compteur de un et une fois que le compteur de saut atteint 0, notre paquet meurt. Cela est censé donner au paquet une durée de vie, nous ne voulons pas que nos paquets voyagent indéfiniment.\n\n<b>time</b>\n\nLe temps de trajet qu'il a fallu depuis l'envoi du paquet de demande echo jusqu'à la réception d'une réponse echo.",
  "exercise": "Faites un ping sur un site web et examinez la sortie que vous recevez.",
  "quizQuestion": "Quelle est l'unité de mesure du temps de trajet?",
  "quizAnswer": "ms",
  "slug": "ping"
}