{
  "id": 8,
  "title": "リンク層",
  "lessonContent": "TCP/IPモデルの最下層にはリンク層があります。この層はハードウェア固有の層です。\n\nリンク層では、パケットは再びフレームと呼ばれるものにカプセル化されます。フレームヘッダーには、ホストのソースと宛先MACアドレス、チェックサム、パケットセパレータが添付され、受信者がパケットの終了を判断できます。\n\n幸いなことに、私たちは同じネットワーク上にいるので、パケットは遠くには移動しません。最初に、リンク層は私のソースMACアドレスをフレームヘッダーに添付しますが、パティのMACアドレスも知る必要があります。それをどのように知り、インターネット上にないので私がそれを見つける方法は何でしょうか？ ARPを使用します！\n\n<b>ARP（アドレス解決プロトコル）</b>\n\nARPはIPアドレスに関連付けられたMACアドレスを見つけます。ARPは同じネットワーク内で使用されます。パティが同じネットワーク上にいない場合、パケットを受け取る次のルーターを決定するためにルーティングシステムを使用し、同じネットワーク上にいるとARPを使用できます。\n\n同じネットワーク上にいると、システムはまずARPルックアップテーブルを使用して、どのIPアドレスがどのMACアドレスに関連付けられているかの情報を格納します。その値がそこにない場合、ARPが使用されます。その後、システムはARPプロトコルを使用してネットワークにブロードキャストメッセージを送信し、IPアドレス10.10.1.4を持つホストがどれかを調べます。ブロードキャストメッセージは、ネットワーク上のすべてのホストに送信される特別なメッセージです（ブロードキャスト送信のために適切に名前が付けられています）。要求されたIPアドレスを持つ任意のマシンは、IPアドレスとMACアドレスを含むARPパケットで応答します。\n\n必要なデータ、つまりIPアドレスとMACアドレスをすべて取得したら、リンク層はこのフレームをネットワークインターフェースカードを介して転送し、次のデバイスに送り、パティのネットワークを見つけます。このステップは、私が説明した方法よりも少し複雑ですが、ルーティングコースで詳細を説明します。\n\nこれがTCP/IP層を下って単純（またはそうでない）なパケットの移動です。パケットはこのように一方通行で移動するわけではありません。まだパティのネットワークに到達していません！ネットワークを通過する際には、データを送受信する前に少なくともTCP/IPモデルを2回通過する必要があります。実際には、このパケットの見た目は次のようになります：\n\n<b>パケットの移動</b>\n\n<ol>\n<li>PeteがPattyにメールを送信：このデータはトランスポート層に送信されます。</li>\n<li>トランスポート層はデータをTCPまたはUDPヘッダーにカプセル化してセグメントを形成し、セグメントは宛先とソースのTCPまたはUDPポートを添付し、セグメントはネットワーク層に送信されます。</li>\n<li>ネットワーク層はTCPセグメントをIPパケット内にカプセル化し、ソースと宛先IPアドレスを添付します。その後、パケットをリンク層にルーティングします。</li>\n<li>パケットは次にPeteの物理ハードウェアに到達し、フレームにカプセル化されます。ソースと宛先MACアドレスがフレームに追加されます。</li>\n<li>Pattyはこのデータフレームを物理層を介して受信し、各フレームをデータの整合性をチェックし、その後フレームの内容を取り出してIPパケットをネットワーク層に送信します。</li>\n<li>ネットワーク層は以前に添付されたソースと宛先IPを見つけるためにパケットを読み取ります。自分のIPが宛先IPと同じかどうかをチェックし、同じであれば！パケットをデカプセル化してセグメントをトランスポート層に送信します。</li>\n<li>トランスポート層はセグメントをデカプセル化し、TCPまたはUDPポート番号をチェックし、そのポート番号に基づいてアプリケーション層に接続を行います。</li>\n<li>アプリケーション層は、指定されたポートでトランスポート層からデータを受信し、最終的なメールメッセージとしてPattyに表示します。</li>\n</ol>",
  "exercise": "このレッスンには練習問題はありません。",
  "quizQuestion": "同じネットワーク上でMACアドレスを見つけるために使用されるものは何ですか？",
  "quizAnswer": "ARP",
  "slug": "linklayer"
}