{
  "id": 2,
  "title": "Primeros algunos archivos de registro estándar. Registro por facilidad.",
  "lessonContent": "El servicio syslog gestiona y envía registros al registrador del sistema. Rsyslog es una versión avanzada de syslog, la mayoría de las distribuciones de Linux deberían estar utilizando esta nueva versión. La salida de todos los registros que recopila el servicio syslog se puede encontrar en /var/log/syslog (cada mensaje excepto los mensajes de autenticación).\n\nPara saber qué archivos mantiene nuestro registrador del sistema, mira los archivos de configuración en /etc/rsyslog.d:\n\n<pre>\npete@icebox:~$ less /etc/rsyslog.d/50-default.conf \n#\nauth,authpriv.*                 /var/log/auth.log\n*.*;auth,authpriv.none          -/var/log/syslog\n#cron.*                         /var/log/cron.log\n#daemon.*                       -/var/log/daemon.log\nkern.*                          -/var/log/kern.log\n#lpr.*                          -/var/log/lpr.log\nmail.*                          -/var/log/mail.log\n#user.*                         -/var/log/user.log\n</pre>\n\nEstas reglas para archivos de registro están indicadas por el selector en la columna de la izquierda y la acción en la columna de la derecha. La acción nos dice dónde enviar la información de registro, a un archivo, consola, etc. Recuerda que no todas las aplicaciones y servicios utilizan rsyslog para gestionar sus registros, por lo que si quieres saber específicamente qué se registra, tendrás que mirar dentro de este directorio.\n\nVeamos la acción de registro en realidad, puedes enviar manualmente un registro con el comando logger:\n\n<pre>\nlogger -s Hola\n</pre>\n\nAhora mira dentro de tu /var/log/syslog y deberías ver esta entrada en tus registros!",
  "exercise": "Mira tu archivo de configuración /etc/rsyslog.d y ve qué más se está registrando a través del registrador del sistema.",
  "quizQuestion": "¿Qué comando puedes usar para registrar manualmente un mensaje?",
  "quizAnswer": "logger",
  "slug": "syslog"
}