{
  "id": 1,
  "title": "Registro del sistema",
  "lessonContent": "Los servicios, kernel, demonios, etc en tu sistema están constantemente haciendo algo, estos datos se envían para ser guardados en tu sistema en forma de registros. Esto nos permite tener un diario legible por humanos de los eventos que están ocurriendo en nuestro sistema. Estos datos generalmente se mantienen en el directorio /var, el directorio /var es donde guardamos nuestros datos variables, ¡como los registros!\n\n¿Cómo se reciben incluso estos mensajes en tu sistema? Existe un servicio llamado syslog que envía esta información al registrador del sistema. \n\nSyslog en realidad contiene muchos componentes, uno de los importantes es un demonio en ejecución llamado syslogd (las distribuciones de Linux más nuevas utilizan rsyslogd), que espera a que ocurran mensajes de eventos y filtra aquellos sobre los que desea saber, y dependiendo de lo que se supone que debe hacer con ese mensaje, lo enviará a un archivo, a tu consola o no hará nada con él.\n\nPensarías que este registrador del sistema es el lugar centralizado para gestionar registros, pero desafortunadamente no lo es. Verás muchas aplicaciones que escriben sus propias reglas de registro y generan diferentes archivos de registro, sin embargo, en general, el formato de los registros debería incluir una marca de tiempo y los detalles del evento. \n\nAquí tienes un ejemplo de una línea de syslog:\n\n<pre>\npete@icebox:~$ less /var/log/syslog\nJan 27 07:41:32 icebox anacron[4650]: Job `cron.weekly' started\n</pre>\n\nAquí podemos ver que el 27 de enero a las 07:41:32 nuestro servicio cron ejecutó el trabajo cron.weekly. Puedes ver todos los mensajes de eventos que recopila syslog en el archivo /var/log/syslog.",
  "exercise": "Mira tu archivo /var/log/syslog y ve qué más está ocurriendo en tu máquina.",
  "quizQuestion": "¿Cuál es el demonio que gestiona los registros en los sistemas Linux más nuevos?",
  "quizAnswer": "rsyslogd",
  "slug": "registrodelSistema"
}