{
  "id": 2,
  "title": "rsync",
  "lessonContent": "Un autre outil utilisé pour copier des données entre différents hôtes est rsync (abréviation de synchronisation à distance). Rsync est très similaire à scp, mais il présente une différence majeure. Rsync utilise un algorithme spécial qui vérifie à l'avance s'il existe déjà des données que vous êtes en train de copier et ne copiera que les différences. Par exemple, imaginons que vous copiez un fichier et que votre réseau soit interrompu, arrêtant ainsi votre copie en cours. Au lieu de tout recopier depuis le début, rsync ne copiera que les parties qui n'ont pas été copiées. \n\nIl vérifie également l'intégrité d'un fichier que vous copiez avec des sommes de contrôle. Ces petites optimisations permettent une plus grande flexibilité de transfert de fichiers et rendent rsync idéal pour la synchronisation de répertoires à distance et localement, les sauvegardes de données, les transferts de données volumineux, etc.\n\nQuelques options couramment utilisées avec rsync :\n\n<ul>\n<li>v - affichage détaillé</li>\n<li>r - récursif dans les répertoires</li>\n<li>h - affichage lisible par l'homme</li>\n<li>z - compressé pour un transfert plus facile, idéal pour les connexions lentes</li>\n</ul>\n\n<b>Copier/synchroniser des fichiers sur le même hôte</b>\n\n<pre>$ rsync -zvr /mon/répertoire/local/un /mon/répertoire/local/deux</pre>\n\n<b>Copier/synchroniser des fichiers vers l'hôte local depuis un hôte distant</b>\n\n<pre>$ rsync /répertoire/local nom_utilisateur@hôte_distant.com:/répertoire/à_distance</pre>\n\n<b>Copier/synchroniser des fichiers vers un hôte distant depuis un hôte local</b>\n\n<pre>$ rsync nom_utilisateur@hôte_distant.com:/répertoire/à_distance /répertoire/local</pre>",
  "exercise": "Utilisez rsync pour synchroniser un répertoire avec un autre répertoire, assurez-vous de ne pas écraser un répertoire important !",
  "quizQuestion": "Quelle commande serait utile pour les sauvegardes de données ?",
  "quizAnswer": "rsync",
  "slug": "rsync"
}