{
  "id": 5,
  "title": "Samba",
  "lessonContent": "Aux débuts de l'informatique, il est devenu nécessaire pour les machines Windows de partager des fichiers avec des machines Linux, d'où la naissance du protocole Server Message Block (SMB). SMB était utilisé pour le partage de fichiers entre les systèmes d'exploitation Windows (Mac dispose également du partage de fichiers avec SMB) puis il a été nettoyé et optimisé sous la forme du protocole Common Internet File System (CIFS).\n\nSamba est ce que nous appelons les utilitaires Linux pour travailler avec CIFS sur Linux. En plus du partage de fichiers, vous pouvez également partager des ressources comme des imprimantes.\n\n<b>Créer un partage réseau avec Samba</b>\n\nPassons en revue les étapes de base pour créer un partage réseau auquel une machine Windows peut accéder :\n\n<b>Installer Samba</b>\n\n<pre>$ sudo apt update\n$ sudo apt install samba</pre>\n\n<b>Configurer smb.conf</b>\n\nLe fichier de configuration de Samba se trouve à /etc/samba/smb.conf, ce fichier doit indiquer au système quels répertoires doivent être partagés, leurs autorisations d'accès et d'autres options. Le smb.conf par défaut contient déjà beaucoup de code commenté que vous pouvez utiliser comme exemple pour rédiger vos propres configurations.\n\n<pre>$ sudo vi /etc/samba/smb.conf</pre>\n\n<b>Configurer un mot de passe pour Samba</b>\n\n<pre>$ sudo smbpasswd -a [nom_utilisateur]</pre>\n\n<b>Créer un répertoire partagé</b>\n\n<pre>$ mkdir /mon/répertoire/à/partager</pre>\n\n<b>Redémarrer le service Samba</b>\n\n<pre>$ sudo service smbd restart</pre>\n\n<b>Accéder à un partage Samba via Windows</b>\n\nSous Windows, tapez simplement la connexion réseau dans l'invite d'exécution : \\\\HÔTE\\nom_partage.\n\n<b>Accéder à un partage Samba/Windows via Linux</b>\n\n<pre>$ smbclient //HÔTE/répertoire -U utilisateur</pre>\n\nLe package Samba inclut un outil en ligne de commande appelé <b>smbclient</b> que vous pouvez utiliser pour accéder à n'importe quel serveur Windows ou Samba. Une fois connecté au partage, vous pouvez naviguer et transférer des fichiers.\n\n<b>Attacher un partage Samba à votre système</b>\n\nAu lieu de transférer des fichiers un par un, vous pouvez simplement monter le partage réseau sur votre système.\n\n<pre>$ sudo mount -t cifs nom_serveur:répertoire point_de_montage -o utilisateur=nom_utilisateur,mot_de_passe=mdp</pre>",
  "exercise": "Configurer un partage Samba, si vous n'en avez pas, ouvrez smb.conf et familiarisez-vous avec les options du fichier de configuration.",
  "quizQuestion": "Quel est le dernier protocole utilisé pour le transfert de fichiers entre Windows et Linux?",
  "quizAnswer": "CIFS",
  "slug": "samba"
}