{
  "id": 1,
  "title": "/dev répertoire",
  "lessonContent": "Lorsque vous connectez un périphérique à votre machine, il a généralement besoin d'un pilote de périphérique pour fonctionner correctement. Vous pouvez interagir avec les pilotes de périphérique via des fichiers de périphérique ou des nœuds de périphérique, qui sont des fichiers spéciaux ressemblant à des fichiers réguliers. Comme ces fichiers de périphérique sont similaires à des fichiers réguliers, vous pouvez utiliser des programmes tels que ls, cat, etc. pour interagir avec eux. Ces fichiers de périphérique sont généralement stockés dans le répertoire /dev. Allez-y et faites un ls du répertoire /dev sur votre système, vous verrez un grand nombre de fichiers de périphérique qui sont sur votre système. \n\n<pre>$ ls /dev </pre>\n\nCertains de ces périphériques que vous avez déjà utilisés et avec lesquels vous avez interagi, comme /dev/null. Souvenez-vous que lorsque nous envoyons une sortie vers /dev/null, le noyau sait que ce périphérique prend toute notre entrée et la rejette simplement, donc rien n'est renvoyé.\n\nAutrefois, si vous vouliez ajouter un périphérique à votre système, vous ajoutiez le fichier de périphérique dans /dev et l'oubliiez probablement ensuite. Eh bien, répétez cela quelques fois et vous verrez où était le problème. Le répertoire /dev serait encombré de fichiers de périphérique statiques de périphériques que vous avez depuis longtemps mis à niveau, arrêté d'utiliser, etc. Les périphériques se voient également attribuer des fichiers de périphérique dans l'ordre où le noyau les trouve. Ainsi, si à chaque redémarrage de votre système, les périphériques pouvaient avoir des fichiers de périphérique différents en fonction de leur découverte.\n\nHeureusement, nous n'utilisons plus cette méthode, maintenant nous avons quelque chose que nous utilisons pour ajouter et supprimer dynamiquement les périphériques actuellement utilisés sur le système et nous en discuterons dans les prochaines leçons.",
  "exercise": "Consultez le contenu du répertoire /dev, reconnaissez-vous des périphériques familiers?",
  "quizQuestion": "Où sont stockés les fichiers de périphérique sur le système?",
  "quizAnswer": "/dev",
  "slug": "devdirectory"
}