{
  "id": 2,
  "title": "types de périphériques",
  "lessonContent": "Avant de discuter de la gestion des périphériques, regardons en fait quelques périphériques.\n\n<pre>$ ls -l /dev\nbrw-rw----   1 root disk      8,   0 Dec 20 20:13 sda\ncrw-rw-rw-   1 root root      1,   3 Dec 20 20:13 null\nsrw-rw-rw-   1 root root           0 Dec 20 20:13 log\nprw-r--r--   1 root root           0 Dec 20 20:13 fdata\n</pre>\n\nLes colonnes sont les suivantes de gauche à droite :\n\n<ul>\n<li>Permissions</li>\n<li>Propriétaire</li>\n<li>Groupe</li>\n<li>Numéro de périphérique majeur</li>\n<li>Numéro de périphérique mineur</li>\n<li>Horodatage</li>\n<li>Nom du périphérique</li>\n</ul>\n\nRappelez-vous que dans la commande ls, vous pouvez voir le type de fichier avec le premier bit de chaque ligne. Les fichiers de périphérique sont désignés comme suit : \n\n<ul>\n<li>c - caractère</li>\n<li>b - bloc</li>\n<li>p - tube</li>\n<li>s - socket</li>\n</ul>\n\n<b>Périphérique Caractère</b>\n\nCes périphériques transfèrent des données, mais un caractère à la fois. Vous verrez beaucoup de pseudo-périphériques (/dev/null) en tant que périphériques de caractères, ces périphériques ne sont pas vraiment connectés physiquement à la machine, mais ils permettent une plus grande fonctionnalité au système d'exploitation. \n\n<b>Périphérique Bloc</b>\n\nCes périphériques transfèrent des données, mais par blocs de taille fixe. Vous verrez le plus souvent des périphériques qui utilisent des blocs de données en tant que périphériques de bloc, tels que les disques durs, les systèmes de fichiers, etc. \n\n<b>Périphérique Tube</b>\n\nLes tubes nommés permettent à deux processus ou plus de communiquer entre eux, ils sont similaires aux périphériques de caractères, mais au lieu d'envoyer la sortie vers un périphérique, elle est envoyée à un autre processus. \n\n<b>Périphérique Socket</b>\n\nLes périphériques de socket facilitent la communication entre les processus, similaires aux périphériques de tube mais ils peuvent communiquer avec de nombreux processus à la fois. \n\n<b>Caractérisation du Périphérique</b>\n\nLes périphériques sont caractérisés en utilisant deux nombres, le <b>numéro de périphérique majeur</b> et le <b>numéro de périphérique mineur</b>. Vous pouvez voir ces nombres dans l'exemple ls ci-dessus, ils sont séparés par une virgule. Par exemple, disons qu'un périphérique avait les numéros de périphérique : <b>8, 0</b> :\n\nLe numéro de périphérique majeur représente le pilote de périphérique qui est utilisé, dans ce cas 8, qui est souvent le numéro majeur pour les périphériques de bloc sd. Le numéro mineur indique au noyau quel périphérique unique il s'agit dans cette classe de pilote, dans ce cas 0 est utilisé pour représenter le premier périphérique (a).",
  "exercise": "Regardez votre répertoire /dev et découvrez quels types de périphériques vous pouvez voir.",
  "quizQuestion": "Quel est le symbole pour les périphériques de caractères dans la commande ls -l ?",
  "quizAnswer": "c",
  "slug": "typesdeperipheriques"
}