{
  "id": 3,
  "title": "Noms des périphériques",
  "lessonContent": "Voici les noms de périphériques les plus courants que vous rencontrerez : \n\n<b>Périphériques SCSI</b>\n\nSi vous avez un quelconque stockage de masse sur votre machine, il est probable qu'il utilise le protocole SCSI (prononcé \"scuzzy\"). SCSI signifie Small Computer System Interface, c'est un protocole utilisé pour permettre la communication entre les disques, imprimantes, scanners et autres périphériques avec votre système. Vous avez peut-être entendu parler de périphériques SCSI qui ne sont pas réellement utilisés dans les systèmes modernes, cependant nos systèmes Linux associent les disques SCSI avec les disques durs dans /dev. Ils sont représentés par un préfixe sd (disque SCSI) :\n\nFichiers de périphériques SCSI courants :\n\n<ul>\n<li>/dev/sda - Premier disque dur</li>\n<li>/dev/sdb - Deuxième disque dur</li>\n<li>/dev/sda3 - Troisième partition sur le premier disque dur</li>\n</ul>\n\n<b>Périphériques Pseudo</b>\n\nComme nous l'avons déjà discuté, les périphériques pseudo ne sont pas réellement connectés physiquement à votre système, les périphériques pseudo les plus courants sont les périphériques de caractères : \n\n<ul>\n<li>/dev/zero - accepte et rejette toutes les entrées, produit un flux continu de NULL (zéro) bytes</li>\n<li>/dev/null - accepte et rejette toutes les entrées, ne produit aucune sortie</li>\n<li>/dev/random - produit des nombres aléatoires</li>\n</ul>\n\n<b>Périphériques PATA</b>\n\nParfois, dans les anciens systèmes, vous pouvez voir des disques durs être désignés avec un préfixe hd : \n\n<ul>\n<li>/dev/hda - Premier disque dur</li>\n<li>/dev/hdd2 - Deuxième partition sur le 4ème disque dur</li>\n</ul>",
  "exercise": "Écrivez sur les périphériques pseudo et voyez ce qui se passe, faites attention de ne pas écrire sur vos disques à travers ces périphériques !",
  "quizQuestion": "Quel serait communément le nom du périphérique pour la première partition sur le deuxième disque SCSI ?",
  "quizAnswer": "sdb1",
  "slug": "nomsdesperipheriques"
}