{
  "id": 1,
  "title": "Сетевые интерфейсы",
  "lessonContent": "Сетевой интерфейс - это то, как ядро связывает программную часть сетевого взаимодействия с аппаратной частью. Мы уже видели пример этого:\n\n<pre>\npete@icebox:~$ ifconfig -a\neth0      Link encap:Ethernet  HWaddr 1d:3a:32:24:4d:ce  \n          inet addr:192.168.1.129  Bcast:192.168.1.255  Mask:255.255.255.0\n          inet6 addr: fd60::21c:29ff:fe63:5cdc/64 Scope:Link\n</pre>\n\n<b> Команда ifconfig</b>\n\nИнструмент <b>ifconfig</b> позволяет нам настраивать наши сетевые интерфейсы. Если сетевые интерфейсы не настроены, драйверы устройств ядра и сеть не смогут взаимодействовать. Ifconfig запускается при загрузке и настраивает наши интерфейсы через файлы конфигурации, но мы также можем их изменять вручную. Вывод ifconfig показывает имя интерфейса слева, а справа - подробную информацию. Чаще всего вы увидите интерфейсы с именами eth0 (первая сетевая карта в устройстве), wlan0 (беспроводной интерфейс), lo (петлевой интерфейс). Петлевой интерфейс используется для представления вашего компьютера, он просто возвращает вас к себе. Это полезно для отладки или подключения к серверам, работающим локально.\n\nСостояние интерфейсов может быть активным (up) или неактивным (down), если вы хотите \"выключить\" интерфейс, вы можете установить его в неактивное состояние. В выводе ifconfig вы обычно будете смотреть на HWaddr (MAC-адрес интерфейса), inet address (IPv4-адрес) и inet6 (IPv6-адрес). Конечно же, там же указаны маска подсети и широковещательный адрес. Вы также можете просматривать информацию об интерфейсе в /etc/network/interfaces.\n\n<b>Для создания интерфейса и активации его</b>\n\n<pre>$ ifconfig eth0 192.168.2.1 netmask 255.255.255.0 up</pre>\n\nЭто назначает IP-адрес и маску подсети интерфейсу eth0 и активирует его.\n\n<b>Для активации или деактивации интерфейса</b>\n\n<pre>\n$ ifup eth0\n$ ifdown eth0\n</pre>\n\n<b> Команда ip </b>\n\nКоманда <b>ip</b> также позволяет нам управлять сетевым стеком системы. В зависимости от используемого дистрибутива, это может быть предпочтительным методом настройки сети. \n\nВот некоторые примеры ее использования:\n\n<b>Для отображения информации об интерфейсах</b>\n<pre>\n$ ip link show\n</pre>\n\n<b>Для отображения статистики интерфейса</b>\n<pre>\n$ ip -s link show eth0\n</pre>\n\n<b>Для отображения назначенных IP-адресов интерфейсам</b>\n<pre>\n$ ip address show\n</pre>\n\n<b>Для активации и деактивации интерфейсов</b>\n<pre>\n$ ip link set eth0 up\n$ ip link set eth0 down\n</pre>\n\n<b>Для добавления IP-адреса к интерфейсу</b>\n<pre>\n$ ip address add 192.168.1.1/24 dev eth0\n</pre>",
  "exercise": "Попробуйте изменить состояние ваших сетевых интерфейсов на активное или неактивное и наблюдайте, что происходит.\n\nМожете ли вы изменить состояние сетевых интерфейсов с помощью команд ifconfig и ip?",
  "quizQuestion": "Какая команда используется для настройки наших сетевых интерфейсов?",
  "quizAnswer": "ifconfig",
  "slug": "networkinterfaces"
}