{
  "id": 5,
  "title": "env (Environnement)",
  "lessonContent": "Exécutez la commande suivante : \n\n<pre>$ echo $HOME</pre>\n\nVous devriez voir le chemin de votre répertoire personnel, le mien ressemble à /home/pete. \n\nEt cette commande ? \n\n<pre>$ echo $USER </pre>\n\nVous devriez voir votre nom d'utilisateur !\n\nD'où proviennent ces informations ? Elles proviennent de vos variables d'environnement. Vous pouvez les afficher en tapant\n\n<pre>$ env </pre>\n\nCela affiche une grande quantité d'informations sur les variables d'environnement que vous avez actuellement définies. Ces variables contiennent des informations utiles que l'interpréteur de commandes et d'autres processus peuvent utiliser.\n\nVoici un court exemple :\n\n<pre>\nPATH=/usr/local/sbin:/usr/local/bin:/usr/sbin:/bin\nPWD=/home/user\nUSER=pete\n</pre>\n\n\nUne variable particulièrement importante est la variable PATH. Vous pouvez accéder à ces variables en ajoutant un $ devant le nom de la variable comme ceci :\n\n<pre>\n$ echo $PATH\n/usr/local/sbin:/usr/local/bin:/usr/sbin:/bin\n</pre>\n\nCela renvoie une liste de chemins séparés par un deux-points que votre système recherche lorsqu'il exécute une commande. Disons que vous téléchargez manuellement et installez un package depuis internet et le placez dans un répertoire non standard et que vous souhaitez exécuter cette commande, vous tapez $ coolcommand et l'invite affiche commande introuvable. Eh bien, c'est étrange, vous regardez le binaire dans un dossier et vous savez qu'il existe. Ce qui se passe, c'est que la variable $PATH ne vérifie pas ce répertoire pour ce binaire, donc elle génère une erreur. \n\nDisons que vous aviez des tonnes de binaires que vous vouliez exécuter à partir de ce répertoire, vous pouvez simplement modifier la variable PATH pour inclure ce répertoire dans votre variable d'environnement PATH.",
  "exercise": "Que donne la sortie suivante ? Pourquoi ?\n<pre>$ echo $HOME</pre>",
  "quizQuestion": "Comment visualisez-vous vos variables d'environnement ?",
  "quizAnswer": "env",
  "slug": "envenvironment"
}