{
  "id": 3,
  "title": "/etc/passwd",
  "lessonContent": "Recuerda que los nombres de usuario no son realmente identificaciones para los usuarios. El sistema utiliza un ID de usuario (UID) para identificar a un usuario. Para averiguar a qué ID están mapeados los usuarios, mira el archivo /etc/passwd. \n\n<pre>$ cat /etc/passwd</pre>\n\nEste archivo te muestra una lista de usuarios e información detallada sobre ellos. Por ejemplo, la primera línea de este archivo probablemente se vea así:\n\n<pre>root:x:0:0:root:/root:/bin/bash</pre>\n\nCada línea muestra información del usuario, comúnmente verás al usuario root como la primera línea. Hay muchos campos separados por dos puntos que te dan información adicional sobre el usuario, veámoslos todos:\n\n<ol>\n<li>Nombre de usuario</li>\n<li>Contraseña del usuario: la contraseña no se almacena realmente en este archivo, generalmente se almacena en el archivo /etc/shadow. Hablaremos más en la próxima lección sobre /etc/shadow, pero por ahora, debes saber que contiene contraseñas de usuario encriptadas. Puedes ver muchos símbolos diferentes en este campo, si ves una \"x\" significa que la contraseña se almacena en el archivo /etc/shadow, un \"*\" significa que el usuario no tiene acceso de inicio de sesión y si hay un campo en blanco significa que el usuario no tiene contraseña.</li>\n<li>ID de usuario - como puedes ver, root tiene el UID de 0</li>\n<li>ID de grupo</li>\n<li>Campo GECOS - se usa generalmente para dejar comentarios sobre el usuario o la cuenta, como su nombre real o número de teléfono, está delimitado por comas.</li>\n<li>Directorio de inicio del usuario</li>\n<li>Shell del usuario - probablemente verás que muchos usuarios tienen bash como su shell por defecto</li>\n</ol>\n\nNormalmente en la página de configuración de un usuario, esperarías ver solo usuarios humanos. Sin embargo, notarás que /etc/passwd contiene otros usuarios. Recuerda que los usuarios realmente solo están en el sistema para ejecutar procesos con diferentes permisos. A veces queremos ejecutar procesos con permisos predefinidos. Por ejemplo, el usuario daemon se utiliza para procesos de demonio.\n\nTambién debes tener en cuenta que puedes editar el archivo /etc/passwd manualmente si deseas agregar usuarios y modificar información con la herramienta <b>vipw</b>, sin embargo, es mejor dejar cosas como estas a las herramientas que discutiremos en una lección posterior, como useradd y userdel.",
  "exercise": "Mira tu archivo /etc/passwd, observa algunos de los usuarios y toma nota de los accesos que tienen.",
  "quizQuestion": "Si un usuario no tiene acceso de inicio de sesión, ¿cómo se denota eso en /etc/passwd?",
  "quizAnswer": "*",
  "slug": "archivoetcpasswd"
}