{
  "id": 1,
  "title": "Usuarios y Grupos",
  "lessonContent": "En cualquier sistema operativo tradicional, existen usuarios y grupos. Estos existen únicamente para el acceso y los permisos. Cuando se ejecuta un proceso, se ejecutará como el propietario de ese proceso, ya sea Jane o Bob. El acceso a archivos y la propiedad también dependen de los permisos. No querrías que Jane vea los documentos de Bob y viceversa. \n\nCada usuario tiene su propio directorio personal donde se almacenan sus archivos específicos de usuario, esto suele estar ubicado en /home/nombredeusuario, pero puede variar en diferentes distribuciones. \n\nEl sistema utiliza identificadores de usuario (UID) para gestionar usuarios, los nombres de usuario son la forma amigable de asociar usuarios con identificación, pero el sistema identifica a los usuarios por su UID. El sistema también utiliza grupos para gestionar permisos, los grupos son simplemente conjuntos de usuarios con permisos establecidos por ese grupo, son identificados por el sistema con su identificador de grupo (GID).\n\nEn Linux, tendrás usuarios además de los humanos normales que utilizan el sistema. A veces, estos usuarios son demonios del sistema que ejecutan procesos continuamente para mantener el sistema funcionando. Uno de los usuarios más importantes es root o superusuario, root es el usuario más poderoso en el sistema, root puede acceder a cualquier archivo y iniciar y finalizar cualquier proceso. Por esa razón, puede ser peligroso operar siempre como root, podrías potencialmente eliminar archivos críticos del sistema. Afortunadamente, si se necesita acceso de root y un usuario tiene acceso de root, pueden ejecutar un comando como root en su lugar con el comando sudo. El comando sudo (superusuario hacer) se utiliza para ejecutar un comando con acceso de root, profundizaremos más en cómo un usuario recibe acceso de root en una lección posterior.\n\nIntenta ver un archivo protegido como /etc/shadow:\n\n<pre>$ cat /etc/shadow</pre>\n\nObserva cómo obtienes un error de permiso denegado, mira los permisos con: \n\n<pre>$ ls -la /etc/shadow\n\n-rw-r----- 1 root shadow 1134 Dec 1 11:45 /etc/shadow\n</pre>\n\nAún no hemos revisado los permisos, pero lo que está sucediendo aquí es que root es el propietario del archivo y necesitarás acceso de root o ser parte del grupo shadow para leer el contenido. Ahora ejecuta el comando con sudo:\n\n<pre>$ sudo cat /etc/shadow</pre>\n\n¡Ahora podrás ver el contenido del archivo!",
  "exercise": "No hay ejercicios para esta lección.",
  "quizQuestion": "¿Qué comando utilizas para ejecutar como root?",
  "quizAnswer": "sudo",
  "slug": "usuariosygrupos"
}