{
  "id": 5,
  "title": "Samba",
  "lessonContent": "Nos primeiros dias da computação, tornou-se necessário que máquinas Windows compartilhassem arquivos com máquinas Linux, assim nasceu o protocolo Server Message Block (SMB). O SMB era usado para compartilhar arquivos entre sistemas operacionais Windows (o Mac também tem compartilhamento de arquivos com SMB) e depois foi posteriormente limpo e otimizado na forma do protocolo Common Internet File System (CIFS).\n\nSamba é o que chamamos de utilitários Linux para trabalhar com CIFS no Linux. Além do compartilhamento de arquivos, você também pode compartilhar recursos como impressoras.\n\n<b>Criar um compartilhamento de rede com o Samba</b>\n\nVamos passar pelos passos básicos para criar um compartilhamento de rede que uma máquina Windows pode acessar:\n\n<b>Instalar o Samba</b>\n\n<pre>$ sudo apt update\n$ sudo apt install samba</pre>\n\n<b>Configurar smb.conf</b>\n\nO arquivo de configuração do Samba é encontrado em /etc/samba/smb.conf, este arquivo deve informar ao sistema quais diretórios devem ser compartilhados, suas permissões de acesso e mais opções. O smb.conf padrão já vem com muito código comentado e você pode usá-los como exemplo para escrever suas próprias configurações.\n\n<pre>$ sudo vi /etc/samba/smb.conf</pre>\n\n<b>Configurar uma senha para o Samba</b>\n\n<pre>$ sudo smbpasswd -a [nome de usuário]</pre>\n\n<b>Criar um diretório compartilhado</b>\n\n<pre>$ mkdir /meu/diretório/para/compartilhar</pre>\n\n<b>Reiniciar o serviço do Samba</b>\n\n<pre>$ sudo service smbd restart</pre>\n\n<b>Acessar um compartilhamento do Samba via Windows</b>\n\nNo Windows, basta digitar a conexão de rede no prompt de execução: \\\\HOST\\nomedocompartilhamento.\n\n<b>Acessar um compartilhamento do Samba/Windows via Linux</b>\n\n<pre>$ smbclient //HOST/diretório -U usuário</pre>\n\nO pacote Samba inclui uma ferramenta de linha de comando chamada <b>smbclient</b> que você pode usar para acessar qualquer servidor Windows ou Samba. Uma vez conectado ao compartilhamento, você pode navegar e transferir arquivos.\n\n<b>Anexar um compartilhamento do Samba ao seu sistema</b>\n\nEm vez de transferir arquivos um por um, você pode simplesmente montar o compartilhamento de rede em seu sistema.\n\n<pre>$ sudo mount -t cifs nomeservidor:diretório pontomontagem -o usuário=nomeusuário,senha=senha</pre>",
  "exercise": "Configure um compartilhamento do Samba, se você não tiver um, abra o smb.conf e familiarize-se com as opções no arquivo de configuração.",
  "quizQuestion": "Qual é o protocolo mais recente usado para transferência de arquivos entre Windows e Linux?",
  "quizAnswer": "CIFS",
  "slug": "samba"
}