{
  "id": 5,
  "title": "Samba",
  "lessonContent": "В ранние дни вычислительной техники стало необходимо, чтобы машины Windows могли обмениваться файлами с машинами Linux, и вот появился протокол Server Message Block (SMB). SMB использовался для обмена файлами между операционными системами Windows (Mac также имеет обмен файлами с помощью SMB), а затем он был очищен и оптимизирован в виде протокола Common Internet File System (CIFS).\n\nSamba - это то, что мы называем утилитами Linux для работы с CIFS на Linux. Помимо обмена файлами, вы также можете делиться ресурсами, такими как принтеры.\n\n<b>Создание сетевого общего ресурса с помощью Samba</b>\n\nДавайте рассмотрим основные шаги для создания сетевого общего ресурса, к которому может получить доступ машина с Windows:\n\n<b>Установка Samba</b>\n\n<pre>$ sudo apt update\n$ sudo apt install samba</pre>\n\n<b>Настройка smb.conf</b>\n\nФайл настройки для Samba находится в /etc/samba/smb.conf, этот файл должен указать системе, какие каталоги должны быть общими, их права доступа и другие параметры. В файле smb.conf по умолчанию уже есть много закомментированного кода, который можно использовать в качестве примера для написания собственных конфигураций.\n\n<pre>$ sudo vi /etc/samba/smb.conf</pre>\n\n<b>Настройка пароля для Samba</b>\n\n<pre>$ sudo smbpasswd -a [имя_пользователя]</pre>\n\n<b>Создание общего каталога</b>\n\n<pre>$ mkdir /мой/каталог/для/обмена</pre>\n\n<b>Перезапуск службы Samba</b>\n\n<pre>$ sudo service smbd restart</pre>\n\n<b>Доступ к общему ресурсу Samba через Windows</b>\n\nВ Windows просто введите сетевое подключение в строке выполнения: \\\\ХОСТ\\имя_общего_ресурса.\n\n<b>Доступ к общему ресурсу Samba/Windows через Linux</b>\n\n<pre>$ smbclient //ХОСТ/каталог -U пользователь</pre>\n\nПакет Samba включает в себя инструмент командной строки под названием <b>smbclient</b>, который можно использовать для доступа к любому серверу Windows или Samba. После подключения к общему ресурсу вы можете перемещаться и передавать файлы.\n\n<b>Подключение общего ресурса Samba к вашей системе</b>\n\nВместо передачи файлов по одному, вы можете просто примонтировать сетевой общий ресурс на своей системе.\n\n<pre>$ sudo mount -t cifs имя_сервера:каталог точка_монтирования -o пользователь=имя_пользователя,пароль=пароль</pre>",
  "exercise": "Настройте общий ресурс Samba, если у вас его нет, откройте smb.conf и ознакомьтесь с параметрами в файле конфигурации.",
  "quizQuestion": "Какой последний протокол используется для передачи файлов между Windows и Linux?",
  "quizAnswer": "CIFS",
  "slug": "samba"
}