{
  "id": 4,
  "title": "Tricheries de sous-réseau",
  "lessonContent": "Je déteste devoir ajouter cette section, dans le monde réel, vous n'auriez probablement jamais à faire des calculs de sous-réseaux à la main, cependant si vous étiez interrogé à ce sujet, vous devriez savoir comment convertir en et à partir de la forme binaire pour le sous-réseau. Heureusement, il existe quelques astuces arithmétiques que vous pouvez mémoriser. \n\nCommencez par mémoriser vos calculs en base 2, faites-le simplement :\n\n<ul>\n<li>2^1 = 2</li>\n<li>2^2 = 4</li>\n<li>2^3 = 8</li>\n<li>2^4 = 16</li>\n<li>2^5 = 32</li>\n<li>2^6 = 64</li>\n<li>2^7 = 128</li>\n<li>2^8 = 256</li>\n<li>2^9 = 512</li>\n<li>2^10 = 1024</li>\n<li>2^11 = 2048</li>\n<li>2^12 = 4096</li>\n</ul>\n\n<b>Tableau de conversion Décimal en Binaire</b>\n\n<pre>\n1   1  1  1  1 1 1 1\n128 64 32 16 8 4 2 1\n</pre>\n\nIl y a de nombreuses raisons pour lesquelles le tableau suivant ressemble à ce qu'il est, si vous vous demandez comment cela fonctionne, il existe de nombreuses ressources en ligne.\n\nD'accord, vous les avez mémorisés ? Faisons une rapide conversion décimale en binaire :\n\n<b>Convertir 192.168.23.43 en Binaire</b>\n\nRappelez-vous : 128 / 64 / 32 / 16 / 8 / 4 / 2 / 1\n\nMarchons à travers la conversion du premier octet en binaire et vous comprendrez comment le reste fonctionne.\n\n<ol>\n<li>Pouvez-vous soustraire 192 - 128 ? Oui, donc le premier bit est 1</li>\n<li>192 - 128 = 64, le prochain nombre dans le tableau est 64, pouvez-vous soustraire 64 - 64 ? Oui, donc le deuxième bit est 1</li>\n<li>Nous avons épuisé les nombres à soustraire, donc notre forme binaire de 192 est 11000000</li>\n</ol>\n\n<b>Convertir Binaire 11000000 en Décimal</b>\n\nPour la conversion binaire en décimal, vous ajoutez les nombres qui ont un 1, donc :\n\n128 + 64 + 0 + 0 + 0 + 0 + 0 + 0 = 192!",
  "exercise": "Regardez votre adresse IP et votre masque de sous-réseau et voyez combien d'hôtes vous pouvez avoir sur votre sous-réseau.",
  "quizQuestion": "Quelle est la conversion binaire de 123?",
  "quizAnswer": "1111011",
  "slug": "tricheriesousreseau"
}