{
  "id": 2,
  "title": "Sous-réseaux",
  "lessonContent": "Comment puis-je savoir si je suis sur le même réseau que Patty ? Eh bien, nous pouvons simplement regarder le sous-réseau, abrégé en sous-réseau. Un sous-réseau est un groupe d'hôtes avec des adresses IP qui se ressemblent d'une certaine manière. Ces hôtes sont généralement situés à proximité les uns des autres et vous pouvez facilement envoyer des données vers et depuis des hôtes sur le même sous-réseau. Pensez-y comme envoyer du courrier dans le même code postal, c'est beaucoup plus facile que d'envoyer du courrier à un autre État. \n\nPar exemple, tous les hôtes avec une adresse IP qui commence par 123.45.67 seraient sur le même sous-réseau. Mon hôte a une IP de 123.45.67.8 et celle de Patty a une IP de 123.45.67.9. Les chiffres communs sont mon préfixe réseau et les 8 et 9 sont nos hôtes, donc mon réseau est le même que celui de Patty. Un sous-réseau est divisé en un préfixe réseau, tel que 123.45.67.0 et un masque de sous-réseau.\n\n<b>Masques de sous-réseau</b>\n\nLes masques de sous-réseau déterminent quelle partie de votre adresse IP est la partie réseau et quelle partie est la partie hôte. \n\nUn masque de sous-réseau typique peut ressembler à ceci :\n\n<pre>255.255.255.0</pre>\n\nLa partie 255 est en fait notre masque. Pour rendre cela un peu plus facile à comprendre, rappelez-vous comment nous appelons chaque octet 8 bits ? En informatique, un bit est noté par un 0 ou un 1 sous forme binaire. Lorsque des nombres binaires sont utilisés, 1 signifie allumé et 0 signifie éteint. Alors que valent 8 0 ou 1 ?\n\nTapez dans Google \"calculatrice binaire en décimal\" et convertissez 11111111 en forme décimale. Qu'obtenez-vous ? 255 ! Ainsi, un octet va de 0 à 255. Donc, si nous avions un masque de sous-réseau de 255.255.255.0, et une adresse IP de 192.168.1.0, combien d'hôtes se trouvent sur ce sous-réseau ? Nous découvrirons la réponse à cela dans notre leçon de mathématiques sur les sous-réseaux.\n\nAussi, lorsque nous parlons de notre sous-réseau, nous le désignons généralement par le préfixe réseau suivi du masque de sous-réseau :\n\n<pre>123.234.0.0/255.255.0.0</pre>\n\n<b>Pourquoi ?</b>\n\nPourquoi diable créons-nous des sous-réseaux ? Le sous-réseau est utilisé pour segmenter les réseaux et contrôler le flux de trafic à l'intérieur de ce réseau. Ainsi, un hôte sur un sous-réseau ne peut pas interagir avec un autre hôte sur un sous-réseau différent. \n\nMais attendez une minute, que se passe-t-il si je veux me connecter à d'autres hôtes comme yahoo.com ? Alors vous devez connecter des sous-réseaux ensemble. Pour connecter des sous-réseaux, vous devez simplement trouver les hôtes qui sont connectés à plus d'un sous-réseau. Par exemple, si mon hôte à 192.168.1.129 est connecté à un réseau local de 192.168.1.129/24, il peut atteindre tous les hôtes de ce réseau. Pour atteindre les hôtes sur le reste d'Internet, il doit communiquer à travers le routeur. Traditionnellement, sur la plupart des réseaux avec un masque de sous-réseau de 255.255.255.0, le routeur est généralement à l'adresse 1 du sous-réseau, donc 192.168.1.1. Ce routeur aura un port qui le connecte à un autre sous-réseau (plus dans le cours de routage). Certaines adresses IP (réseaux privés) ne sont pas visibles sur Internet, et nous avons des choses comme NAT en place (plus à ce sujet plus tard).",
  "exercise": "Utilisez ifconfig pour afficher votre masque de sous-réseau.",
  "quizQuestion": "Vrai ou faux, un sous-réseau se compose d'un masque de sous-réseau et d'un préfixe réseau.",
  "quizAnswer": "Vrai",
  "slug": "sous-reseaux"
}