{
  "id": 1,
  "title": "expressions régulières (Regular Expressions)",
  "lessonContent": "Les expressions régulières sont un outil puissant pour effectuer une sélection basée sur des motifs. Elles utilisent des notations spéciales similaires à celles que nous avons déjà rencontrées, telles que le joker *. \n\nNous passerons en revue quelques-unes des expressions régulières les plus courantes, qui sont presque universelles avec n'importe quel langage de programmation.\n\nNous utiliserons cette phrase comme notre chaîne de test:\n<pre>\nsally sells seashells \nby the seashore\n</pre>\n\n<b>1. Début d'une ligne avec ^</b>\n\n<pre>\n<b>^</b>by\ncorrespondrait à la ligne \"by the seashore\"\n</pre>\n\n<b>2. Fin d'une ligne avec $</b>\n\n<pre>\nseashore<b>$</b>\ncorrespondrait à la ligne \"by the seashore\"\n</pre>\n\n<b>3. Correspondance avec n'importe quel caractère unique avec .</b>\n\n<pre>\nb<b>.</b>\ncorrespondrait à by\n</pre>\n\n<b>4. Notation entre crochets avec [] et ()</b>\n\nCela peut être un peu délicat, les crochets nous permettent de spécifier les caractères trouvés à l'intérieur des crochets. \n\n<pre>\nd<b>[iou]</b>g\ncorrespondrait à: dig, dog, dug\n</pre>\n\nLa balise d'ancrage précédente ^ lorsqu'elle est utilisée dans un crochet signifie tout sauf les caractères à l'intérieur du crochet. \n\n<pre>\nd<b>[^i]</b>g\ncorrespondrait à: dog et dug mais pas dig\n</pre>\n\nLes crochets peuvent également utiliser des plages pour augmenter le nombre de caractères que vous souhaitez utiliser. \n\n<pre>\nd<b>[a-c]</b>g\ncorrespondra à des motifs comme dag, dbg et dcg\n</pre>\n\nAttention cependant, car les crochets sont sensibles à la casse:\n\n<pre>\nd<b>[A-C]</b>g\ncorrespondra à dAg, dBg et dCg mais pas dag, dbg et dcg\n</pre>\n\nEt voilà quelques expressions régulières de base.",
  "exercise": "Essayez de combiner des expressions régulières avec grep et recherchez à travers certains fichiers.\n\n<pre>\ngrep [expression régulière ici] [fichier]",
  "quizQuestion": "Quelle expression régulière utiliseriez-vous pour correspondre à un seul caractère?",
  "quizAnswer": ".",
  "slug": "expressionsregulieresregex"
}