{
  "id": 3,
  "title": "Anatomy of a Disk",
  "lessonContent": "Hard disks can be subdivided into partitions, essentially making multiple block devices. Recall such examples as, /dev/sda1 and /dev/sda2, /dev/sda is the whole disk, but /dev/sda1 is the first partition on that disk. Partitions are extremely useful for separating data and if you need a certain filesystem, you can easily create a partition instead of making the entire disk one filesystem type.\n\n<b>Partition Table</b>\n\nEvery disk will have a partition table, this table tells the system how the disk is partitioned. This table tells you where partitions begin and end, which partitions are bootable, what sectors of the disk are allocated to what partition, etc. There are two main partition table schemes used, Master Boot Record (MBR) and GUID Partition Table (GPT).\n\n<b>Partition</b>\n\nDisks are comprised of partitions that help us organize our data. You can have multiple partitions on a disk and they can't overlap each other. If there is space that is not allocated to a partition, then it is known as free space. The types of partitions depend on your partition table. Inside a partition, you can have a filesystem or dedicate a partition to other things like swap (we'll get to that soon).\n\n<i>MBR</i>\n\n<ul>\n<li>Traditional partition table, was used as the standard</li>\n<li>Can have primary, extended, and logical partitions</li>\n<li>MBR has a limit of four primary partitions</li>\n<li>Additional partitions can be made by making a primary partition into an extended partition (there can only be one extended partition on a disk). Then inside the extended partition you add logical partitions. The logical partitions are used just like any other partition. Silly I know.</li> \n<li>Supports disks up to 2 terabytes</li>\n</ul>\n\n<i>GPT</i>\n\n<ul>\n<li>GUID Partition Table (GPT) is becoming the new standard for disk partitioning</li>\n<li>Has only one type of partition and you can make many of them</li>\n<li>Each partition has a globally unique ID (GUID)</li>\n<li>Used mostly in conjunction with UEFI based booting (we'll get into details in another course)</li> \n</ul>\n\n<b>Filesystem Structure</b>\n\nWe know from our previous lesson that a filesystem is an organized collection of files and directories. In its simplest form, it is comprised of a database to manage files and the actual files themselves, however we're going to go into a little more detail. \n\n<ul>\n<li>Boot block - This is located in the first few sectors of the filesystem, and it's not really used the by the filesystem. Rather, it contains information used to boot the operating system. Only one boot block is needed by the operating system. If you have multiple partitions, they will have boot blocks, but many of them are unused.</li>\n<li>Super block - This is a single block that comes after the boot block, and it contains information about the filesystem, such as the size of the inode table, size of the logical blocks and the size of the filesystem.</li>\n<li>Inode table - Think of this as the database that manages our files (we have a whole lesson on inodes, so don't worry). Each file or directory has a unique entry in the inode table and it has various information about the file.</li>\n<li>Data blocks - This is the actual data for the files and directories.</li>\n</ul>\n \nLet's take a look at the different partition tables. Below is an example of a partition using the MBR partitioning table (msdos). You can see the primary, extended and logical partitions on the machine.\n\n<pre>\npete@icebox:~$ sudo parted -l\nModel: Seagate (scsi)\nDisk /dev/sda: 21.5GB\nSector size (logical/physical): 512B/512B\nPartition Table: msdos\n\nNumber  Start   End     Size    Type      File system     Flags\n 1      1049kB  6860MB  6859MB  primary   ext4            boot\n 2      6861MB  21.5GB  14.6GB  extended\n 5      6861MB  7380MB  519MB   logical   linux-swap(v1)\n 6      7381MB  21.5GB  14.1GB  logical   xfs\n</pre>\n\n\nThis example is GPT, using just a unique ID for the partitions.\n\n<pre>\nModel: Thumb Drive (scsi)\nDisk /dev/sdb: 4041MB\nSector size (logical/physical): 512B/512B\nPartition Table: gpt\n\nNumber  Start   End     Size     File system  Name        Flags\n 1      17.4kB  1000MB  1000MB                first\n 2      1000MB  4040MB  3040MB                second\n</pre>",
  "exercise": "Run <b>parted -l</b> on your machine and evaluate your results.",
  "quizQuestion": "What partition type is used to create more than 4 partitions in the MBR partitioning scheme?",
  "quizAnswer": "extended",
  "slug": "anatomyofadisk"
}
