{
  "id": 4,
  "title": "Disk Partitioning",
  "lessonContent": "Let's do some practical stuff with filesytems by working through the process on a USB drive. If you don't have one, no worries, you can still follow along these next couple of lessons. \n\nFirst we'll need to partition our disk. There are many tools available to do this: \n\n<ul>\n<li>fdisk - basic command-line partitioning tool, it does not support GPT</li>\n<li>parted - this is a command line tool that supports both MBR and GPT partitioning</li>\n<li>gparted - this is the GUI version of parted</li>\n<li>gdisk - fdisk, but it does not support MBR only GPT</li>\n</ul>\n\nLet's use parted to do our partitioning. Let's say I connect the USB device and we see the device name is /dev/sdb2. \n\n<b>Launch parted</b>\n\n<pre>$ sudo parted</pre>\n\nYou'll be entered in the parted tool, here you can run commands to partition your device. \n\n<b>Select the device</b>\n\n<pre>select /dev/sdb2</pre>\n\nTo select the device you'll be working with, select it by its device name.\n\n<b>View current partition table</b>\n\n<pre>\n(parted) print                                                            \nModel: Seagate (scsi)\nDisk /dev/sda: 21.5GB\nSector size (logical/physical): 512B/512B\nPartition Table: msdos\n\nNumber  Start   End     Size    Type      File system     Flags\n 1      1049kB  6860MB  6859MB  primary   ext4            boot\n 2      6861MB  21.5GB  14.6GB  extended\n 5      6861MB  7380MB  519MB   logical   linux-swap(v1)\n 6      7381MB  21.5GB  14.1GB  logical   xfs\n</pre>\n\nHere you will see the available partitions on the device. The <b>start</b> and <b>end</b> points are where the partitions take up space on the hard drive, you'll want to find a good start and end location for your partitions. \n\n<b>Partition the device</b>\n\n<pre>mkpart primary 123 4567</pre>\n\nNow just choose a start and end point and make the partition, you'll need to specify the type of partition depending on what table you used. \n\n<b>Resize a partition</b>\n\nYou can also resize a partition if you don't have any space. \n\n<pre>resize 2 1245 3456</pre>\n\nSelect the partition number and then the start and end points of where you want to resize it to. \n\nParted is a very powerful tool and you should be careful when partitioning your disks.",
  "exercise": "Partition a USB drive with half of the drive as ext4 and the other half as free space.",
  "quizQuestion": "What is the parted command to make a partition?",
  "quizAnswer": "mkpart",
  "slug": "diskpartitioning"
}
