{
  "id": 1,
  "title": "Filesystem Hierarchy",
  "lessonContent": "At this point, you're probably well familiar with the directory structure of your system, if not you will be soon. Filesystems can vary with how they are structured, but for the most part they should conform to the Filesystem Hierarchy Standard. \n\nGo ahead and do an <b>ls -l /</b> to see the directories listed under the root directory, yours may look different than mine, but the directories should for the most part look like the following:\n\n<ul>\n<li>/ - The root directory of the entire filesystem hierarchy, everything is nestled under this directory.</li>\n<li>/bin - Essential ready-to-run programs (binaries), includes the most basic commands such as ls and cp.</li>\n<li>/boot - Contains kernel boot loader files.</li>\n<li>/dev - Device files.</li>\n<li>/etc - Core system configuration directory, should hold only configuration files and not any binaries.</li>\n<li>/home - Personal directories for users, holds your documents, files, settings, etc. </li>\n<li>/lib - Holds library files that binaries can use.</li>\n<li>/media - Used as an attachment point for removable media like USB drives.</li>\n<li>/mnt - Temporarily mounted filesystems.</li>\n<li>/opt - Optional application software packages.</li>\n<li>/proc - Information about currently running processes.</li>\n<li>/root - The root user's home directory.</li>\n<li>/run - Information about the running system since the last boot.</li>\n<li>/sbin - Contains essential system binaries, usually can only be ran by root.</li>\n<li>/srv - Site-specific data which are served by the system.</li>\n<li>/tmp - Storage for temporary files</li>\n<li>/usr - This is unfortunately named, most often it does not contain user files in the sense of a home folder. This is meant for user installed software and utilities, however that is not to say you can't add personal directories in there. Inside this directory are sub-directories for /usr/bin, /usr/local, etc.</li>\n<li>/var - Variable directory, it's used for system logging, user tracking, caches, etc. Basically anything that is subject to change all the time.</li>\n</ul>",
  "exercise": "Look inside your /usr directory, what kind of information is located there?",
  "quizQuestion": "What directory is used to store logs?",
  "quizAnswer": "/var",
  "slug": "filesystemhierarchy"
}
