{
  "id": 2,
  "title": "Modification des autorisations",
  "lessonContent": "Changer les autorisations peut facilement être fait avec la commande <b>chmod</b>. \n\nTout d'abord, choisissez quel ensemble d'autorisations vous souhaitez modifier, utilisateur, groupe ou autre. Vous pouvez ajouter ou supprimer des autorisations avec un <b>+</b> ou un <b>-</b>, regardons quelques exemples.\n\n<b>Ajouter un bit d'autorisation sur un fichier</b>\n<pre>$ chmod u+x myfile</pre>\n\nLa commande ci-dessus se lit comme suit : changer l'autorisation sur myfile en ajoutant un bit d'autorisation d'exécution sur l'ensemble utilisateur. Maintenant, l'utilisateur a l'autorisation d'exécution sur ce fichier !\n\n<b>Supprimer un bit d'autorisation sur un fichier</b>\n<pre>$ chmod u-x myfile</pre>\n\n<b>Ajouter plusieurs bits d'autorisation sur un fichier</b>\n<pre>$ chmod ug+w</pre>\n\nIl existe une autre façon de modifier les autorisations en utilisant un format numérique. Cette méthode vous permet de modifier les autorisations en une seule fois. Au lieu d'utiliser r, w ou x pour représenter les autorisations, vous utiliserez une représentation numérique pour un ensemble d'autorisations unique. Donc, pas besoin de spécifier le groupe avec g ou l'utilisateur avec u.\n\nLes représentations numériques sont les suivantes :\n\n<ul>\n<li>4 : autorisation de lecture</li>\n<li>2 : autorisation d'écriture</li>\n<li>1 : autorisation d'exécution</li>\n</ul>\n\nRegardons un exemple : \n\n<pre>$ chmod 755 myfile</pre>\n\nPouvez-vous deviner quelles autorisations nous donnons à ce fichier ? Décortiquons cela, donc maintenant 755 couvre les autorisations pour tous les ensembles. Le premier chiffre (7) représente les autorisations de l'utilisateur, le deuxième chiffre (5) représente les autorisations du groupe et le dernier 5 représente les autorisations des autres. \n\nAttendez une minute, 7 et 5 ne figuraient pas dans la liste ci-dessus, d'où viennent ces chiffres ? Rappelez-vous que nous combinons maintenant toutes les autorisations en un seul chiffre, donc vous devrez faire intervenir un peu de mathématiques.\n\n7 = 4 + 2 + 1, donc 7 sont les autorisations de l'utilisateur et il a les autorisations de lecture, d'écriture et d'exécution\n\n5 = 4 + 1, le groupe a les autorisations de lecture et d'exécution\n\n5 = 4 + 1, et tous les autres utilisateurs ont les autorisations de lecture et d'exécution\n\nÀ noter : ce n'est pas une bonne idée de modifier les autorisations de manière inconsidérée, vous pourriez potentiellement exposer un fichier sensible à tout le monde pour le modifier, cependant de nombreuses fois vous voulez légitimement modifier les autorisations, prenez simplement des précautions lors de l'utilisation de la commande chmod.",
  "exercise": "Changez les autorisations de quelques fichiers texte de base et observez les bits changer lorsque vous faites un ls -l.",
  "quizQuestion": "Quel nombre représente l'autorisation de lecture lors de l'utilisation du format numérique ?",
  "quizAnswer": "4",
  "slug": "modificationdesautorisations"
}