{
  "id": 5,
  "title": "Setuid",
  "lessonContent": "Il existe de nombreux cas où les utilisateurs normaux ont besoin d'un accès élevé pour effectuer des tâches. L'administrateur système ne peut pas toujours être là pour entrer un mot de passe root à chaque fois qu'un utilisateur a besoin d'accéder à un fichier protégé, c'est pourquoi il existe des bits de permission spéciaux pour permettre ce comportement. L'identifiant utilisateur défini (SUID) permet à un utilisateur d'exécuter un programme en tant que propriétaire du fichier du programme plutôt qu'en tant qu'eux-mêmes.\n\nPrenons un exemple : \n\nDisons que je veux changer mon mot de passe, simple non ? J'utilise simplement la commande passwd :\n\n<pre>$ passwd</pre>\n\nQue fait la commande passwd ? Elle modifie quelques fichiers, mais surtout elle modifie le fichier /etc/shadow. Regardons ce fichier un instant : \n\n<pre>$ ls -l /etc/shadow\n\n-rw-r----- 1 root shadow 1134 Dec 1 11:45 /etc/shadow\n</pre>\n\nAttendez une minute, ce fichier est possédé par root ? Comment est-il possible que nous puissions modifier un fichier possédé par root ? \n\nRegardons un autre ensemble de permissions, cette fois de la commande que nous avons exécutée : \n\n<pre>$ ls -l /usr/bin/passwd\n\n-rwsr-xr-x 1 root root 47032 Dec 1 11:45 /usr/bin/passwd\n</pre>\n\nVous remarquerez un nouveau bit de permission ici <b>s</b>. Ce bit de permission est le SUID, lorsqu'un fichier a ce bit de permission défini, il permet aux utilisateurs qui ont lancé le programme d'obtenir les permissions du propriétaire du fichier ainsi que les permissions d'exécution, dans ce cas root. Fondamentalement, pendant que l'utilisateur exécute la commande passwd, il s'exécute en tant que root.\n\nC'est pourquoi nous pouvons accéder à un fichier protégé comme /etc/shadow lorsque nous exécutons la commande passwd. Maintenant, si vous supprimez ce bit, vous verrez que vous ne pourrez pas modifier /etc/shadow et donc changer votre mot de passe. \n\n<b>Modification du SUID</b>\n\nTout comme les permissions régulières, il existe deux façons de modifier les permissions SUID. \n\n<i>Méthode symbolique :</i>\n<pre>$ sudo chmod u+s myfile</pre>\n\n<i>Méthode numérique :</i>\n<pre> sudo chmod 4755 myfile</pre>\n\nComme vous pouvez le voir, le SUID est indiqué par un 4 et préfixé à l'ensemble de permissions. Vous pouvez voir le SUID indiqué par un <b>S</b> majuscule, cela signifie qu'il fait toujours la même chose, mais n'a pas les permissions d'exécution.",
  "exercise": "Examinez en détail les permissions pour /etc/passwd, remarquez-vous quelque chose d'autre ? Les fichiers avec le SUID activé sont également facilement reconnaissables.",
  "quizQuestion": "Quel numéro représente le SUID ?",
  "quizAnswer": "4",
  "slug": "setuidsetuserid"
}