{
  "id": 6,
  "title": "Модули ядра",
  "lessonContent": "Предположим, у меня есть классный автомобиль, в который я вложил много времени и денег. Я устанавливаю спойлер, фаркоп, велосипедный багажник и другие случайные вещи. Эти компоненты фактически не изменяют основной функциональности автомобиля, и я могу легко удалять и добавлять их. Ядро использует тот же концепт с ядровыми модулями.\n\nЯдро по сути является монолитным программным обеспечением, когда мы хотим добавить поддержку для нового типа клавиатуры, мы не пишем этот код непосредственно в код ядра. Точно так же, как мы бы не приварили велосипедный багажник к нашему автомобилю (ну, возможно, некоторые люди бы это сделали). Ядровые модули - это куски кода, которые могут быть загружены и выгружены в ядро по требованию. Они позволяют нам расширять функциональность ядра, не добавляя код в основной код ядра. Мы также можем добавлять модули и не перезагружать систему (в большинстве случаев).\n\n<b>Просмотр списка загруженных в данный момент модулей</b>\n\n<pre>$ lsmod</pre>\n\n<b>Загрузка модуля</b>\n\n<pre>$ sudo modprobe bluetooth</pre>\n\nModprobe пытается загрузить модуль из <b>/lib/modules/(версия ядра)/kernel/drivers</b>. У ядровых модулей также могут быть зависимости, modprobe загружает зависимости нашего модуля, если они еще не загружены.\n\n<b>Выгрузка модуля</b>\n\n<pre>$ sudo modprobe -r bluetooth</pre>\n\n<b>Загрузка при загрузке системы</b>\n\nВы также можете загружать модули при загрузке системы, вместо временной загрузки их с помощью modprobe (которые будут выгружены при перезагрузке). Просто измените каталог <b>/etc/modprobe.d</b> и добавьте в него файл конфигурации, например так:\n\n<pre>pete@icebox:~$ /etc/modprobe.d/peanutbutter.conf\n\noptions peanut_butter type=almond\n</pre>\n\nНемного экстравагантный пример, но если у вас есть модуль с именем peanut_butter и вы хотите добавить параметр ядра для type=almond, вы можете загрузить его при запуске, используя этот файл конфигурации. Также обратите внимание, что у ядровых модулей есть свои собственные параметры ядра, поэтому вам следует прочитать о модуле более подробно, чтобы узнать больше.\n\n<b>Не загружать при загрузке системы</b>\n\nВы также можете убедиться, что модуль не загружается при загрузке системы, добавив файл конфигурации, например так:\n\n<pre>pete@icebox:~$ /etc/modprobe.d/peanutbutter.conf\n\nblacklist peanut_butter\n</pre>",
  "exercise": "Выгрузите свой модуль bluetooth с помощью modprobe и посмотрите, что произойдет. Как вы это исправите?",
  "quizQuestion": "Какая команда используется для выгрузки модуля?",
  "quizAnswer": "modprobe -r",
  "slug": "kernelmodules"
}