{
  "id": 2,
  "title": "Уровни привилегий",
  "lessonContent": "Следующие несколько уроков довольно теоретические, поэтому, если вы ищете что-то практическое, можете пропустить и вернуться позже.\n\nПочему у нас есть различные уровни абстракции для пользовательского пространства и ядра? Почему нельзя объединить обе функции в один уровень? Есть очень веская причина, почему эти два уровня существуют отдельно. Они работают в разных режимах: ядро работает в режиме ядра, а пользовательское пространство - в режиме пользователя.\n\nВ режиме ядра ядро имеет полный доступ к аппаратному обеспечению, контролирует все. В режиме пользовательского пространства есть очень небольшое количество безопасной памяти и ЦП, к которым у вас есть доступ. По сути, когда нам нужно что-то сделать, что включает в себя аппаратное обеспечение, чтение данных с наших дисков, запись данных на наши диски, управление нашей сетью и т. д., все это делается в режиме ядра. Зачем это нужно? Представьте, что ваш компьютер заражен шпионским ПО, вы бы не хотели, чтобы у него был прямой доступ к аппаратуре вашей системы. Он может получить доступ ко всем вашим данным, вашей веб-камере и т. д., и это нехорошо.\n\nЭти различные режимы называются уровнями привилегий (названы соответственно уровням привилегий, которые вы получаете) и часто описываются как кольца защиты. Чтобы лучше представить себе эту картину, давайте скажем, что вы узнали, что Бритни Спирс находится в вашем городе в местном клубе, она защищена своими поклонниками, затем ее личными охранниками, затем швейцаром за пределами клуба. Вы хотите получить ее автограф (почему бы и нет?), но не можете к ней подойти, потому что она находится под крепкой защитой. Кольца работают так же, самое внутреннее кольцо соответствует наивысшему уровню привилегий. Существуют два основных уровня или режима в архитектуре компьютера x86. Кольцо №3 - это привилегия, в которой работают приложения в режиме пользователя, кольцо №0 - это привилегия, в которой работает ядро. Кольцо №0 может выполнять любую системную инструкцию и имеет полное доверие. Теперь, когда мы знаем, как работают эти уровни привилегий, как мы можем записать что-либо в наше аппаратное обеспечение? Разве мы всегда будем находиться в другом режиме, чем ядро?\n\nОтвет - с помощью системных вызовов, они позволяют нам выполнять привилегированную инструкцию в режиме ядра, а затем переключаться обратно в режим пользователя.",
  "exercise": "Урок не содержит упражнений.",
  "quizQuestion": "Какое кольцо имеет наивысшие привилегии?",
  "quizAnswer": "0",
  "slug": "kernelprivilegelevels"
}