{
  "id": 2,
  "title": "Steuerungsterminal",
  "lessonContent": "Wir haben besprochen, wie es ein TTY-Feld im ps-Ausgabebereich gibt. Das TTY ist das Terminal, das den Befehl ausgeführt hat.\n\nEs gibt zwei Arten von Terminals, normale <b>Terminalgeräte</b> und <b>Pseudoterminalgeräte</b>. Ein normales Terminalgerät ist ein natives Terminalgerät, in das Sie eingeben und Ausgaben an Ihr System senden können. Das klingt wie die Terminalanwendung, die Sie gestartet haben, um zu Ihrer Shell zu gelangen, ist es aber nicht. \n\nWir werden jetzt übergehen, damit Sie diese Aktion sehen können. Tippen Sie auf Strg-Alt-F1, um zu TTY1 (die erste virtuelle Konsole) zu gelangen. Sie werden feststellen, dass Sie außer dem Terminal nichts haben, keine Grafiken usw. Dies wird als normales Terminalgerät betrachtet. Sie können dies mit Strg-Alt-F7 verlassen. \n\nEin Pseudoterminal ist das, woran Sie gewöhnt sind zu arbeiten. Sie emulieren Terminals mit dem Shell-Terminalfenster und werden durch PTS gekennzeichnet. Wenn Sie erneut ps betrachten, sehen Sie Ihren Shell-Prozess unter pts/*. \n\nOk, jetzt zurück zum Steuerungsterminal. Prozesse sind normalerweise an ein Steuerungsterminal gebunden. Wenn Sie beispielsweise ein Programm auf Ihrem Shell-Fenster wie find ausführen und das Fenster schließen, würde auch Ihr Prozess damit beendet. \n\nEs gibt Prozesse wie Dämonenprozesse, die spezielle Prozesse sind, die im Wesentlichen das System am Laufen halten. Sie starten oft beim Systemstart und werden normalerweise beim Herunterfahren des Systems beendet. Sie laufen im Hintergrund und da wir nicht möchten, dass diese speziellen Prozesse beendet werden, sind sie nicht an ein Steuerungsterminal gebunden. Im ps-Ausgabebereich wird das TTY als <b>?</b> aufgeführt, was bedeutet, dass es kein Steuerungsterminal hat.",
  "exercise": "Schauen Sie sich Ihre ps-Ausgabe an und listen Sie alle eindeutigen TTY-Werte auf.",
  "quizQuestion": "Welcher Wert wird für einen Prozess angegeben, der kein Steuerungsterminal hat?",
  "quizAnswer": "?",
  "slug": "steuerungsterminal"
}