{
  "id": 11,
  "title": "Job Control",
  "lessonContent": "Angenommen, Sie arbeiten in einem einzelnen Terminalfenster und führen einen Befehl aus, der eine Ewigkeit dauert. Sie können nicht mit der Shell interagieren, bis der Befehl abgeschlossen ist. Wir möchten jedoch weiterhin an unseren Maschinen arbeiten, daher müssen wir diese Shell offen halten. Glücklicherweise können wir steuern, wie unsere Prozesse mit Jobs ausgeführt werden: \n\n<b>Senden eines Jobs in den Hintergrund</b>\n\nDurch Anhängen eines kaufmännischen Und-Zeichens (&) an den Befehl wird er im Hintergrund ausgeführt, sodass Sie Ihre Shell weiterhin verwenden können. Schauen wir uns ein Beispiel an:\n\n<pre>$ sleep 1000 &\n$ sleep 1001 &\n$ sleep 1002 &\n</pre>\n\n<b>Alle Hintergrundjobs anzeigen</b>\n\nNun können Sie die Jobs anzeigen, die Sie gerade in den Hintergrund geschickt haben.\n\n<pre>$ jobs\n\n[1]    Running     sleep 1000 &\n[2]-   Running     sleep 1001 &\n[3]+   Running     sleep 1002 &\n\n</pre>\n\nHier wird Ihnen die Job-ID in der ersten Spalte angezeigt, dann der Status und der ausgeführte Befehl. Das <b>+</b> neben der Job-ID bedeutet, dass es sich um den zuletzt gestarteten Hintergrundjob handelt. Der Job mit dem <b>-</b> ist der zweitjüngste Befehl.\n\n<b>Senden eines Jobs in den Hintergrund bei einem vorhandenen Job</b>\n\nWenn Sie bereits einen Job ausgeführt haben und ihn in den Hintergrund verschieben möchten, müssen Sie ihn nicht beenden und von vorne beginnen. Unterbrechen Sie zuerst den Job mit Strg-Z und führen Sie dann den Befehl <b>bg</b> aus, um ihn in den Hintergrund zu senden.\n\n<pre>\npete@icebox ~ $ sleep 1003\n^Z\n[4]+    Stopped     sleep 1003\n\npete@icebox ~ $ bg\n[4]+    sleep 1003 &\n\npete@icebox ~ $ jobs\n\n[1]    Running     sleep 1000 &\n[2]    Running     sleep 1001 &\n[3]-   Running     sleep 1002 &\n[4]+   Running     sleep 1003 &\n</pre>\n\n<b>Verschieben eines Jobs vom Hintergrund in den Vordergrund</b>\n\nUm einen Job aus dem Hintergrund zu holen, geben Sie einfach die gewünschte Job-ID an. Wenn Sie fg ohne Optionen ausführen, wird der zuletzt ausgeführte Hintergrundjob zurückgeholt (der Job mit dem + Zeichen daneben)\n\n<pre>$ fg %1</pre>\n\n<b>Beenden von Hintergrundjobs</b>\n\nÄhnlich wie beim Verschieben von Jobs aus dem Hintergrund können Sie die Prozesse mit ihrer Job-ID beenden.\n\n<pre>kill %1</pre>",
  "exercise": "Verschieben Sie einige Jobs zwischen Hintergrund und Vordergrund",
  "quizQuestion": "Welcher Befehl wird verwendet, um Hintergrundjobs aufzulisten?",
  "quizAnswer": "jobs",
  "slug": "jobcontrol"
}