{
  "id": 1,
  "title": "ps (Prozesse)",
  "lessonContent": "Prozesse sind die Programme, die auf Ihrem Rechner ausgeführt werden. Sie werden vom Kernel verwaltet und jedem Prozess ist eine damit verbundene ID zugeordnet, die als <b>Prozess-ID (PID)</b> bezeichnet wird. Diese PID wird in der Reihenfolge vergeben, in der Prozesse erstellt werden. \n\nFühren Sie den Befehl ps aus, um eine Liste der laufenden Prozesse anzuzeigen:\n\n<pre>$ ps\n\nPID        TTY     STAT   TIME          CMD\n41230    pts/4    Ss        00:00:00     bash\n51224    pts/4    R+        00:00:00     ps\n</pre>\n\nDies zeigt Ihnen eine schnelle Übersicht über die aktuellen Prozesse:\n\n<ul>\n<li>PID: Prozess-ID</li>\n<li>TTY: Steuerterminal, das mit dem Prozess verbunden ist (dazu kommen wir später im Detail)</li>\n<li>STAT: Prozessstatuscode</li>\n<li>TIME: Gesamte CPU-Nutzungszeit</li>\n<li>CMD: Name des ausführbaren Befehls</li>\n</ul>\n\nWenn Sie die Manpage für ps betrachten, werden Sie feststellen, dass es viele Befehlsoptionen gibt, die Sie übergeben können. Diese variieren je nach den gewünschten Optionen - BSD, GNU oder Unix. Meiner Meinung nach ist der BSD-Stil beliebter, also werden wir diesen verwenden. Falls Sie neugierig sind, der Unterschied zwischen den Stilen liegt in der Anzahl der Bindestriche und den Flags.\n\n<pre>$ ps aux</pre>\n\nDas <b>a</b> zeigt alle laufenden Prozesse an, einschließlich derjenigen, die von anderen Benutzern ausgeführt werden. Das <b>u</b> zeigt mehr Details zu den Prozessen an. Und schließlich listet das <b>x</b> alle Prozesse auf, die kein TTY damit verbunden haben. Diese Programme zeigen in dem TTY-Feld ein ?, sie sind am häufigsten in Daemon-Prozessen zu finden, die als Teil des Systemstarts gestartet werden.\n\nSie werden feststellen, dass Sie jetzt viele weitere Felder sehen, Sie müssen sie nicht alle auswendig lernen. In einem späteren Kurs über fortgeschrittene Prozesse werden wir einige davon erneut durchgehen:\n\n<ul>\n<li>USER: Der effektive Benutzer (dessen Zugriff wir verwenden)</li>\n<li>PID: Prozess-ID</li>\n<li>%CPU: Von der Prozesslaufzeit verwendete CPU-Zeit geteilt durch die Laufzeit des Prozesses</li>\n<li>%MEM: Verhältnis der Größe des residenten Sets des Prozesses zum physischen Speicher auf dem Rechner</li>\n<li>VSZ: Virtuelle Speichernutzung des gesamten Prozesses</li>\n<li>RSS: Resident Set Size, der nicht ausgelagerte physische Speicher, den eine Aufgabe verwendet hat</li>\n<li>TTY: Steuerterminal, das mit dem Prozess verbunden ist</li>\n<li>STAT: Prozessstatuscode</li>\n<li>START: Startzeit des Prozesses</li>\n<li>TIME: Gesamte CPU-Nutzungszeit</li>\n<li>COMMAND: Name des ausführbaren Befehls</li>\n</ul>\n\nDer ps-Befehl kann etwas unübersichtlich sein, aber vorerst werden wir uns hauptsächlich die Felder PID, STAT und COMMAND ansehen. \n\nEin weiterer sehr nützlicher Befehl ist der <b>top</b>-Befehl. top liefert Echtzeitinformationen über die auf Ihrem System laufenden Prozesse anstelle eines Schnappschusses. Standardmäßig erhalten Sie alle 10 Sekunden eine Aktualisierung. Top ist ein äußerst nützliches Tool, um zu sehen, welche Prozesse viele Ihrer Ressourcen verbrauchen. \n\n<pre>$ top</pre>",
  "exercise": "Verwenden Sie den ps-Befehl mit verschiedenen Flags und sehen Sie, wie sich die Ausgabe ändert.",
  "quizQuestion": "Welche ps-Flagge wird verwendet, um detaillierte Informationen über Prozesse anzuzeigen?",
  "quizAnswer": "u",
  "slug": "monitorprocessespscommand"
}