{
  "id": 8,
  "title": "Nettigkeit",
  "lessonContent": "Wenn Sie mehrere Dinge auf Ihrem Computer ausführen, wie vielleicht Chrome, Microsoft Word oder Photoshop gleichzeitig, mag es so aussehen, als ob diese Prozesse gleichzeitig laufen, aber das ist nicht ganz richtig. \n\nProzesse verwenden die CPU für einen kurzen Zeitraum, der als Zeitscheibe bezeichnet wird. Dann pausieren sie für Millisekunden und ein anderer Prozess erhält eine kleine Zeitscheibe. Standardmäßig erfolgt die Prozessplanung in dieser Round-Robin-Manier. Jeder Prozess erhält genügend Zeitscheiben, bis er mit der Verarbeitung fertig ist. Der Kernel übernimmt all diese Prozesswechsel und macht die meiste Zeit einen ziemlich guten Job daraus.\n\nProzesse können nicht entscheiden, wann und wie lange sie CPU-Zeit erhalten. Wenn alle Prozesse normal funktionieren würden, würden sie (ungefähr) jeweils die gleiche Menge an CPU-Zeit erhalten. Es gibt jedoch eine Möglichkeit, den Prozessplanungsalgorithmus des Kernels mit einem Nettigkeitswert zu beeinflussen. Nettigkeit ist ein ziemlich seltsamer Name, aber was es bedeutet, ist, dass Prozesse eine Zahl haben, um ihre Priorität für die CPU zu bestimmen. Eine hohe Zahl bedeutet, dass der Prozess nett ist und eine niedrigere Priorität für die CPU hat, und eine niedrige oder negative Zahl bedeutet, dass der Prozess nicht sehr nett ist und so viel CPU wie möglich erhalten möchte. \n\n<pre>$ top</pre>\n\nSie können derzeit eine Spalte für NI sehen, das ist der Nettigkeitsgrad eines Prozesses.\n\nUm den Nettigkeitsgrad zu ändern, können Sie die Befehle nice und renice verwenden:\n\n<pre>$ nice -n 5 apt upgrade</pre>\n\nDer nice-Befehl wird verwendet, um die Priorität für einen neuen Prozess festzulegen. Der renice-Befehl wird verwendet, um die Priorität für einen vorhandenen Prozess festzulegen. \n\n<pre>$ renice 10 -p 3245</pre>",
  "exercise": "Welche Prozesse sind nicht sehr nett und warum?",
  "quizQuestion": "Wenn ich möchte, dass ein Prozess eine höhere CPU-Priorität erhält, verwende ich eine niedrigere oder höhere Nettigkeitszahl?",
  "quizAnswer": "niedrig",
  "slug": "prozessnettigkeit"
}