{
  "id": 6,
  "title": "Signale",
  "lessonContent": "Ein Signal ist eine Benachrichtigung an einen Prozess, dass etwas passiert ist.\n\n<b>Warum wir Signale haben</b>\n\nSie sind Software-Unterbrechungen und haben viele Verwendungszwecke:\n\n<ul>\n<li>Ein Benutzer kann eine der speziellen Terminalzeichen (Strg-C) oder (Strg-Z) eingeben, um Prozesse zu beenden, zu unterbrechen oder zu suspendieren</li>\n<li>Hardwareprobleme können auftreten und der Kernel möchte den Prozess benachrichtigen</li>\n<li>Softwareprobleme können auftreten und der Kernel möchte den Prozess benachrichtigen</li>\n<li>Es sind im Grunde Wege, wie Prozesse kommunizieren können</li>\n</ul>\n\n<b>Signalprozess</b>\n\nWenn ein Signal durch ein Ereignis erzeugt wird, wird es dann an einen Prozess übermittelt und befindet sich in einem ausstehenden Zustand, bis es übermittelt wird. Wenn der Prozess ausgeführt wird, wird das Signal übermittelt. Prozesse haben jedoch Signalmasken und können die Signalübermittlung blockieren, wenn dies angegeben ist. Wenn ein Signal übermittelt wird, kann ein Prozess eine Vielzahl von Dingen tun: \n\n<ul>\n<li>Das Signal ignorieren</li>\n<li>Das Signal \"abfangen\" und eine spezifische Handler-Routine ausführen</li>\n<li>Der Prozess kann beendet werden, im Gegensatz zum normalen Beenden des Systemaufrufs</li>\n<li>Das Signal blockieren, abhängig von der Signalmaske</li>\n</ul>\n\n<b>Gängige Signale</b>\n\nJedes Signal ist durch Ganzzahlen mit symbolischen Namen definiert, die in Form von SIGxxx vorliegen. Einige der häufigsten Signale sind: \n\n<ul>\n<li>SIGHUP oder HUP oder 1: Aufhängen</li>\n<li>SIGINT oder INT oder 2: Unterbrechung</li>\n<li>SIGKILL oder KILL oder 9: Beenden</li>\n<li>SIGSEGV oder SEGV oder 11: Speicherzugriffsfehler</li>\n<li>SIGTERM oder TERM oder 15: Softwarebeendigung</li>\n<li>SIGSTOP oder STOP: Stoppen</li>\n</ul>\n\nDie Zahlen können bei Signalen variieren, daher werden sie normalerweise anhand ihrer Namen bezeichnet.\n\nEinige Signale sind nicht blockierbar, ein Beispiel ist das SIGKILL-Signal. Das KILL-Signal zerstört den Prozess.",
  "exercise": "Keine Übungen für diese Lektion.",
  "quizQuestion": "Welches Signal ist nicht blockierbar?",
  "quizAnswer": "SIGKILL",
  "slug": "prozesssignale"
}