{
  "id": 5,
  "title": "Prozessbeendigung",
  "lessonContent": "Jetzt, da wir wissen, was passiert, wenn ein Prozess erstellt wird, was passiert, wenn wir ihn nicht mehr benötigen? Sei gewarnt, manchmal kann es in Linux ein wenig düster werden...\n\nEin Prozess kann mit dem _exit-Systemaufruf beendet werden, dadurch werden die Ressourcen freigegeben, die der Prozess verwendet hat, um sie erneut zuzuweisen. Wenn ein Prozess bereit ist zu terminieren, teilt er dem Kernel mit, warum er terminiert, mit etwas, das als Beendigungsstatus bezeichnet wird. Am häufigsten bedeutet ein Status von 0, dass der Prozess erfolgreich war. Das reicht jedoch nicht aus, um einen Prozess vollständig zu beenden. Der Elternprozess muss das Beenden des Kindprozesses anerkennen, indem er den wait-Systemaufruf verwendet, der den Beendigungsstatus des Kindprozesses überprüft. Ich weiß, es ist grausam, darüber nachzudenken, aber der wait-Aufruf ist eine Notwendigkeit, schließlich möchte jeder Elternteil wissen, wie sein Kind gestorben ist.\n\nEs gibt einen anderen Weg, um einen Prozess zu beenden, und das beinhaltet die Verwendung von Signalen, worüber wir bald sprechen werden.\n\n<b>Waisenprozesse</b>\n\nWenn ein Elternprozess stirbt, bevor ein Kindprozess stirbt, weiß der Kernel, dass er keinen wait-Aufruf erhalten wird. Stattdessen macht er diese Prozesse zu \"Waisen\" und stellt sie unter die Obhut von init (erinnere dich an die Mutter aller Prozesse). Init wird schließlich den wait-Systemaufruf für diese Waisen ausführen, damit sie sterben können.\n\n<b>Zombie-Prozesse</b>\n\nWas passiert, wenn ein Kind terminiert und der Elternprozess noch nicht wait aufgerufen hat? Wir möchten immer noch sehen können, wie ein Kindprozess terminiert wurde, also auch wenn der Kindprozess beendet ist, macht der Kernel den Kindprozess zu einem Zombie-Prozess. Die Ressourcen, die der Kindprozess verwendet hat, sind immer noch für andere Prozesse freigegeben, jedoch gibt es immer noch einen Eintrag im Prozesstabelle für diesen Zombie. Zombie-Prozesse können auch nicht getötet werden, da sie technisch gesehen \"tot\" sind, also können Sie keine Signale verwenden, um sie zu töten. Wenn der Elternprozess schließlich den wait-Systemaufruf aufruft, wird der Zombie verschwinden, dies wird als \"Ernten\" bezeichnet. Wenn der Elternprozess keinen wait-Aufruf durchführt, wird init den Zombie adoptieren und automatisch wait ausführen und den Zombie entfernen. Es kann schlecht sein, zu viele Zombie-Prozesse zu haben, da sie Platz in der Prozesstabelle beanspruchen. Wenn sie voll ist, wird dies verhindern, dass andere Prozesse ausgeführt werden.",
  "exercise": "Keine Übungen für diese Lektion.",
  "quizQuestion": "Was ist der häufigste Beendigungsstatus für einen erfolgreichen Prozess?",
  "quizAnswer": "0",
  "slug": "prozessbeendigung"
}