{
  "id": 5,
  "title": "Обзор Systemd",
  "lessonContent": "Systemd медленно становится стандартом для инициализации. Если у вас есть каталог /usr/lib/systemd, скорее всего вы используете systemd.\n\nSystemd использует цели для запуска вашей системы. В основном у вас есть цель, которую вы хотите достичь, и у этой цели также есть зависимости, которые нам нужно достичь. Systemd чрезвычайно гибок и надежен, он не следует строгой последовательности для запуска процессов. Вот что происходит во время типичной загрузки systemd:\n\n<ol>\n<li>Сначала systemd загружает свои файлы конфигурации, обычно расположенные в /etc/systemd/system или /usr/lib/systemd/system</li>\n<li>Затем он определяет свою цель загрузки, которая обычно является default.target</li>\n<li>Systemd определяет зависимости цели загрузки и активирует их</l>\n</ol>\n\nАналогично уровням запуска Sys V, systemd загружается в различные цели:\n\n<ul>\n<li>poweroff.target - выключение системы</li>\n<li>rescue.target - однопользовательский режим</li>\n<li>multi-user.target - многопользовательский режим с сетью</li>\n<li>graphical.target - многопользовательский режим с сетью и графическим интерфейсом</li>\n<li>reboot.target - перезагрузка</li>\n</ul>\n\nЦель загрузки по умолчанию default.target обычно указывает на graphical.target. \n\nОсновными объектами, с которыми работает systemd, являются известные как юниты. Systemd не просто останавливает и запускает службы, он может монтировать файловые системы, отслеживать сетевые сокеты и т. д., и из-за этой надежности у него есть различные типы юнитов, с которыми он работает. Самые распространенные юниты:\n\n<ul>\n<li>Service units - это службы, которые мы запускаем и останавливаем, файлы этих юнитов заканчиваются на .service</li>\n<li>Mount units - Эти монтируют файловые системы, файлы этих юнитов заканчиваются на .mount</li>\n<li>Target units - Эти группируют другие юниты, файлы заканчиваются на .target</li>\n</ul>\n\nНапример, предположим, что мы загружаемся в наш default.target, так вот, эта цель группирует вместе юниты networking.service, crond.service и т. д., поэтому после активации одного юнита активируется все, что находится ниже этого юнита.",
  "exercise": "Урок не содержит упражнений.",
  "quizQuestion": "Какой юнит используется для группировки других юнитов?",
  "quizAnswer": "target",
  "slug": "systemdoverview"
}