{
  "id": 1,
  "title": "Обзор System V",
  "lessonContent": "Основная цель init - запускать и останавливать основные процессы в системе. В Linux существуют три основные реализации init: System V, Upstart и systemd. В этом уроке мы рассмотрим наиболее традиционную версию init - System V init или Sys V (произносится как 'Система Пять'). \n\nЧтобы узнать, используете ли вы реализацию Sys V init, проверьте наличие файла /etc/inittab - если он есть, то скорее всего вы используете Sys V. \n\nSys V запускает и останавливает процессы последовательно, так что, например, если вы хотите запустить службу с именем foo-a, то перед тем, как сможет работать foo-b, вы должны убедиться, что foo-a уже запущен. Sys V делает это с помощью скриптов, которые запускают и останавливают службы для нас. Мы можем написать собственные скрипты или, в большинстве случаев, использовать те, которые уже встроены в операционную систему и используются для загрузки основных служб. \n\nПреимуществом использования этой реализации init является относительная легкость разрешения зависимостей, поскольку вы знаете, что foo-a идет перед foo-b, однако производительность не так хороша, потому что обычно одно действие запускается или останавливается за раз. \n\nПри использовании Sys V состояние машины определяется уровнями запуска, которые устанавливаются от 0 до 6. Эти различные режимы будут различаться в зависимости от дистрибутива, но большинство времени будут выглядеть примерно следующим образом: \n\n<ul>\n<li>0: Выключение</li>\n<li>1: Режим одного пользователя</li>\n<li>2: Многопользовательский режим без сети</li>\n<li>3: Многопользовательский режим с сетью</li>\n<li>4: Не используется</li>\n<li>5: Многопользовательский режим с сетью и графическим интерфейсом</li>\n<li>6: Перезагрузка</li>\n</ul>\n\nПри запуске системы она проверяет, в каком уровне запуска вы находитесь, и выполняет скрипты, находящиеся в этой конфигурации уровня запуска. Скрипты находятся в <b>/etc/rc.d/rc[номер уровня запуска].d/</b> или <b>/etc/init.d</b>. Скрипты, начинающиеся с S (start) или K (kill), будут запускаться при загрузке и остановке соответственно. Числа рядом с этими символами указывают на последовательность их выполнения. \n\nНапример:\n\n<pre>\npete@icebox:/etc/rc.d/rc0.d$ ls\nK10updates  K80openvpn        \n</pre>\n\nМы видим, что при переключении в уровень запуска 0 или режим выключения наша машина попытается выполнить скрипт для остановки служб обновлений, а затем openvpn. Чтобы узнать, в какой уровень запуска загружается ваша машина, вы можете увидеть уровень запуска по умолчанию в файле /etc/inittab. Вы также можете изменить уровень запуска по умолчанию в этом файле. \n\nСледует отметить, что System V медленно устаревает, возможно, не сегодня и даже не через несколько лет. Однако вы можете увидеть уровни запуска в других реализациях init, это в первую очередь для поддержки тех служб, которые запускаются или останавливаются только с помощью скриптов System V init.",
  "exercise": "Если вы используете System V, измените уровень запуска вашей машины на другой и посмотрите, что произойдет.",
  "quizQuestion": "Какой уровень запуска обычно используется для выключения?",
  "quizAnswer": "0",
  "slug": "sysvoverview"
}