{
  "id": 3,
  "title": "Обзор Upstart",
  "lessonContent": "Upstart был разработан Canonical, поэтому он был реализацией init в Ubuntu некоторое время, однако в современных установках Ubuntu теперь используется systemd. Upstart был создан для улучшения проблем с Sys V, таких как строгие процессы запуска, блокировка задач и т. д. Модель событий и задач Upstart позволяет ему реагировать на события по мере их возникновения. \n\nЧтобы узнать, используете ли вы Upstart, если у вас есть каталог /usr/share/upstart, это довольно неплохой показатель. \n\nЗадачи - это действия, которые выполняет Upstart, а события - это сообщения, полученные от других процессов для запуска задач. Чтобы увидеть список задач и их конфигурацию:\n\n<pre>\npete@icebox:~$ ls /etc/init\nacpid.conf                   mountnfs.sh.conf\nalsa-restore.conf            mtab.sh.conf\nalsa-state.conf              networking.conf\nalsa-store.conf              network-interface.conf\nanacron.conf                 network-interface-container.conf\n</pre>\n\nВ этих конфигурациях задач будет указана информация о том, как запускать задачи и когда их запускать.\n\nНапример, в файле networking.conf может быть написано что-то простое, например:\n<pre>\nstart on runlevel [235]\nstop on runlevel [0]\n</pre>\n\nЭто означает, что сеть будет настраиваться при запуске на уровне выполнения 2, 3 или 5 и сеть будет остановлена при запуске на уровне выполнения 0. Существует множество способов написания файла конфигурации, и вы обнаружите это, когда посмотрите на различные доступные конфигурации задач. \n\nПринцип работы Upstart заключается в следующем: \n\n<ol>\n<li>Сначала он загружает конфигурации задач из /etc/init</li>\n<li>Как только происходит событие запуска, он запускает задачи, вызванные этим событием.</li>\n<li>Эти задачи создадут новые события, и затем эти события вызовут еще задачи</li>\n<li>Upstart продолжает делать это, пока не завершит все необходимые задачи</li>\n</ol>",
  "exercise": "Если вы используете Upstart, попробуйте понять конфигурации задач в /etc/init.",
  "quizQuestion": "Какая реализация init используется в Ubuntu?",
  "quizAnswer": "upstart",
  "slug": "upstartoverview"
}