{
  "id": 4,
  "title": "netstat",
  "lessonContent": "<b>Bekannte Ports</b>\n\nWir haben die Datenübertragung durch Ports auf unserem Rechner besprochen, schauen wir uns einige bekannte Ports an.\n\nSie können eine Liste der bekannten Ports erhalten, indem Sie die Datei <b>/etc/services</b> betrachten: \n\n<pre>\nftp             21/tcp\nssh             22/tcp\nsmtp            25/tcp \ndomain          53/tcp  # DNS\nhttp            80/tcp\nhttps           443/tcp\n..etc..\n</pre>\n\nDie erste Spalte ist der Name des Dienstes, dann die Portnummer und das Transportprotokoll, das verwendet wird.\n\n<b>netstat</b>\n\nEin äußerst nützliches Tool, um detaillierte Informationen über Ihr Netzwerk zu erhalten, ist <b>netstat</b>. Netstat zeigt verschiedene netzwerkbezogene Informationen wie Netzwerkverbindungen, Routing-Tabellen, Informationen über Netzwerkschnittstellen und mehr an. Es ist das Schweizer Taschenmesser der Netzwerktools. Wir werden uns hauptsächlich auf eine Funktion konzentrieren, die netstat hat, und das ist der Status der Netzwerkverbindungen. Bevor wir uns ein Beispiel ansehen, sprechen wir zuerst über Sockets und Ports. Ein Socket ist eine Schnittstelle, die es Programmen ermöglicht, Daten zu senden und zu empfangen, während ein Port verwendet wird, um zu identifizieren, welche Anwendung Daten senden oder empfangen soll. Die Socket-Adresse ist die Kombination aus IP-Adresse und Port. Jede Verbindung zwischen einem Host und einem Ziel erfordert einen eindeutigen Socket. Zum Beispiel ist HTTP ein Dienst, der auf Port 80 läuft. Wir können jedoch viele HTTP-Verbindungen haben, und um jede Verbindung aufrechtzuerhalten, wird pro Verbindung ein Socket erstellt.\n\n<pre>\npete@icebox:~$ netstat -at\nAktive Internetverbindungen (Server und etabliert)\nProto Recv-Q Send-Q Lokale Adresse           Fremde Adresse         Status      \ntcp        0      0 icebox:domain           *:*                     LISTEN     \ntcp        0      0 localhost:ipp           *:*                     LISTEN     \ntcp        0      0 icebox.lan:44468        124.28.28.50:http       TIME_WAIT  \ntcp        0      0 icebox.lan:34751        124.28.29.50:http       TIME_WAIT  \ntcp        0      0 icebox.lan:34604        economy.canonical.:http TIME_WAIT  \ntcp6       0      0 ip6-localhost:ipp       [::]:*                  LISTEN     \ntcp6       1      0 ip6-localhost:35094     ip6-localhost:ipp       CLOSE_WAIT \ntcp6       0      0 ip6-localhost:ipp       ip6-localhost:35094     FIN_WAIT2\n</pre>\n\nDer Befehl netstat -a zeigt die hörenden und nicht hörenden Sockets für Netzwerkverbindungen an, das -t-Flag zeigt nur TCP-Verbindungen an. \n\nDie Spalten sind von links nach rechts wie folgt:\n\n<ul>\n<li>Proto: Verwendetes Protokoll, TCP oder UDP.</li>\n<li>Recv-Q: Daten, die darauf warten, empfangen zu werden</li>\n<li>Send-Q: Daten, die darauf warten, gesendet zu werden</li>\n<li>Lokale Adresse: Lokal verbundener Host</li>\n<li>Fremde Adresse: Remote-verbundener Host</li>\n<li>Status: Der Status des Sockets</li>\n</ul>\n\nSehen Sie sich die Manpage für eine Liste der Socket-Status an, aber hier sind einige:\n\n<ul>\n<li>LISTENING: Der Socket wartet auf eingehende Verbindungen. Denken Sie daran, wenn wir eine TCP-Verbindung herstellen, muss unser Ziel auf uns warten, bevor wir uns verbinden können.</li>\n<li>SYN_SENT: Der Socket versucht aktiv, eine Verbindung herzustellen.</li>\n<li>ETABLIERT: Der Socket hat eine hergestellte Verbindung</li>\n<li>CLOSE_WAIT: Der Remote-Host wurde heruntergefahren, und wir warten darauf, dass der Socket geschlossen wird</li>\n<li>TIME_WAIT: Der Socket wartet nach dem Schließen darauf, noch im Netzwerk befindliche Pakete zu verarbeiten</li>\n </ul>",
  "exercise": "Schauen Sie sich die Manpage für netstat an und lernen Sie alle Funktionen kennen, die es zu bieten hat.",
  "quizQuestion": "Welcher Port wird für HTTPS verwendet?",
  "quizAnswer": "443",
  "slug": "netstat"
}