{
  "id": 5,
  "title": "Paketanalyse",
  "lessonContent": "Das Thema der Paketanalyse könnte einen eigenen Kurs füllen, und es gibt viele Bücher, die sich ausschließlich mit der Paketanalyse befassen. Heute werden wir jedoch nur die Grundlagen lernen. Es gibt zwei äußerst beliebte Paketanalysatoren, Wireshark und tcpdump. Diese Tools scannen Ihre Netzwerkschnittstellen, erfassen die Paketaktivität, analysieren die Pakete und geben die Informationen für uns aus. Sie ermöglichen es uns, tief in die Netzwerkanalyse einzutauchen und uns mit den Details auf niedriger Ebene zu beschäftigen. Wir werden tcpdump verwenden, da es eine einfachere Benutzeroberfläche hat. Wenn Sie jedoch die Paketanalyse in Ihr Repertoire aufnehmen möchten, empfehle ich Ihnen, sich Wireshark anzusehen.\n\n<b>Installieren von tcpdump</b>\n\n<pre>\n$ sudo apt install tcpdump\n</pre>\n\n<b>Erfassen von Paketdaten auf einer Schnittstelle</b>\n\n<pre>\npete@icebox:~$ sudo tcpdump -i wlan0\ntcpdump: verbose output suppressed, use -v or -vv for full protocol decode\nlistening on wlan0, link-type EN10MB (Ethernet), capture size 65535 bytes\n11:28:23.958840 IP icebox.lan > nuq04s29-in-f4.1e100.net: ICMP echo request, id 1901, seq 2, length 64\n11:28:23.970928 IP nuq04s29-in-f4.1e100.net > icebox.lan: ICMP echo reply, id 1901, seq 2, length 64\n11:28:24.960464 IP icebox.lan > nuq04s29-in-f4.1e100.net: ICMP echo request, id 1901, seq 3, length 64\n11:28:24.979299 IP nuq04s29-in-f4.1e100.net > icebox.lan: ICMP echo reply, id 1901, seq 3, length 64\n11:28:25.961869 IP icebox.lan > nuq04s29-in-f4.1e100.net: ICMP echo request, id 1901, seq 4, length 64\n11:28:25.976176 IP nuq04s29-in-f4.1e100.net > icebox.lan: ICMP echo reply, id 1901, seq 4, length 64\n11:28:26.963667 IP icebox.lan > nuq04s29-in-f4.1e100.net: ICMP echo request, id 1901, seq 5, length 64\n11:28:26.976137 IP nuq04s29-in-f4.1e100.net > icebox.lan: ICMP echo reply, id 1901, seq 5, length 64\n11:28:30.674953 ARP, Request who-has 172.254.1.0 tell ThePickleParty.lan, length 28\n11:28:31.190665 IP ThePickleParty.lan.51056 > 192.168.86.255.rfe: UDP, length 306\n</pre>\n\nBeim Ausführen einer Paketaufzeichnung werden Sie feststellen, dass viele Dinge passieren. Das ist zu erwarten, da im Hintergrund viel Netzwerkaktivität stattfindet. In meinem obigen Beispiel habe ich nur einen Ausschnitt meiner Aufzeichnung genommen, speziell die Zeit, als ich beschloss, www.google.com anzupingen.\n\n<b>Verständnis der Ausgabe</b>\n\n<pre>\n11:28:23.958840 IP icebox.lan > nuq04s29-in-f4.1e100.net: ICMP echo request, id 1901, seq 2, length 64\n11:28:23.970928 IP nuq04s29-in-f4.1e100.net > icebox.lan: ICMP echo reply, id 1901, seq 2, length 64\n</pre>\n\n<ul>\n<li>Das erste Feld ist ein Zeitstempel der Netzwerkaktivität</li>\n<li>IP, enthält die Protokollinformationen</li>\n<li>Anschließend sehen Sie die Quell- und Zieladresse: icebox.lan > nuq04s29-in-f4.1e100.net</li>\n<li>seq, dies ist die Start- und Endsequenznummer des TCP-Pakets</li>\n<li>Länge, Länge in Bytes</li>\n</ul>\n\nWie Sie aus unserer tcpdump-Ausgabe sehen können, senden wir ein ICMP Echo Request-Paket an www.google.com und erhalten als Antwort ein ICMP Echo Reply-Paket! Beachten Sie auch, dass verschiedene Pakete unterschiedliche Informationen ausgeben werden. Sehen Sie im Handbuch nach, um zu erfahren, was diese sind.\n\n<b>Speichern der tcpdump-Ausgabe in einer Datei</b>\n\n<pre>\n$ sudo tcpdump -w /some/file\n</pre>\n\n\nEinige abschließende Gedanken: Wir haben nur die Oberfläche des Themas der Paketanalyse angekratzt. Es gibt so viel, was Sie betrachten können, und wir haben noch nicht einmal die Möglichkeit erwähnt, noch tiefer in die Hex- und ASCII-Ausgabe einzutauchen. Es gibt viele Ressourcen online, die Ihnen helfen können, mehr über Paketanalysatoren zu erfahren, und ich fordere Sie auf, diese zu finden!",
  "exercise": "Laden Sie das Wireshark-Tool herunter und installieren Sie es, und probieren Sie die Benutzeroberfläche aus.",
  "quizQuestion": "Was ist die Flagge, um mit tcpdump eine bestimmte Schnittstelle zu erfassen?",
  "quizAnswer": "-i",
  "slug": "paketanalyse"
}