{
  "id": 2,
  "title": "ping",
  "lessonContent": "Eines der einfachsten Netzwerktools <b>ping</b>, das verwendet wird, um zu testen, ob ein Paket einen Host erreichen kann. Es funktioniert, indem ICMP-Echo-Anforderungen (Typ 8) an den Zielhost gesendet und auf eine ICMP-Echo-Antwort (Typ 0) gewartet wird. Ping ist erfolgreich, wenn ein Host das Anforderungspaket sendet und eine Antwort vom Ziel erhält. Schauen wir uns ein Beispiel an: \n\n<pre>\npete@icebox:~$ ping -c 3 www.google.com\nPING www.google.com (74.125.239.112) 56(84) Bytes Daten.\n64 Bytes von nuq05s01-in-f16.1e100.net (74.125.239.112): icmp_seq=1 ttl=128 time=29.0 ms\n64 Bytes von nuq05s01-in-f16.1e100.net (74.125.239.112): icmp_seq=2 ttl=128 time=23.7 ms\n64 Bytes von nuq05s01-in-f16.1e100.net (74.125.239.112): icmp_seq=3 ttl=128 time=15.1 ms\n</pre>\n\nIn diesem Beispiel verwenden wir ping, um zu überprüfen, ob wir zu www.google.com gelangen können. Die -c-Flagge (count) wird verwendet, um das Senden von Echo-Anforderungspaketen zu stoppen, nachdem die Anzahl erreicht wurde. \n\nDer erste Teil besagt, dass wir 64-Byte-Pakete an 74.125.239.112 (google.com) senden, und der Rest zeigt uns die Details der Reise. Standardmäßig wird ein Paket pro Sekunde gesendet.\n\n<b>icmp_seq</b>\n\nDas Feld icmp_seq wird verwendet, um die Sequenznummer der gesendeten Pakete anzuzeigen. In diesem Fall habe ich 3 Pakete gesendet und wir können sehen, dass 3 Pakete zurückgekommen sind. Wenn Sie ein Ping durchführen und einige Sequenznummern fehlen, bedeutet dies, dass ein Konnektivitätsproblem vorliegt und nicht alle Ihre Pakete durchkommen. Wenn die Sequenznummer durcheinander ist, ist Ihre Verbindung wahrscheinlich sehr langsam, da Ihre Pakete die Standardzeit von einer Sekunde überschreiten. \n\n<b>ttl</b>\n\nDas Feld Time To Live (ttl) wird als Hop-Zähler verwendet. Bei jedem Hop wird der Zähler um eins verringert, und sobald der Hop-Zähler 0 erreicht, stirbt unser Paket. Dies soll dem Paket eine Lebensdauer geben, wir wollen nicht, dass unsere Pakete ewig herumreisen.\n\n<b>time</b>\n\nDie Roundtrip-Zeit, die von Ihnen benötigt wird, um das Echo-Anforderungspaket zu senden und eine Echo-Antwort zu erhalten.",
  "exercise": "Führen Sie ein Ping auf einer Website durch und betrachten Sie die Ausgabe, die Sie erhalten.",
  "quizQuestion": "Was ist die Maßeinheit für die Roundtrip-Zeit?",
  "quizAnswer": "ms",
  "slug": "ping"
}