{
  "id": 11,
  "title": "Управление заданиями",
  "lessonContent": "Предположим, вы работаете в одном терминальном окне и выполняете команду, которая занимает очень много времени. Вы не можете взаимодействовать с оболочкой, пока она не завершится, однако мы хотим продолжать работать на наших машинах, поэтому нам нужно, чтобы эта оболочка оставалась открытой. К счастью, мы можем контролировать, как выполняются наши процессы с помощью заданий: \n\n<b>Отправка задания в фоновый режим</b>\n\nДобавление амперсанда (&) к команде запустит ее в фоновом режиме, чтобы вы могли продолжать использовать вашу оболочку. Давайте посмотрим на пример:\n\n<pre>$ sleep 1000 &\n$ sleep 1001 &\n$ sleep 1002 &\n</pre>\n\n<b>Просмотр всех фоновых заданий</b>\n\nТеперь вы можете просмотреть задания, которые вы только что отправили в фоновый режим.\n\n<pre>$ jobs\n\n[1]    Running     sleep 1000 &\n[2]-   Running     sleep 1001 &\n[3]+   Running     sleep 1002 &\n\n</pre>\n\nЗдесь вы увидите идентификатор задания в первом столбце, затем статус и команду, которая была выполнена. Знак <b>+</b> рядом с идентификатором задания означает, что это самое недавнее фоновое задание, которое было запущено. Задание с знаком <b>-</b> - вторая по времени выполнения команда.\n\n<b>Отправка задания в фоновый режим для существующего задания</b>\n\nЕсли вы уже запустили задание и хотите отправить его в фоновый режим, вам не нужно его завершать и начинать заново. Сначала приостановите задание с помощью Ctrl-Z, затем выполните команду <b>bg</b>, чтобы отправить его в фоновый режим.\n\n<pre>\npete@icebox ~ $ sleep 1003\n^Z\n[4]+    Stopped     sleep 1003\n\npete@icebox ~ $ bg\n[4]+    sleep 1003 &\n\npete@icebox ~ $ jobs\n\n[1]    Running     sleep 1000 &\n[2]    Running     sleep 1001 &\n[3]-   Running     sleep 1002 &\n[4]+   Running     sleep 1003 &\n</pre>\n\n<b>Перемещение задания из фонового режима в передний план</b>\n\nЧтобы вернуть задание из фонового режима, просто укажите идентификатор задания, которое вы хотите. Если вы запустите fg без каких-либо параметров, он вернет самое недавнее фоновое задание (задание с знаком + рядом с ним)\n\n<pre>$ fg %1</pre>\n\n<b>Удаление фоновых заданий</b>\n\nПодобно перемещению заданий из фонового режима, вы можете использовать ту же форму для завершения процессов, используя их идентификатор задания.\n\n<pre>kill %1</pre>",
  "exercise": "Перемещение некоторых заданий между фоновым и передним планом",
  "quizQuestion": "Какая команда используется для просмотра фоновых заданий?",
  "quizAnswer": "jobs",
  "slug": "jobcontrol"
}