{
  "id": 1,
  "title": "ps (Процессы)",
  "lessonContent": "Процессы - это программы, которые работают на вашем компьютере. Они управляются ядром, и у каждого процесса есть связанный с ним идентификатор, называемый <b>идентификатор процесса (PID).</b> Этот PID присваивается в порядке создания процессов. \n\nПродолжайте и выполните команду ps, чтобы увидеть список работающих процессов:\n\n<pre>$ ps\n\nPID        TTY     STAT   TIME          CMD\n41230    pts/4    Ss        00:00:00     bash\n51224    pts/4    R+        00:00:00     ps\n</pre>\n\nЭто показывает вам краткую информацию о текущих процессах:\n\n<ul>\n<li>PID: Идентификатор процесса</li>\n<li>TTY: Управляющий терминал, связанный с процессом (мы рассмотрим это подробнее позже)</li>\n<li>STAT: Код статуса процесса</li>\n<li>TIME: Общее время использования ЦП</li>\n<li>CMD: Имя исполняемой команды</li>\n</ul>\n\nЕсли вы посмотрите на страницу руководства по ps, вы увидите, что существует множество опций команд, которые можно передать, они будут различаться в зависимости от того, какие опции вы хотите использовать - BSD, GNU или Unix. На мой взгляд, стиль BSD более популярен, поэтому мы выберем его. Если вас интересует разница между стилями, то она заключается в количестве тире и флагах.\n\n<pre>$ ps aux</pre>\n\n<b>a</b> отображает все работающие процессы, включая те, которые запущены другими пользователями. <b>u</b> показывает более подробную информацию о процессах. И, наконец, <b>x</b> перечисляет все процессы, которым не назначен TTY, эти программы будут показывать ? в поле TTY, они наиболее распространены в демонических процессах, которые запускаются во время загрузки системы.\n\nВы заметите, что теперь вы видите гораздо больше полей, не нужно запоминать их все, в следующем курсе по продвинутым процессам мы еще раз рассмотрим некоторые из них:\n\n<ul>\n<li>USER: Эффективный пользователь (тот, чьи права доступа мы используем)</li>\n<li>PID: Идентификатор процесса</li>\n<li>%CPU: Время использования ЦП, деленное на время работы процесса</li>\n<li>%MEM: Соотношение размера набора резидентной памяти процесса к физической памяти на компьютере</li>\n<li>VSZ: Использование виртуальной памяти всего процесса</li>\n<li>RSS: Размер набора резидентной памяти, не подкачанной в файл подкачки, который использовало задание</li>\n<li>TTY: Управляющий терминал, связанный с процессом</li>\n<li>STAT: Код статуса процесса</li>\n<li>START: Время запуска процесса</li>\n<li>TIME: Общее время использования ЦП</li>\n<li>COMMAND: Имя исполняемой команды</li>\n</ul>\n\nКоманда ps может выглядеть немного запутанно, на данный момент поля, на которые мы будем смотреть чаще всего, - это PID, STAT и COMMAND. \n\nЕще одна очень полезная команда - <b>top</b>, top предоставляет вам информацию в реальном времени о работающих процессах на вашей системе вместо снимка. По умолчанию обновление происходит каждые 10 секунд. Top - это чрезвычайно полезный инструмент для просмотра процессов, потребляющих много ресурсов. \n\n<pre>$ top</pre>",
  "exercise": "Используйте команду ps с различными флагами и посмотрите, как меняется вывод.",
  "quizQuestion": "Какой флаг ps используется для просмотра подробной информации о процессах?",
  "quizAnswer": "u",
  "slug": "monitorprocessespscommand"
}