{
  "id": 6,
  "title": "Сигналы",
  "lessonContent": "Сигнал - это уведомление процессу о том, что что-то произошло.\n\n<b>Зачем нам нужны сигналы</b>\n\nОни являются программными прерываниями и имеют много применений:\n\n<ul>\n<li>Пользователь может нажать один из специальных символов терминала (Ctrl-C) или (Ctrl-Z), чтобы завершить, прервать или приостановить процессы</li>\n<li>Могут возникнуть проблемы с аппаратным обеспечением, и ядро хочет уведомить процесс</li>\n<li>Могут возникнуть проблемы с программным обеспечением, и ядро хочет уведомить процесс</li>\n<li>Это в основном способы взаимодействия процессов</li>\n</ul>\n\n<b>Процесс сигнала</b>\n\nКогда сигнал генерируется каким-либо событием, он затем доставляется процессу, считается ожидающим до момента доставки. Когда процесс запущен, сигнал будет доставлен. Однако у процессов есть маски сигналов, и они могут установить блокировку доставки сигнала, если указано. Когда сигнал доставлен, процесс может сделать множество вещей: \n\n<ul>\n<li>Игнорировать сигнал</li>\n<li>\"Поймать\" сигнал и выполнить определенную обработчик рутины</li>\n<li>Процесс может быть завершен, в отличие от обычного вызова системы выхода</li>\n<li>Блокировать сигнал в зависимости от маски сигнала</li>\n</ul>\n\n<b>Общие сигналы</b>\n\nКаждый сигнал определяется целыми числами с символическими именами в форме SIGxxx. Некоторые из наиболее распространенных сигналов: \n\n<ul>\n<li>SIGHUP или HUP или 1: Обрыв связи</li>\n<li>SIGINT или INT или 2: Прерывание</li>\n<li>SIGKILL или KILL или 9: Уничтожение</li>\n<li>SIGSEGV или SEGV или 11: Ошибка сегментации</li>\n<li>SIGTERM или TERM или 15: Программное завершение</li>\n<li>SIGSTOP или STOP: Остановка</li>\n</ul>\n\nЧисла могут варьироваться с сигналами, поэтому обычно на них ссылается по их именам.\n\nНекоторые сигналы нельзя заблокировать, один из примеров - сигнал SIGKILL. Сигнал KILL уничтожает процесс.",
  "exercise": "Урок не содержит упражнений.",
  "quizQuestion": "Какой сигнал нельзя заблокировать?",
  "quizAnswer": "SIGKILL",
  "slug": "processsignals"
}