{
  "id": 1,
  "title": "Interfaces de Rede",
  "lessonContent": "Uma interface de rede é como o kernel conecta o lado do software de rede ao lado do hardware. Já vimos um exemplo disso: \n\n<pre>\npete@icebox:~$ ifconfig -a\neth0      Link encap:Ethernet  HWaddr 1d:3a:32:24:4d:ce  \n          inet addr:192.168.1.129  Bcast:192.168.1.255  Mask:255.255.255.0\n          inet6 addr: fd60::21c:29ff:fe63:5cdc/64 Scope:Link\n</pre>\n\n<b> O comando ifconfig</b>\n\nA ferramenta <b>ifconfig</b> nos permite configurar nossas interfaces de rede, se não tivermos nenhuma interface de rede configurada, os drivers de dispositivo do kernel e a rede não saberão como se comunicar entre si. O ifconfig é executado na inicialização e configura nossas interfaces por meio de arquivos de configuração, mas também podemos modificá-los manualmente. A saída do ifconfig mostra o nome da interface no lado esquerdo e do lado direito mostra informações detalhadas. Você verá mais comumente interfaces nomeadas como eth0 (primeiro cartão Ethernet na máquina), wlan0 (interface sem fio), lo (interface de loopback). A interface de loopback é usada para representar seu computador, ela apenas o faz voltar para si mesmo. Isso é bom para depuração ou conexão com servidores em execução localmente. \n\nO status das interfaces pode ser up ou down, como você pode imaginar, se quiser \"desativar\" uma interface, pode defini-la como down. Os campos que você provavelmente olhará mais na saída do ifconfig são o HWaddr (endereço MAC da interface), endereço inet (endereço IPv4) e inet6 (endereço IPv6). Claro que você também pode ver que a máscara de sub-rede e o endereço de broadcast estão lá. Você também pode visualizar informações da interface em /etc/network/interfaces.\n\n<b>Para criar uma interface e ativá-la</b>\n\n<pre>$ ifconfig eth0 192.168.2.1 netmask 255.255.255.0 up</pre>\n\nIsso atribui um endereço IP e máscara de rede à interface eth0 e também a ativa.\n\n<b>Para ativar ou desativar uma interface</b>\n\n<pre>\n$ ifup eth0\n$ ifdown eth0\n</pre>\n\n<b> O comando ip </b>\n\nO comando <b>ip</b> também nos permite manipular a pilha de rede de um sistema. Dependendo da distribuição que você está usando, pode ser o método preferido para manipular suas configurações de rede. \n\nAqui estão alguns exemplos de uso:\n\n<b>Para mostrar informações da interface para todas as interfaces </b>\n<pre>\n$ ip link show\n</pre>\n\n<b>Para mostrar as estatísticas de uma interface</b>\n<pre>\n$ ip -s link show eth0\n</pre>\n\n\n<b>Para mostrar os endereços IP alocados para interfaces</b>\n<pre>\n$ ip address show\n</pre>\n\n<b>Para ativar e desativar interfaces</b>\n<pre>\n$ ip link set eth0 up\n$ ip link set eth0 down\n</pre>\n\n<b>Para adicionar um endereço IP a uma interface</b>\n<pre>\n$ ip address add 192.168.1.1/24 dev eth0\n</pre>",
  "exercise": "Tente alterar o estado de suas interfaces de rede para cima ou para baixo e observe o que acontece.\n\nVocê consegue alterar suas interfaces de rede com os comandos ifconfig e ip ?",
  "quizQuestion": "Qual é o comando para configurar nossas interfaces de rede?",
  "quizAnswer": "ifconfig",
  "slug": "interfacesderede"
}