{
  "id": 4,
  "title": "netstat",
  "lessonContent": "<b>Well Known Ports</b>\n\nWe've discussed data transmission through ports on our machine, let's look at some well known ports.\n\nYou can get a list of well-known ports by looking at the file <b>/etc/services</b>: \n\n<pre>\nftp             21/tcp\nssh             22/tcp\nsmtp            25/tcp \ndomain          53/tcp  # DNS\nhttp            80/tcp\nhttps           443/tcp\n..etc..\n</pre>\n\nThe first column is the name of the service, then the port number and the transport layer protocol it uses.\n\n<b>netstat</b>\n\nAn extremely useful tool to get detailed information about your network is <b>netstat</b>. Netstat displays various network related information such network connections, routing tables, information about network interfaces and more, it's the swiss army knife of networking tools. We will focus mostly on one feature netstat has and that's the status of network connections. Before we look at an example, let's talk about sockets and ports first. A socket is an interface that allows programs to send and receive data while a port is used to identify which application should send or receive data. The socket address is the combination of the IP address and port. Every connection between a host and destination requires a unique socket. For example, HTTP is a service that runs on port 80, however we can have many HTTP connections and to maintain each connection a socket gets created per connection.\n\n<pre>\npete@icebox:~$ netstat -at\nActive Internet connections (servers and established)\nProto Recv-Q Send-Q Local Address           Foreign Address         State      \ntcp        0      0 icebox:domain           *:*                     LISTEN     \ntcp        0      0 localhost:ipp           *:*                     LISTEN     \ntcp        0      0 icebox.lan:44468        124.28.28.50:http       TIME_WAIT  \ntcp        0      0 icebox.lan:34751        124.28.29.50:http       TIME_WAIT  \ntcp        0      0 icebox.lan:34604        economy.canonical.:http TIME_WAIT  \ntcp6       0      0 ip6-localhost:ipp       [::]:*                  LISTEN     \ntcp6       1      0 ip6-localhost:35094     ip6-localhost:ipp       CLOSE_WAIT \ntcp6       0      0 ip6-localhost:ipp       ip6-localhost:35094     FIN_WAIT2\n</pre>\n\nThe netstat -a command shows the listening and non-listening sockets for network connections, the -t flag shows only tcp connections. \n\nThe columns are as follows from left to right:\n\n<ul>\n<li>Proto: Protocol used, TCP or UDP.</li>\n<li>Recv-Q: Data that is queued to be received</li>\n<li>Send-Q: Data that is queued to be sent</li>\n<li>Local Address: Locally connected host</li>\n<li>Foreign Address: Remotely connected host</li>\n<li>State: The state of the socket</li>\n</ul>\n\nSee the manpage for a list of socket states, but here are a few:\n\n<ul>\n<li>LISTENING: The socket is listening for incoming connections, remember when we make a TCP connection our destination has to be listening for us before we can connect.</li>\n<li>SYN_SENT: The socket is actively attempting to establish a connection.</li>\n<li>ESTABLISHED: The socket has an established connection</li>\n<li>CLOSE_WAIT: The remote host has shutdown and we're waiting for the socket to close</li>\n<li>TIME_WAIT: The socket is waiting after close to handle packets still in the network</li>\n </ul>",
  "exercise": "Look at the manpage for netstat and learn all the features it has to offer.",
  "quizQuestion": "What port is used for HTTPS?",
  "quizAnswer": "443",
  "slug": "netstat"
}
