{
  "id": 3,
  "title": "Processo DNS",
  "lessonContent": "Vamos ver um exemplo de como seu host encontra um domínio (catzontheinterwebz.com) com DNS. Basicamente, seguimos nosso caminho até chegarmos ao servidor DNS que conhece esse domínio.\n\n<b>Servidor DNS Local</b>\n\nPrimeiro, nosso host pergunta: \"Onde está catzontheinterwebz.com?\", nosso servidor DNS local não sabe, então ele começa do topo do funil para perguntar aos Servidores Raiz. Tenha em mente que nosso host não está fazendo essas solicitações para encontrar catzontheinterwebz.com diretamente, a maioria dos usuários fala com um servidor DNS recursivo fornecido por seus provedores de serviços de Internet e esse servidor é encarregado de encontrar a localização de catzontheinterwebz.com.\n\n<b>Servidores Raiz</b>\n\nExistem 13 Servidores Raiz para a Internet, eles são espelhados e distribuídos ao redor do mundo para lidar com solicitações DNS para a Internet, então realmente existem centenas de servidores que estão trabalhando, eles são controlados por diferentes organizações e contêm informações sobre Domínios de Nível Superior. Domínios de nível superior são o que você conhece como endereços .org, .com, .net, etc. Então, o Servidor Raiz não sabe onde está catzontheinterwebz.com, então ele nos diz para perguntar ao Servidor DNS de Domínio de Nível Superior .com em um endereço IP que ele nos fornece. \n\n<b>Domínio de Nível Superior</b>\n\nAgora enviamos outra solicitação ao servidor de nomes que conhece os endereços \".com\" e perguntamos se ele sabe onde está catzontheinterwebz.com? O TLD não tem o catzontheinterwebz.com em seus arquivos de zona, mas ele vê um registro para o servidor de nomes de catzontheinterwebz.com. Então ele nos dá o endereço IP desse servidor de nomes e nos diz para procurar lá.\n\n<b>Servidor DNS Autoritativo</b>\n\nAgora enviamos uma solicitação final ao servidor DNS que realmente tem o registro que queremos. O servidor de nomes vê que tem um arquivo de zona para catzontheinterwebz.com e há um registro de recurso para 'www' para este host. Então ele nos dá o endereço IP deste host e finalmente podemos ver alguns gatos na Internet.",
  "exercise": "Sem exercícios para esta lição.",
  "quizQuestion": "Qual é a abreviação para os servidores de nomes onde são encontrados os endereços .com, .net, .org, etc?",
  "quizAnswer": "TLD",
  "slug": "dnsprocess"
}