{
  "id": 4,
  "title": "/etc/hosts",
  "lessonContent": "<p>Antes de nossa máquina realmente acessar o DNS para fazer uma consulta, ela primeiro verifica localmente em nossas máquinas.</p><br><p><b>/etc/hosts</b></p><p>O arquivo /etc/hosts contém mapeamentos de alguns nomes de host para endereços IP. Os campos são bastante autoexplicativos, há um para o endereço IP, o nome do host e então quaisquer alias para o host.</p><pre>pete@icebox:~$ cat /etc/hosts<br>127.0.0.1 localhost<br>127.0.1.1 icebox</pre><p>Geralmente você verá seu endereço localhost listado como padrão neste arquivo. Você também pode gerenciar o acesso aos hosts modificando os arquivos /etc/hosts.deny ou /etc/hosts.allow. No entanto, se você for consciente da segurança, esta não é realmente a maneira correta de fazer e você deve estar modificando suas regras de firewall em vez disso.</p><p>Vamos ver um exemplo divertido de /etc/hosts. Modifique o arquivo e adicione uma linha para:</p><pre>123.45.6.7  www.google.com</pre><p>Salve o arquivo e agora acesse www.google.com. Está tendo problemas, não está? Bem, isso ocorre porque acabamos de mapear www.google.com para um endereço IP completamente errado. Como nossos hosts primeiro procuram localmente por mapeamentos de endereços IP, ele nunca alcança o DNS para encontrar google.com.</p><p><b>/etc/resolv.conf</b></p><p>Tradicionalmente, usamos um arquivo chamado /etc/resolv.conf para mapear servidores de nomes DNS para consultas mais eficientes, no entanto, com as melhorias feitas no DNS, este arquivo é frequentemente irrelevante, na verdade, você pode ver em meu exemplo abaixo que /etc/resolv.conf não é gerenciado manualmente. Consulte as configurações específicas de sua distribuição para gerenciar os mapeamentos de servidores de nomes DNS.</p><pre>conf(5) file for glibc resolver(3) generated by resolvconf(8)<br>#     NÃO EDITE ESTE ARQUIVO MANUALMENTE - SUAS ALTERAÇÕES SERÃO SOBRESCRITAS<br>nameserver 127.0.1.1<br>search localdomain</pre>",
  "exercise": "Não há exercícios para esta lição.",
  "quizQuestion": "Qual arquivo é usado para mapear nomes de host para endereços IP em nossas máquinas?",
  "quizAnswer": "/etc/hosts",
  "slug": "etchosts"
}