{
  "id": 3,
  "title": "Anatomía de un Disco",
  "lessonContent": "Los discos duros se pueden subdividir en particiones, lo que básicamente crea múltiples dispositivos de bloques. Recuerda ejemplos como /dev/sda1 y /dev/sda2, donde /dev/sda es el disco completo, pero /dev/sda1 es la primera partición en ese disco. Las particiones son extremadamente útiles para separar datos y si necesitas un determinado sistema de archivos, puedes crear fácilmente una partición en lugar de hacer que todo el disco sea de un solo tipo de sistema de archivos.\n\n<b>Tabla de Particiones</b>\n\nCada disco tendrá una tabla de particiones, la cual le indica al sistema cómo está particionado el disco. Esta tabla te dice dónde comienzan y terminan las particiones, cuáles son arrancables, qué sectores del disco están asignados a qué partición, etc. Hay dos esquemas principales de tablas de particiones utilizados, Registro de Arranque Principal (MBR) y Tabla de Partición GUID (GPT).\n\n<b>Partición</b>\n\nLos discos están compuestos por particiones que nos ayudan a organizar nuestros datos. Puedes tener múltiples particiones en un disco y no pueden superponerse entre sí. Si hay espacio no asignado a una partición, se conoce como espacio libre. Los tipos de particiones dependen de tu tabla de particiones. Dentro de una partición, puedes tener un sistema de archivos o dedicar una partición a otras cosas como swap (llegaremos a eso pronto).\n\n<i>MBR</i>\n\n<ul>\n<li>Tabla de particiones tradicional, solía ser el estándar</li>\n<li>Puede tener particiones primarias, extendidas y lógicas</li>\n<li>MBR tiene un límite de cuatro particiones primarias</li>\n<li>Se pueden crear particiones adicionales convirtiendo una partición primaria en una partición extendida (solo puede haber una partición extendida en un disco). Luego, dentro de la partición extendida, se agregan particiones lógicas. Las particiones lógicas se utilizan como cualquier otra partición. Un poco tonto, lo sé.</li>\n<li>Admite discos de hasta 2 terabytes</li>\n</ul>\n\n<i>GPT</i>\n\n<ul>\n<li>La Tabla de Partición GUID (GPT) se está convirtiendo en el nuevo estándar para la partición de discos</li>\n<li>Tiene solo un tipo de partición y puedes crear muchas de ellas</li>\n<li>Cada partición tiene un ID único a nivel global (GUID)</li>\n<li>Se utiliza principalmente en conjunto con el arranque basado en UEFI (entraremos en detalles en otro curso)</li>\n</ul>\n\n<b>Estructura del Sistema de Archivos</b>\n\nSabemos por nuestra lección anterior que un sistema de archivos es una colección organizada de archivos y directorios. En su forma más simple, está compuesto por una base de datos para administrar archivos y los propios archivos, sin embargo, vamos a entrar en un poco más de detalle.\n\n<ul>\n<li>Bloque de arranque - Este se encuentra en los primeros sectores del sistema de archivos y realmente no es utilizado por el sistema de archivos. En cambio, contiene información utilizada para arrancar el sistema operativo. Solo se necesita un bloque de arranque por el sistema operativo. Si tienes múltiples particiones, tendrán bloques de arranque, pero muchos de ellos no se utilizan.</li>\n<li>Super bloque - Este es un solo bloque que viene después del bloque de arranque, y contiene información sobre el sistema de archivos, como el tamaño de la tabla de inodos, el tamaño de los bloques lógicos y el tamaño del sistema de archivos.</li>\n<li>Tabla de inodos - Piensa en esto como la base de datos que administra nuestros archivos (tenemos una lección completa sobre inodos, así que no te preocupes). Cada archivo o directorio tiene una entrada única en la tabla de inodos y contiene información variada sobre el archivo.</li>\n<li>Bloques de datos - Estos son los datos reales de los archivos y directorios.</li>\n</ul>\n\nEchemos un vistazo a las diferentes tablas de particiones. A continuación se muestra un ejemplo de una partición utilizando la tabla de particiones MBR (msdos). Puedes ver las particiones primarias, extendidas y lógicas en la máquina.\n\n<pre>\npete@icebox:~$ sudo parted -l\nModelo: Seagate (scsi)\nDisco /dev/sda: 21.5GB\nTamaño del sector (lógico/físico): 512B/512B\nTabla de particiones: msdos\n\nNúmero  Inicio   Fin     Tamaño    Tipo      Sistema de archivos     Banderas\n 1      1049kB  6860MB  6859MB    primaria   ext4                    arranque\n 2      6861MB  21.5GB  14.6GB    extendida\n 5      6861MB  7380MB  519MB     lógica     linux-swap(v1)\n 6      7381MB  21.5GB  14.1GB    lógica     xfs\n</pre>\n\n\nEste ejemplo es de GPT, utilizando solo un ID único para las particiones.\n\n<pre>\nModelo: Thumb Drive (scsi)\nDisco /dev/sdb: 4041MB\nTamaño del sector (lógico/físico): 512B/512B\nTabla de particiones: gpt\n\nNúmero  Inicio   Fin     Tamaño    Sistema de archivos  Nombre        Banderas\n 1      17.4kB  1000MB  1000MB                    first\n 2      1000MB  4040MB  3040MB                    second\n</pre>",
  "exercise": "Ejecuta <b>parted -l</b> en tu máquina y evalúa tus resultados.",
  "quizQuestion": "¿Qué tipo de partición se utiliza para crear más de 4 particiones en el esquema de particionamiento MBR?",
  "quizAnswer": "extendida",
  "slug": "anatomyofadisk"
}