{
  "id": 4,
  "title": "Particionado de disco",
  "lessonContent": "Vamos a hacer algunas cosas prácticas con sistemas de archivos trabajando a través del proceso en una unidad USB. Si no tienes una, no te preocupes, aún puedes seguir estas próximas lecciones. \n\nPrimero necesitaremos particionar nuestro disco. Hay muchas herramientas disponibles para hacer esto: \n\n<ul>\n<li>fdisk - herramienta básica de particionamiento de línea de comandos, no soporta GPT</li>\n<li>parted - esta es una herramienta de línea de comandos que soporta particionamiento tanto MBR como GPT</li>\n<li>gparted - esta es la versión con interfaz gráfica de parted</li>\n<li>gdisk - fdisk, pero no soporta MBR, solo GPT</li>\n</ul>\n\nVamos a usar parted para hacer nuestra partición. Digamos que conecto el dispositivo USB y vemos que el nombre del dispositivo es /dev/sdb2. \n\n<b>Iniciar parted</b>\n\n<pre>$ sudo parted</pre>\n\nEntrarás en la herramienta parted, aquí puedes ejecutar comandos para particionar tu dispositivo. \n\n<b>Seleccionar el dispositivo</b>\n\n<pre>select /dev/sdb2</pre>\n\nPara seleccionar el dispositivo con el que trabajarás, selecciónalo por su nombre de dispositivo.\n\n<b>Ver la tabla de particiones actual</b>\n\n<pre>\n(parted) print                                                            \nModelo: Seagate (scsi)\nDisco /dev/sda: 21.5GB\nTamaño de sector (lógico/físico): 512B/512B\nTabla de particiones: msdos\n\nNúmero  Inicio   Fin     Tamaño   Tipo      Sistema de archivos     Banderas\n 1      1049kB  6860MB  6859MB  primaria   ext4            arranque\n 2      6861MB  21.5GB  14.6GB  extendida\n 5      6861MB  7380MB  519MB   lógica   linux-swap(v1)\n 6      7381MB  21.5GB  14.1GB  lógica   xfs\n</pre>\n\nAquí verás las particiones disponibles en el dispositivo. Los puntos de <b>inicio</b> y <b>fin</b> son donde las particiones ocupan espacio en el disco duro, querrás encontrar un buen lugar de inicio y fin para tus particiones. \n\n<b>Particionar el dispositivo</b>\n\n<pre>mkpart primaria 123 4567</pre>\n\nAhora solo elige un punto de inicio y fin y haz la partición, deberás especificar el tipo de partición dependiendo de la tabla que hayas usado. \n\n<b>Redimensionar una partición</b>\n\nTambién puedes redimensionar una partición si no tienes espacio. \n\n<pre>resize 2 1245 3456</pre>\n\nSelecciona el número de partición y luego los puntos de inicio y fin a los que deseas redimensionarla. \n\nParted es una herramienta muy poderosa y debes tener cuidado al particionar tus discos.",
  "exercise": "Particionar una unidad USB con la mitad del disco como ext4 y la otra mitad como espacio libre.",
  "quizQuestion": "¿Cuál es el comando de parted para hacer una partición?",
  "quizAnswer": "mkpart",
  "slug": "particionadodedisco"
}