{
  "id": 2,
  "title": "Tipos de Sistemas de Archivos",
  "lessonContent": "Existen muchas implementaciones de sistemas de archivos disponibles. Algunos son más rápidos que otros, algunos admiten almacenamiento de mayor capacidad y otros solo funcionan en almacenamientos de menor capacidad. Los diferentes sistemas de archivos tienen diferentes formas de organizar sus datos y entraremos en detalle sobre qué tipos de sistemas de archivos existen. Dado que hay tantas implementaciones diferentes disponibles, las aplicaciones necesitan una forma de lidiar con las diferentes operaciones. Por lo tanto, existe algo llamado la capa de abstracción del Sistema de Archivos Virtual (VFS). Es una capa entre las aplicaciones y los diferentes tipos de sistemas de archivos, por lo que no importa qué sistema de archivos tengas, tus aplicaciones podrán trabajar con él. \n\nPuedes tener muchos sistemas de archivos en tus discos, dependiendo de cómo estén particionados y lo veremos en una lección próxima.\n\n<b>Registro</b>\n\nEl registro viene por defecto en la mayoría de los tipos de sistemas de archivos, pero en caso de que no lo tenga, debes saber qué hace. Digamos que estás copiando un archivo grande y de repente se corta la energía. Bueno, si estás en un sistema de archivos sin registro, el archivo terminaría dañado y tu sistema de archivos sería inconsistente y luego, al reiniciar, tu sistema realizaría una comprobación del sistema de archivos para asegurarse de que todo esté bien. Sin embargo, las reparaciones podrían llevar un tiempo dependiendo de cuán grande sea tu sistema de archivos. \n\nAhora, si estuvieras en un sistema con registro, antes de que tu máquina comience a copiar el archivo, escribirá lo que vas a hacer en un archivo de registro (registro). Ahora, cuando realmente copies el archivo, una vez que se complete, el registro marcará esa tarea como completada. El sistema de archivos siempre está en un estado consistente debido a esto, por lo que sabrá exactamente dónde lo dejaste si tu máquina se apaga repentinamente. Esto también reduce el tiempo de arranque porque en lugar de verificar todo el sistema de archivos, solo mira tu registro.\n\n<b>Tipos Comunes de Sistemas de Archivos de Escritorio</b>\n\n<ul>\n<li>ext4 - Esta es la versión más actual de los sistemas de archivos nativos de Linux. Es compatible con las versiones anteriores ext2 y ext3. Admite volúmenes de disco de hasta 1 exabyte y tamaños de archivo de hasta 16 terabytes y mucho más. Es la opción estándar para los sistemas de archivos de Linux.</li>\n<li>Btrfs - \"Mejor o Butter FS\", es un nuevo sistema de archivos para Linux que viene con instantáneas, copias de seguridad incrementales, aumento de rendimiento y mucho más. Está ampliamente disponible, pero aún no es del todo estable y compatible.</li>\n<li>XFS - Sistema de archivos de registro de alto rendimiento, ideal para un sistema con archivos grandes como un servidor multimedia.</li>\n<li>NTFS y FAT - Sistemas de archivos de Windows</li>\n<li>HFS+ - Sistema de archivos de Macintosh</li>\n</ul>\n\nConsulta qué sistemas de archivos hay en tu máquina: \n\n<pre>\npete@icebox:~$ df -T\nFilesystem     Type     1K-blocks    Used Available Use% Mounted on\n/dev/sda1      ext4       6461592 2402708   3707604  40% /\nudev           devtmpfs    501356       4    501352   1% /dev\ntmpfs          tmpfs       102544    1068    101476   2% /run\n/dev/sda6      xfs       13752320  460112  13292208   4% /home\n</pre>\n\nEl comando <b>df</b> informa sobre el uso del espacio en disco del sistema de archivos y otros detalles sobre tu disco, hablaremos más sobre esta herramienta más adelante.",
  "exercise": "Investiga un poco en línea sobre los otros tipos de sistemas de archivos: ReiserFS, ZFS, JFS y otros que puedas encontrar.",
  "quizQuestion": "¿Cuál es el tipo de sistema de archivos Linux común?",
  "quizAnswer": "ext4",
  "slug": "tipos-de-sistemas-de-archivos"
}