{
  "id": 1,
  "title": "Jerarquía del sistema de archivos",
  "lessonContent": "En este punto, probablemente estés bastante familiarizado con la estructura de directorios de tu sistema, si no, pronto lo estarás. Los sistemas de archivos pueden variar en cómo están estructurados, pero en su mayor parte deberían cumplir con el Estándar de Jerarquía del Sistema de Archivos. \n\nAdelante y haz un <b>ls -l /</b> para ver los directorios listados bajo el directorio raíz, el tuyo puede verse diferente al mío, pero los directorios deberían parecerse en su mayor parte a lo siguiente:\n\n<ul>\n<li>/ - El directorio raíz de toda la jerarquía del sistema de archivos, todo está anidado bajo este directorio.</li>\n<li>/bin - Programas esenciales listos para ejecutarse (binarios), incluye los comandos más básicos como ls y cp.</li>\n<li>/boot - Contiene archivos del cargador de arranque del kernel.</li>\n<li>/dev - Archivos de dispositivos.</li>\n<li>/etc - Directorio de configuración del sistema central, solo debería contener archivos de configuración y no binarios.</li>\n<li>/home - Directorios personales para usuarios, contiene tus documentos, archivos, configuraciones, etc.</li>\n<li>/lib - Contiene archivos de biblioteca que los binarios pueden usar.</li>\n<li>/media - Utilizado como punto de conexión para medios extraíbles como unidades USB.</li>\n<li>/mnt - Sistemas de archivos montados temporalmente.</li>\n<li>/opt - Paquetes de software de aplicación opcionales.</li>\n<li>/proc - Información sobre los procesos en ejecución actualmente.</li>\n<li>/root - Directorio de inicio del usuario root.</li>\n<li>/run - Información sobre el sistema en ejecución desde el último arranque.</li>\n<li>/sbin - Contiene binarios esenciales del sistema, generalmente solo pueden ser ejecutados por root.</li>\n<li>/srv - Datos específicos del sitio que son servidos por el sistema.</li>\n<li>/tmp - Almacenamiento para archivos temporales.</li>\n<li>/usr - Lamentablemente nombrado, la mayoría de las veces no contiene archivos de usuario en el sentido de una carpeta de inicio. Esto está destinado para software y utilidades instalados por el usuario, sin embargo, eso no significa que no puedas agregar directorios personales allí. Dentro de este directorio hay subdirectorios para /usr/bin, /usr/local, etc.</li>\n<li>/var - Directorio variable, se utiliza para el registro del sistema, seguimiento de usuarios, cachés, etc. Básicamente cualquier cosa que esté sujeta a cambios todo el tiempo.</li>\n</ul>",
  "exercise": "Mira dentro de tu directorio /usr, ¿qué tipo de información se encuentra allí?",
  "quizQuestion": "¿En qué directorio se almacenan los registros?",
  "quizAnswer": "/var",
  "slug": "jerarquiadelsistemaarchivos"
}