{
  "id": 11,
  "title": "Inodos",
  "lessonContent": "Recuerda cómo nuestro sistema de archivos está compuesto por todos nuestros archivos reales y una base de datos que gestiona estos archivos. La base de datos se conoce como la tabla de inodos. \n\n<b>¿Qué es un inodo?</b>\n\nUn inodo (nodo de índice) es una entrada en esta tabla y hay uno para cada archivo. Describe todo sobre el archivo, como:\n\n<ul>\n<li>Tipo de archivo - archivo regular, directorio, dispositivo de caracteres, etc.</li>\n<li>Propietario</li>\n<li>Grupo</li>\n<li>Permisos de acceso</li>\n<li>Timestamps - mtime (hora de la última modificación del archivo), ctime (hora del último cambio de atributo), atime (hora del último acceso)</li>\n<li>Número de enlaces duros al archivo</li>\n<li>Tamaño del archivo</li>\n<li>Número de bloques asignados al archivo</li>\n<li>Punteros a los bloques de datos del archivo - ¡muy importante!</li>\n</ul>\n\nBásicamente, los inodos almacenan todo sobre el archivo, ¡excepto el nombre de archivo y el archivo en sí!\n\n<b>¿Cuándo se crean los inodos?</b>\n\nCuando se crea un sistema de archivos, también se asigna espacio para los inodos. Hay algoritmos que determinan cuánto espacio de inodo necesitas según el volumen del disco y más. Probablemente en algún momento de tu vida hayas visto errores por problemas de falta de espacio en disco. Bueno, lo mismo puede ocurrir con los inodos (aunque menos común), puedes quedarte sin inodos y por lo tanto ser incapaz de crear más archivos. Recuerda que el almacenamiento de datos depende tanto de los datos como de la base de datos (inodos). \n\nPara ver cuántos inodos quedan en tu sistema, usa el comando <b>df -i</b>\n\n<b>Información de inodo</b>\n\nLos inodos se identifican por números, cuando se crea un archivo se le asigna un número de inodo, el número se asigna en orden secuencial. Sin embargo, a veces puedes notar que al crear un nuevo archivo, recibe un número de inodo más bajo que otros, esto se debe a que una vez que se eliminan los inodos, pueden ser reutilizados por otros archivos. Para ver los números de inodo ejecuta <b>ls -li</b>:\n\n<pre>\npete@icebox:~$ ls -li\n140 drwxr-xr-x 2 pete pete 6 ene 20 20:13 Escritorio\n141 drwxr-xr-x 2 pete pete 6 ene 20 20:01 Documentos\n</pre>\n\nEl primer campo en este comando lista el número de inodo.\n\nTambién puedes ver información detallada sobre un archivo con stat, te proporciona información sobre el inodo también.\n\n<pre>\npete@icebox:~$ stat ~/Escritorio/\n  Archivo: ‘/home/pete/Escritorio/’\n  Tamaño: 6               Bloques: 0          Bloque de E/S: 4096   directorio\nDispositivo: 806h/2054d      Inodo: 140         Enlaces: 2\nAcceso: (0755/drwxr-xr-x)  Uid: ( 1000/   pete)   Gid: ( 1000/   pete)\nAcceso: 2016-01-20 20:13:50.647435982 -0800\nModificar: 2016-01-20 20:13:06.191675843 -0800\nCambiar: 2016-01-20 20:13:06.191675843 -0800\n Creación: -\n</pre>\n\n\n<b>¿Cómo localizan los inodos los archivos?</b>\n\nSabemos que nuestros datos están en algún lugar del disco, lamentablemente probablemente no se almacenaron de forma secuencial, por lo que tenemos que usar inodos. Los inodos apuntan a los bloques de datos reales de tus archivos. En un sistema de archivos típico (no todos funcionan igual), cada inodo contiene 15 punteros, los primeros 12 punteros apuntan directamente a los bloques de datos. El puntero 13, apunta a un bloque que contiene punteros a más bloques, el puntero 14 apunta a otro bloque anidado de punteros, ¡y el puntero 15 apunta nuevamente a otro bloque de punteros! ¡Confuso, lo sé! La razón por la que se hace de esta manera es mantener la estructura del inodo igual para cada inodo, pero poder hacer referencia a archivos de diferentes tamaños. Si tienes un archivo pequeño, puedes encontrarlo más rápido con los primeros 12 punteros directos, los archivos más grandes se pueden encontrar con los anidamientos de punteros. De cualquier manera, la estructura del inodo es la misma.",
  "exercise": "Observa algunos números de inodo para diferentes archivos, ¿cuáles suelen crearse primero?",
  "quizQuestion": "¿Cómo puedes ver cuántos inodos quedan en tu sistema?",
  "quizAnswer": "df -i",
  "slug": "inodos"
}