{
  "id": 12,
  "title": "symlinks",
  "lessonContent": "Vamos a usar un ejemplo previo de información de inodo: \n\n<pre>\npete@icebox:~$ ls -li\n140 drwxr-xr-x 2 pete pete 6 Jan 20 20:13 Desktop\n141 drwxr-xr-x 2 pete pete 6 Jan 20 20:01 Documents\n</pre>\n\nPuede que hayas notado que hemos estado pasando por alto el tercer campo en el comando ls, ese campo es el recuento de enlaces. El recuento de enlaces es el número total de enlaces duros que tiene un archivo, lo cual no significa nada para ti en este momento. Así que hablemos primero de los enlaces. \n\n<b>Enlaces simbólicos</b>\n\nEn el sistema operativo Windows, existen cosas conocidas como accesos directos, los accesos directos son simplemente alias de otros archivos. Si haces algo al archivo original, podrías potencialmente romper el acceso directo. En Linux, el equivalente de los accesos directos son los enlaces simbólicos (o enlaces suaves o symlinks). Los enlaces simbólicos nos permiten enlazar a otro archivo por su nombre de archivo. Otro tipo de enlaces que se encuentran en Linux son los enlaces duros, que en realidad son otro archivo con un enlace a un inodo. Veamos a qué me refiero en la práctica comenzando con los enlaces simbólicos.\n\n<pre>\npete@icebox:~/Desktop$ echo 'myfile' > myfile\npete@icebox:~/Desktop$ echo 'myfile2' > myfile2\npete@icebox:~/Desktop$ echo 'myfile3' > myfile3\n\npete@icebox:~/Desktop$ ln -s myfile myfilelink\npete@icebox:~/Desktop$ ls -li\ntotal 12\n  151 -rw-rw-r-- 1 pete pete 7 Jan 21 21:36 myfile\n93401 -rw-rw-r-- 1 pete pete 8 Jan 21 21:36 myfile2\n93402 -rw-rw-r-- 1 pete pete 8 Jan 21 21:36 myfile3\n93403 lrwxrwxrwx 1 pete pete 6 Jan 21 21:39 myfilelink -> myfile\n</pre>\n\nPuedes ver que he creado un enlace simbólico llamado myfilelink que apunta a myfile. Los enlaces simbólicos se indican con ->. Observa cómo obtuve un nuevo número de inodo, los enlaces simbólicos son solo archivos que apuntan a nombres de archivo. Cuando modificas un enlace simbólico, el archivo también se modifica. Los números de inodo son únicos para los sistemas de archivos, no puedes tener dos del mismo número de inodo en un solo sistema de archivos, lo que significa que no puedes hacer referencia a un archivo en un sistema de archivos diferente por su número de inodo. Sin embargo, si usas enlaces simbólicos, no utilizan números de inodo, utilizan nombres de archivo, por lo que pueden ser referenciados en diferentes sistemas de archivos. \n\n<b>Enlaces duros</b>\n\nVeamos un ejemplo de un enlace duro:\n\n<pre>\npete@icebox:~/Desktop$ ln myfile2 myhardlink\npete@icebox:~/Desktop$ ls -li\ntotal 16\n  151 -rw-rw-r-- 1 pete pete 7 Jan 21 21:36 myfile\n93401 -rw-rw-r-- 2 pete pete 8 Jan 21 21:36 myfile2\n93402 -rw-rw-r-- 1 pete pete 8 Jan 21 21:36 myfile3\n93403 lrwxrwxrwx 1 pete pete 6 Jan 21 21:39 myfilelink -> myfile\n93401 -rw-rw-r-- 2 pete pete 8 Jan 21 21:36 myhardlink\n</pre>\n\nUn enlace duro simplemente crea otro archivo con un enlace al mismo inodo. Entonces, si modificara el contenido de myfile2 o myhardlink, el cambio se vería en ambos, pero si eliminara myfile2, el archivo seguiría siendo accesible a través de myhardlink. Aquí es donde entra en juego nuestro recuento de enlaces en el comando ls. El recuento de enlaces es el número de enlaces duros que tiene un inodo, cuando eliminas un archivo, ese recuento de enlaces disminuirá. El inodo solo se elimina cuando se han eliminado todos los enlaces duros al inodo. Cuando creas un archivo, su recuento de enlaces es 1 porque es el único archivo que apunta a ese inodo. A diferencia de los enlaces simbólicos, los enlaces duros no abarcan sistemas de archivos porque los inodos son únicos para el sistema de archivos. \n\n<b>Creación de un enlace simbólico</b>\n\n<pre>\n$ ln -s myfile mylink</pre>\n\nPara crear un enlace simbólico, utilizas el comando ln con -s para simbólico y especificas un archivo de destino y luego un nombre de enlace. \n\n<b>Creación de un enlace duro</b>\n\n<pre>\n$ ln somefile somelink</pre>\n\nSimilar a la creación de un enlace simbólico, excepto que esta vez omites el -s.",
  "exercise": "Juega con la creación de enlaces simbólicos y enlaces duros, elimina un par y observa qué sucede.",
  "quizQuestion": "¿Cuál es el comando utilizado para hacer un enlace simbólico?",
  "quizAnswer": "ln -s",
  "slug": "symlinks"
}