{
  "id": 2,
  "title": "टर्मिनल नियंत्रण",
  "lessonContent": "हमने चरणों में एक टीटीवाई क्षेत्र है कैसे चरणों में एक टीटीवाई क्षेत्र है, इस पर चर्चा की। टीटीवाई वह टर्मिनल है जिसने कमांड का निष्पादन किया।\n\nदो प्रकार की टर्मिनल होती हैं, नियमित <b>टर्मिनल उपकरण</b> और <b>प्यूडोटर्मिनल उपकरण</b>। एक नियमित टर्मिनल उपकरण एक स्थानीय टर्मिनल उपकरण है जिसमें आप टाइप कर सकते हैं और अपने सिस्टम को आउटपुट भेज सकते हैं, यह वह टर्मिनल एप्लिकेशन सुनाई देती है जिसे आप अपने शैल में पहुंचने के लिए लॉन्च कर रहे हैं, लेकिन यह नहीं है।\n\nहम इस क्रिया को देखने के लिए जा रहे हैं, आगे बढ़ें और TTY1 (पहली वर्चुअल कंसोल) में पहुंचने के लिए Ctrl-Alt-F1 टाइप करें, आपको ध्यान देना चाहिए कि आपके पास कुछ भी नहीं है केवल टर्मिनल, कोई ग्राफिक्स आदि नहीं। यह एक नियमित टर्मिनल उपकरण माना जाता है, आप इसे Ctrl-Alt-F7 के साथ बाहर निकल सकते हैं।\n\nएक प्यूडोटर्मिनल वह है जिसमें आप काम करने के लिए उपयोग करते थे, वे शैल टर्मिनल विंडो के साथ टर्मिनल को अनुकरण करते हैं और PTS द्वारा दर्शाए जाते हैं। अगर आप फिर से ps देखते हैं, तो आप अपनी शैल प्रक्रिया को pts/* के तहत देखेंगे।\n\nठीक है, अब नियंत्रण टर्मिनल पर वापस आते हैं, प्रक्रियाएँ आम तौर पर एक नियंत्रण टर्मिनल से बांधी जाती हैं। उदाहरण के लिए, यदि आप अपने शैल विंडो पर कोई प्रोग्राम चला रहे होते जैसे find और आप विंडो को बंद कर देते, तो आपकी प्रक्रिया भी उसके साथ चली जाएगी।\n\nडेमन प्रक्रियाओं जैसे प्रक्रियाएँ होती हैं, जो आम तौर पर सिस्टम को चलाए रखने वाली विशेष प्रक्रियाएँ होती हैं। वे अक्सर सिस्टम बूट पर शुरू होती हैं और आम तौर पर सिस्टम बंद होने पर समाप्त हो जाती हैं। वे पिछले प्लान में चलती हैं और क्योंकि हम चाहते हैं कि ये विशेष प्रक्रियाएँ समाप्त न हों, इसलिए उन्हें नियंत्रण टर्मिनल से बांधा नहीं जाता है। ps आउटपुट में, टीटीवाई को <b>?</b> के रूप में दर्शाया गया है जिसका अर्थ है कि इसके पास एक नियंत्रण टर्मिनल नहीं है।",
  "exercise": "अपने ps आउटपुट पर देखें और सभी अद्वितीय टीटीवाई मानों की सूची बनाएं।",
  "quizQuestion": "एक प्रक्रिया के लिए कौन सा मान दिया जाता है जिसके पास एक नियंत्रण टर्मिनल नहीं है?",
  "quizAnswer": "?",
  "slug": "controllingterminal"
}