{
  "id": 11,
  "title": "नौकरी नियंत्रण",
  "lessonContent": "चलो मान लो कि आप एक ही टर्मिनल विंडो पर काम कर रहे हैं और आपका कमांड बहुत समय ले रहा है। जब तक यह पूरा नहीं होता, तब तक आप शैल के साथ इंटरैक्ट नहीं कर सकते, हालांकि हमें अपनी मशीन पर काम करना जारी रखना है, इसलिए हमें उस शैल को खोला रखने की आवश्यकता है। भागों के साथ हम अपने प्रक्रियाओं को कैसे चलाएं इसे नियंत्रित कर सकते हैं: \n\n<b>पृष्ठभूमि पर नौकरी भेजना</b>\n\nकमांड के अंत में एम्परसैंड (&) जोड़ने से यह पृष्ठभूमि में चलाया जाएगा ताकि आप अपनी शैल का उपयोग कर सकें। चलो एक उदाहरण देखते हैं:\n\n<pre>$ sleep 1000 &\n$ sleep 1001 &\n$ sleep 1002 &\n</pre>\n\n<b>सभी पृष्ठभूमि पर नौकरियाँ देखें</b>\n\nअब आप उन नौकरियों को देख सकते हैं जिन्हें आपने हाल ही में पृष्ठभूमि पर भेजा है।\n\n<pre>$ jobs\n\n[1]    Running     sleep 1000 &\n[2]-   Running     sleep 1001 &\n[3]+   Running     sleep 1002 &\n\n</pre>\n\nयह आपको पहले स्तंभ में नौकरी आईडी दिखाएगा, फिर स्थिति और उस कमांड को जो चलाया गया था। जॉब आईडी के पास <b>+</b> का मतलब है कि यह सबसे हाल ही में शुरू हुई पृष्ठभूमि नौकरी है। <b>-</b> के साथ नौकरी दूसरी सबसे हाल ही में चलाई गई कमांड है।\n\n<b>मौजूदा नौकरी पृष्ठभूमि पर भेजना</b>\n\nअगर आपने पहले से ही एक नौकरी चलाई है और उसे पृष्ठभूमि पर भेजना चाहते हैं, तो आपको उसे समाप्त नहीं करना है और फिर से शुरू करना है। पहले Ctrl-Z के साथ नौकरी को रोकें, फिर <b>bg</b> कमांड चलाएं ताकि उसे पृष्ठभूमि पर भेजा जा सके।\n\n<pre>\npete@icebox ~ $ sleep 1003\n^Z\n[4]+    Stopped     sleep 1003\n\npete@icebox ~ $ bg\n[4]+    sleep 1003 &\n\npete@icebox ~ $ jobs\n\n[1]    Running     sleep 1000 &\n[2]    Running     sleep 1001 &\n[3]-   Running     sleep 1002 &\n[4]+   Running     sleep 1003 &\n</pre>\n\n<b>पृष्ठभूमि से पृष्ठ में नौकरी ले जाना</b>\n\nपृष्ठभूमि से नौकरी बाहर लेने के लिए बस उस नौकरी आईडी को निर्दिष्ट करें। यदि आप किसी विकल्प के बिना fg चलाते हैं, तो यह सबसे हाल ही में शुरू हुई पृष्ठभूमि नौकरी लाएगा (जो + चिह्न के साथ है)\n\n<pre>$ fg %1</pre>\n\n<b>पृष्ठभूमि नौकरियों को मारना</b>\n\nपृष्ठभूमि से नौकरियों को बाहर लेने के तरह, आप उन प्रक्रियाओं को मारने के लिए उनके जॉब आईडी का उपयोग कर सकते हैं।\n\n<pre>kill %1</pre>",
  "exercise": "कुछ नौकरियों को पृष्ठभूमि और पृष्ठ में ले जाएं",
  "quizQuestion": "पृष्ठभूमि पर नौकरियाँ सूचित करने के लिए कौन सा कमांड उपयोग किया जाता है?",
  "quizAnswer": "jobs",
  "slug": "नौकरीनियंत्रण"
}