{
  "id": 1,
  "title": "ps (प्रक्रियाएँ)",
  "lessonContent": "प्रक्रियाएँ वे कार्यक्रम हैं जो आपके मशीन पर चल रहे हैं। वे कर्नेल द्वारा प्रबंधित होते हैं और प्रत्येक प्रक्रिया के साथ एक पहचान संबंधित होती है जिसे <b>प्रक्रिया आईडी (PID)</b> कहा जाता है। यह PID प्रक्रियाएँ बनाई जाती हैं उसी क्रम में सौंपा जाता है। \n\nआगे बढ़ें और चलाएं ps कमांड ताकि चल रही प्रक्रियाओं की सूची देख सकें:\n\n<pre>$ ps\n\nPID        TTY     STAT   TIME          CMD\n41230    pts/4    Ss        00:00:00     bash\n51224    pts/4    R+        00:00:00     ps\n</pre>\n\nयह आपको वर्तमान प्रक्रियाओं का एक त्वरित स्नैपशॉट दिखाता है:\n\n<ul>\n<li>PID: प्रक्रिया आईडी</li>\n<li>TTY: प्रक्रिया से संबंधित नियंत्रण टर्मिनल (हम इसके बारे में बाद में विस्तार से जाएंगे)</li>\n<li>STAT: प्रक्रिया स्थिति कोड</li>\n<li>TIME: कुल सीपीयू उपयोग समय</li>\n<li>CMD: क्रियाशील/कमांड का नाम</li>\n</ul>\n\nयदि आप ps के मैन पेज पर देखेंगे तो आप देखेंगे कि आप कितने सारे कमांड विकल्प पास कर सकते हैं, वे आपके उपयोग के अनुसार भिन्न होंगे - बीएसडी, जीएनयू या यूनिक्स। मेरी राय में बीएसडी शैली अधिक लोकप्रिय है इसलिए हम उसके साथ जाएंगे। यदि आपको इसमें अंतर की जानकारी चाहिए तो अंतर है कि आप कितनी डैश और झंडे का उपयोग करते हैं।\n\n<pre>$ ps aux</pre>\n\n<b>a</b> सभी प्रक्रियाएँ दिखाता है जो चल रही हैं, जिसमें अन्य उपयोगकर्ताओं द्वारा चलाई जा रही हैं। <b>u</b> प्रक्रियाओं के बारे में अधिक विवरण दिखाता है। और अंततः <b>x</b> उस सभी प्रक्रियाओं की सूची दिखाता है जिनके पास एक TTY संबंधित नहीं है, इन कार्यक्रमों में TTY क्षेत्र में ? दिखाएगा, वे सबसे अधिक सामान्य डेमन प्रक्रियाओं में होते हैं जो प्रणाली स्टार्टअप का हिस्सा होते हैं।\n\nआप अब अधिक फील्ड देख रहे हैं, इन सभी को याद रखने की आवश्यकता नहीं है, एक उन्नत प्रक्रिया पर कोर्स में हम इनमें से कुछ फिर से देखेंगे:\n\n<ul>\n<li>USER: प्रभावी उपयोगकर्ता (जिसका उपयोग हम कर रहे हैं)</li>\n<li>PID: प्रक्रिया आईडी</li>\n<li>%CPU: सीपीयू समय का उपयोग किया गया समय जिसे प्रक्रिया चल रही है</li>\n<li>%MEM: प्रक्रिया के आवासी सेट का अनुपात मशीन पर शारीरिक स्मृति के साथ</li>\n<li>VSZ: पूरी प्रक्रिया का वर्चुअल मेमोरी उपयोग</li>\n<li>RSS: रेजिडेंट सेट साइज, एक कार्य का जो कार्य किया है जिसे नहीं स्वैप किया गया है</li>\n<li>TTY: प्रक्रिया से संबंधित नियंत्रण टर्मिनल</li>\n<li>STAT: प्रक्रिया स्थिति कोड</li>\n<li>START: प्रक्रिया का समय आरंभ</li>\n<li>TIME: कुल सीपीयू उपयोग समय</li>\n<li>COMMAND: क्रियाशील/कमांड का नाम</li>\n</ul>\n\nps कमांड देखने में थोड़ा गंदा हो सकता है, अब तक हम जिन फील्ड को सबसे अधिक देखेंगे वे हैं PID, STAT और COMMAND। \n\nएक और बहुत ही उपयोगी कमांड है <b>top</b> कमांड, top आपको आपके सिस्टम पर चल रही प्रक्रियाओं के वास्तविक समय की जानकारी देता है बजाय एक स्नैपशॉट की। डिफ़ॉल्ट रूप से आपको हर 10 सेकंड में ताजगी मिलेगी। टॉप एक अत्यंत उपयोगी उपकरण है जिससे आप देख सकते हैं कि कौन सी प्रक्रियाएँ आपके संसाधनों का अधिक भाग ले रही हैं। \n\n<pre>$ top</pre>",
  "exercise": "विभिन्न झंडों के साथ ps कमांड का उपयोग करें और देखें कि आउटपुट कैसे बदलता है।",
  "quizQuestion": "प्रक्रियाओं के बारे में विस्तृत जानकारी देखने के लिए कौन सा ps झंडा उपयोग किया जाता है?",
  "quizAnswer": "u",
  "slug": "monitorprocessespscommand"
}