{
  "id": 4,
  "title": "प्रक्रिया निर्माण",
  "lessonContent": "फिर से यह सबक और अगला केवल जानकारी है जिससे आप देख सकते हैं कि डिवाइस के नीचे क्या है, प्रक्रियाओं के साथ काम करने के बाद इस पर वापस आने का मन करता है।\n\nजब एक नई प्रक्रिया बनाई जाती है, तो एक मौजूदा प्रक्रिया ने अक्सर खुद को क्लोन करते हुए कुछ नया उत्पन्न करती है, जिसे कुछ फॉर्क सिस्टम कॉल कहा जाता है (सिस्टम कॉल को बहुत दूर भविष्य में चर्चा की जाएगी)। फॉर्क सिस्टम कॉल एक अधिकांश तौर पर एक समान बच्चा प्रक्रिया बनाता है, यह बच्चा प्रक्रिया एक नया प्रक्रिया आईडी (पीआईडी) लेती है और मूल प्रक्रिया इसकी माता प्रक्रिया बन जाती है और उसके पास कुछ नामक एक माता प्रक्रिया आईडी <b>PPID</b> होती है। इसके बाद, बच्चा प्रक्रिया या तो अपने माता द्वारा पहले उपयोग किए जाने वाले प्रोग्राम का उपयोग कर सकती है या अधिकतर नए प्रोग्राम को लॉन्च करने के लिए execve सिस्टम कॉल का उपयोग कर सकती है। यह सिस्टम कॉल उस प्रक्रिया के लिए मेमोरी प्रबंधन को नष्ट कर देता है जिसे कर्नेल ने उस प्रोग्राम के लिए रखा था और नए प्रोग्राम के लिए नए प्रबंधन को सेट करता है।\n\nहम इसे कार्रवाई में देख सकते हैं:\n\n<pre>$ ps l</pre>\n\nएल विकल्प हमें हमारी चल रही प्रक्रियाओं का \"लॉन्ग फॉर्मेट\" या और अधिक विस्तृत दृश्य देता है। आपको एक स्तंभ दिखाई देगा जिसे <b>PPID</b> लेबल किया गया है, यह माता पहचान है। अब अपने टर्मिनल पर देखें, आपको एक प्रक्रिया दिखाई देगी जो आपका शैल चल रही है, इसलिए मेरे सिस्टम पर मेरे पास एक प्रक्रिया है जो बैश चल रही है। अब जब आपने ps l कमांड चलाई थी, तो आप उस प्रक्रिया से चल रहे थे जो बैश चल रही थी। अब आप देखेंगे कि बैश शैल का <b>PID</b> ps l कमांड का <b>PPID</b> है।\n\nतो यदि प्रत्येक प्रक्रिया को माता होना चाहिए और वे एक-दूसरे के क्लोन हैं, तो सभी प्रक्रियाओं की मां होनी चाहिए, ना? आप सही हैं, जब सिस्टम बूट होता है, कर्नेल <b>init</b> नामक एक प्रक्रिया बनाता है, इसका पीआईडी 1 होता है। इनिट प्रक्रिया को सिस्टम बंद नहीं किया जा सकता है जब तक सिस्टम बंद नहीं होता। यह रूट विशेषाधिकारों के साथ चलती है और उस प्रक्रियाओं को चलाती है जो सिस्टम को चलाए रखती हैं। हम इनिट पर एक नज़र डालेंगे सिस्टम बूटअप पाठ्यक्रम में, अब केवल यह जानिए कि यह वह प्रक्रिया है जो सभी अन्य प्रक्रियाओं को उत्पन्न करती है।",
  "exercise": "अपनी चल रही प्रक्रियाओं की जाँच करें, क्या आप देख सकते हैं कि अन्य प्रक्रियाओं के माता हैं?",
  "quizQuestion": "कौन सिस्टम कॉल एक नई प्रक्रिया बनाता है?",
  "quizAnswer": "फोर्क",
  "slug": "processcreation"
}