{
  "id": 6,
  "title": "सिग्नल्स",
  "lessonContent": "एक सिग्नल प्रक्रिया को सूचित करता है कि कुछ हो गया है।\n\n<b>हमारे पास सिग्नल्स क्यों हैं</b>\n\nवे सॉफ़्टवेयर अंटरप्ट्स हैं और उनका कई उपयोग हैं:\n\n<ul>\n<li>एक उपयोगकर्ता विशेष टर्मिनल वर्ण (Ctrl-C) या (Ctrl-Z) टाइप कर सकता है ताकि प्रक्रियाओं को मार दिया जा सके, रोका जा सके या विरामित किया जा सके</li>\n<li>हार्डवेयर समस्याएँ हो सकती हैं और कर्नेल प्रक्रिया को सूचित करना चाहता है</li>\n<li>सॉफ़्टवेयर समस्याएँ हो सकती हैं और कर्नेल प्रक्रिया को सूचित करना चाहता है</li>\n<li>वे मुख्य रूप से प्रक्रियाएँ संचार कर सकती हैं</li>\n</ul>\n\n<b>सिग्नल प्रक्रिया</b>\n\nजब कोई घटना द्वारा एक सिग्नल उत्पन्न होता है, तो यह फिर प्रक्रिया को पहुंचाया जाता है, यह एक पेंडिंग स्थिति में माना जाता है जब तक यह पहुंचाया नहीं जाता है। जब प्रक्रिया चलाई जाती है, तो सिग्नल पहुंचाया जाएगा। हालांकि, प्रक्रियाओं के सिग्नल मास्क होते हैं और वे सिग्नल वितरण को निर्दिष्ट करने के लिए अगर निर्दिष्ट किया गया है तो उन्हें अवरोधित कर सकते हैं। जब एक सिग्नल पहुंचाया जाता है, तो प्रक्रिया कई चीजें कर सकती है:\n\n<ul>\n<li>सिग्नल को नजरअंदाज करें</li>\n<li>सिग्नल को \"पकड़ें\" और विशेष हैंडलर रूटीन का पालन करें</li>\n<li>प्रक्रिया को समाप्त किया जा सकता है, सामान्य बाहरी सिस्टम कॉल के विपरीत</li>\n<li>सिग्नल को अवरोधित करें, सिग्नल मास्क के आधार पर</li>\n</ul>\n\n<b>सामान्य सिग्नल्स</b>\n\nप्रत्येक सिग्नल को संकेतिक नामों के साथ पूर्णांकों द्वारा परिभाषित किया गया है जो SIGxxx के रूप में हैं। कुछ सबसे सामान्य सिग्नल्स में से कुछ हैं:\n\n<ul>\n<li>SIGHUP या HUP या 1: हैंगअप</li>\n<li>SIGINT या INT या 2: अंतर्रुप्त</li>\n<li>SIGKILL या KILL या 9: मारें</li>\n<li>SIGSEGV या SEGV या 11: सेगमेंटेशन फॉल्ट</li>\n<li>SIGTERM या TERM या 15: सॉफ़्टवेयर समाप्ति</li>\n<li>SIGSTOP या STOP: रोकें</li>\n</ul>\n\nसंख्याएँ सिग्नल्स के साथ भिन्न हो सकती हैं इसलिए वे आमतौर पर अपने नामों द्वारा संदर्भित किए जाते हैं।\n\nकुछ सिग्नल अवरोधनीय होते हैं, उनमें से एक उदाहरण है SIGKILL सिग्नल। किल सिग्नल प्रक्रिया को नष्ट कर देता है।",
  "exercise": "इस पाठ के लिए कोई अभ्यास नहीं है।",
  "quizQuestion": "कौन सा सिग्नल अवरोधनीय है?",
  "quizAnswer": "SIGKILL",
  "slug": "प्रक्रियासिग्नल्स"
}