{
  "id": 1,
  "title": "Interfaces Réseau",
  "lessonContent": "Une interface réseau est comment le noyau relie le côté logiciel du réseau au côté matériel. Nous avons déjà vu un exemple de ceci : \n\n<pre>\npete@icebox:~$ ifconfig -a\neth0      Link encap:Ethernet  HWaddr 1d:3a:32:24:4d:ce  \n          inet addr:192.168.1.129  Bcast:192.168.1.255  Mask:255.255.255.0\n          inet6 addr: fd60::21c:29ff:fe63:5cdc/64 Scope:Link\n</pre>\n\n<b> La commande ifconfig</b>\n\nL'outil <b>ifconfig</b> nous permet de configurer nos interfaces réseau. Si nous n'avons pas d'interfaces réseau configurées, les pilotes de périphériques du noyau et le réseau ne sauront pas comment communiquer entre eux. Ifconfig s'exécute au démarrage et configure nos interfaces via des fichiers de configuration, mais nous pouvons également les modifier manuellement. La sortie de ifconfig montre le nom de l'interface du côté gauche et le côté droit affiche des informations détaillées. Vous verrez le plus souvent des interfaces nommées eth0 (première carte Ethernet de la machine), wlan0 (interface sans fil), lo (interface de bouclage). L'interface de bouclage est utilisée pour représenter votre ordinateur, elle vous renvoie simplement à vous-même. C'est utile pour le débogage ou pour se connecter à des serveurs en local. \n\nL'état des interfaces peut être actif ou inactif, comme vous pouvez le deviner si vous voulez \"désactiver\" une interface, vous pouvez la mettre en bas. Les champs sur lesquels vous regarderez probablement le plus dans la sortie de ifconfig sont HWaddr (adresse MAC de l'interface), adresse inet (adresse IPv4) et inet6 (adresse IPv6). Bien sûr, vous pouvez voir que le masque de sous-réseau et l'adresse de diffusion sont également là. Vous pouvez également consulter les informations sur les interfaces dans /etc/network/interfaces.\n\n<b>Pour créer une interface et l'activer</b>\n\n<pre>$ ifconfig eth0 192.168.2.1 netmask 255.255.255.0 up</pre>\n\nCela attribue une adresse IP et un masque de réseau à l'interface eth0 et l'active également.\n\n<b>Pour activer ou désactiver une interface</b>\n\n<pre>\n$ ifup eth0\n$ ifdown eth0\n</pre>\n\n<b> La commande ip </b>\n\nLa commande <b>ip</b> nous permet également de manipuler la pile réseau d'un système. Selon la distribution que vous utilisez, il peut s'agir de la méthode préférée pour manipuler vos paramètres réseau. \n\nVoici quelques exemples de son utilisation :\n\n<b>Pour afficher les informations d'interface pour toutes les interfaces </b>\n<pre>\n$ ip link show\n</pre>\n\n<b>Pour afficher les statistiques d'une interface</b>\n<pre>\n$ ip -s link show eth0\n</pre>\n\n\n<b>Pour afficher les adresses IP attribuées aux interfaces</b>\n<pre>\n$ ip address show\n</pre>\n\n<b>Pour activer ou désactiver des interfaces</b>\n<pre>\n$ ip link set eth0 up\n$ ip link set eth0 down\n</pre>\n\n<b>Pour ajouter une adresse IP à une interface</b>\n<pre>\n$ ip address add 192.168.1.1/24 dev eth0\n</pre>",
  "exercise": "Essayez de changer l'état de vos interfaces réseau en actif ou inactif et observez ce qui se passe.\n\nPouvez-vous changer l'état de vos interfaces réseau avec les commandes ifconfig et ip ?",
  "quizQuestion": "Quelle est la commande pour configurer nos interfaces réseau ?",
  "quizAnswer": "ifconfig",
  "slug": "interfacesreseau"
}