{
  "id": 2,
  "title": "Composants DNS",
  "lessonContent": "La base de données DNS d'Internet repose sur des sites et des organisations fournissant une partie de cette base de données. Pour ce faire, ils ont besoin de :\n\n<b>Serveur de noms</b>\n\nNous configurons le DNS via des \"serveurs de noms\", les serveurs de noms chargent nos paramètres DNS et configurations et répondent aux questions des clients ou d'autres serveurs qui veulent savoir des choses comme \"Qui est google.com?\". Si le serveur de noms ne connaît pas la réponse à cette requête, il redirigera la demande vers d'autres serveurs de noms. Les serveurs de noms peuvent être \"autoritaires\", ce qui signifie qu'ils détiennent les enregistrements DNS réels que vous recherchez, ou \"récursifs\", ce qui signifie qu'ils poseraient des questions à d'autres serveurs et que ces serveurs poseraient des questions à d'autres serveurs jusqu'à ce qu'ils trouvent un serveur autoritaire contenant les enregistrements DNS. Les serveurs récursifs peuvent également avoir les informations que nous voulons mises en cache au lieu d'atteindre un serveur autoritaire.\n\n<b>Fichier de zone</b>\n\nÀ l'intérieur d'un serveur de noms se trouve quelque chose appelé fichiers de zone. Les fichiers de zone sont la façon dont le serveur de noms stocke des informations sur le domaine ou comment accéder au domaine s'il ne le sait pas.\n\n<b>Enregistrements de ressources</b>\n\nUn fichier de zone est composé d'entrées d'enregistrements de ressources. Chaque ligne est un enregistrement et contient des informations sur les hôtes, les serveurs de noms, d'autres ressources, etc. Les champs se composent de ce qui suit :\n\n<ul>\n<li>Nom de l'enregistrement</li>\n<li>TTL - Le temps après lequel nous jetons l'enregistrement et en obtenons un nouveau, en DNS, le TTL est indiqué par le temps, donc les enregistrements pourraient avoir un TTL d'une heure. La raison pour laquelle nous faisons cela est que l'Internet change constamment, une minute un hôte peut être associé à une adresse IP X puis la suivante à une adresse IP Y</li>\n<li>Classe - Espace de noms des informations d'enregistrement, le plus couramment utilisé est IN pour Internet</li>\n<li>Type - Type d'informations stockées dans les données d'enregistrement. Nous n'entrerons pas dans les types d'enregistrements, mais vous avez probablement vu des types courants comme A pour adresse, MX pour échangeur de courrier, etc.</li>\n<li>Données - Ce champ peut contenir une adresse IP s'il s'agit d'un enregistrement A ou autre chose en fonction du type d'enregistrement.</li>\n</ul>\n<pre>\npatty    IN  A      192.168.0.4 \n</pre>",
  "exercise": "Aucun exercice pour cette leçon.",
  "quizQuestion": "Quel type d'enregistrement de ressources est utilisé pour les échangeurs de courrier?",
  "quizAnswer": "MX",
  "slug": "composantsdns"
}