{
  "id": 3,
  "title": "Processus DNS",
  "lessonContent": "Voyons un exemple de la façon dont votre hôte trouve un domaine (catzontheinterwebz.com) avec le DNS. Essentiellement, nous descendons jusqu'à atteindre le serveur DNS qui connaît ce domaine.\n\n<b>Serveur DNS Local</b>\n\nTout d'abord, notre hôte demande : \"Où se trouve catzontheinterwebz.com ?\", notre serveur DNS local ne sait pas, il remonte donc jusqu'au sommet de l'entonnoir pour interroger les serveurs racines. Gardez à l'esprit que notre hôte ne fait pas ces demandes pour trouver directement catzontheinterwebz.com, la plupart des utilisateurs parlent à un serveur DNS récursif fourni par leur FAI et ce serveur est ensuite chargé de trouver l'emplacement de catzontheinterwebz.com.\n\n<b>Serveurs Racines</b>\n\nIl y a 13 serveurs racines pour Internet, ils sont dupliqués et répartis dans le monde entier pour gérer les demandes DNS pour Internet, il y a donc vraiment des centaines de serveurs qui travaillent, ils sont contrôlés par différentes organisations et contiennent des informations sur les domaines de premier niveau. Les domaines de premier niveau sont ce que vous connaissez sous les adresses .org, .com, .net, etc. Donc, le serveur racine ne sait pas où se trouve catzontheinterwebz.com, il nous dit donc de demander au serveur DNS du domaine de premier niveau .com à une adresse IP qu'il nous donne. \n\n<b>Domaine de Premier Niveau</b>\n\nNous envoyons maintenant une autre demande au serveur de noms qui connaît les adresses \".com\" et lui demandons s'il sait où se trouve catzontheinterwebz.com ? Le domaine de premier niveau n'a pas catzontheinterwebz.com dans ses fichiers de zone, mais il voit un enregistrement pour le serveur de noms de catzontheinterwebz.com. Il nous donne donc l'adresse IP de ce serveur de noms et nous dit de regarder là-bas.\n\n<b>Serveur DNS Autoritaire</b>\n\nNous envoyons maintenant une demande finale au serveur DNS qui possède réellement l'enregistrement que nous voulons. Le serveur de noms voit qu'il a un fichier de zone pour catzontheinterwebz.com et qu'il y a un enregistrement de ressource pour 'www' pour cet hôte. Il nous donne ensuite l'adresse IP de cet hôte et nous pouvons enfin voir des chats sur Internet.",
  "exercise": "Aucun exercice pour cette leçon.",
  "quizQuestion": "Quelle est l'abréviation des serveurs de noms où l'on trouve les adresses .com, .net, .org, etc. ?",
  "quizAnswer": "DPN",
  "slug": "processus-dns"
}