{
  "id": 4,
  "title": "/etc/hosts",
  "lessonContent": "<p>Avant que notre machine ne fasse réellement appel au DNS pour effectuer une requête, elle regarde d'abord localement sur nos machines. </p><br><p><b>/etc/hosts</b></p><p>Le fichier /etc/hosts contient des mappings de certains noms d'hôtes vers des adresses IP. Les champs sont assez explicites, il y en a un pour l'adresse IP, le nom d'hôte, puis tout alias pour l'hôte. </p><pre>pete@icebox:~$ cat /etc/hosts<br>127.0.0.1       localhost<br>127.0.1.1       icebox</pre><p>Vous verrez généralement votre adresse localhost répertoriée par défaut dans ce fichier. Vous pouvez également gérer l'accès aux hôtes en modifiant les fichiers /etc/hosts.deny ou /etc/hosts.allow. Cependant, si vous êtes soucieux de la sécurité, ce n'est pas vraiment la bonne méthode et vous devriez plutôt modifier vos règles de pare-feu. </p><p>Voyons un exemple amusant de /etc/hosts. Modifiez le fichier et ajoutez une ligne pour :</p><pre>123.45.6.7  www.google.com</pre><p>Enregistrez le fichier et allez maintenant sur www.google.com. Vous rencontrez des problèmes, n'est-ce pas ? Eh bien, c'est parce que nous venons de mapper www.google.com vers une adresse IP complètement erronée. Comme nos hôtes recherchent d'abord localement les mappings d'adresses IP, ils n'atteignent jamais le DNS pour trouver google.com. </p><p><b>/etc/resolv.conf</b></p><p>Traditionnellement, nous avons utilisé un fichier appelé /etc/resolv.conf pour mapper les serveurs de noms DNS afin de réaliser des recherches plus efficaces, cependant, avec les améliorations apportées au DNS, ce fichier est souvent sans importance, en fait, vous pouvez voir dans mon exemple ci-dessous que /etc/resolv.conf n'est pas géré manuellement. Consultez les paramètres spécifiques à votre distribution pour gérer les mappings des serveurs de noms DNS.</p><pre>fichier conf(5) pour le résolveur glibc(3) généré par resolvconf(8)<br>#     NE PAS MODIFIER CE FICHIER MANUELLEMENT -- VOS MODIFICATIONS SERONT ÉCRASÉES<br>serveur de noms 127.0.1.1<br>recherche localdomain</pre>",
  "exercise": "Aucun exercice pour cette leçon.",
  "quizQuestion": "Quel fichier est utilisé pour mapper les noms d'hôtes aux adresses IP sur nos machines ?",
  "quizAnswer": "/etc/hosts",
  "slug": "etchosts"
}