{
  "id": 3,
  "title": "cd (Изменение каталога)",
  "lessonContent": "Теперь, когда вы знаете, где находитесь, давайте посмотрим, можем ли мы немного перемещаться по файловой системе. Помните, что нам нужно будет перемещаться, используя пути. Существуют два различных способа указания пути: абсолютный и относительный пути. \n\n<ul>\n<li>Абсолютный путь: Это путь от корневого каталога. Корень - это главный. Корневой каталог обычно обозначается как косая черта. Каждый раз, когда ваш путь начинается с /, это означает, что вы начинаете с корневого каталога. Например, /home/pete/Desktop.</li>\n\n<li>Относительный путь: Это путь от вашего текущего местоположения в файловой системе. Если я нахожусь в месте /home/pete/Documents и хочу перейти в каталог внутри Documents с именем taxes, мне не нужно указывать весь путь от корня, как /home/pete/Documents/taxes, я могу просто перейти в taxes/.</li>\n</ul>\n\nТеперь, когда вы знаете, как работают пути, нам просто нужно что-то, чтобы помочь нам перейти в нужный каталог. К счастью, у нас есть cd или «change directory» для этого. \n\n<pre>$ cd /home/pete/Pictures</pre> \n\nТеперь я изменил местоположение моего каталога на /home/pete/Pictures.\n\nТеперь в этом каталоге у меня есть папка с именем Hawaii, я могу перейти в эту папку с помощью:\n\n<pre>$ cd Hawaii</pre>\n\nЗаметьте, как я просто использовал имя папки? Это потому, что я уже находился в /home/pete/Pictures.\n\nМожет быть довольно утомительно постоянно перемещаться с помощью абсолютных и относительных путей, к счастью, есть несколько ярлыков, которые могут вам помочь. \n\n<ul>\n<li>. (текущий каталог). Это каталог, в котором вы находитесь в данный момент. </li>\n<li>.. (предыдущий каталог). Переносит вас в каталог выше вашего текущего.</li>\n<li>~ (домашний каталог). Этот каталог по умолчанию является вашим «домашним каталогом». Например, /home/pete.</li>\n<li>- (предыдущий каталог). Это перенесет вас в предыдущий каталог, в котором вы только что находились.</li>\n</ul>\n\n<pre>$ cd .\n$ cd ..\n$ cd ~\n$ cd -\n</pre>\nПопробуйте их!",
  "exercise": "<ol>\n<li>Запустите команду cd без флагов, куда вы попадете?</li>\n</ol>",
  "quizQuestion": "Если вы находитесь в /home/pete/Pictures и хотите перейти в /home/pete, какой хороший ярлык использовать?",
  "quizAnswer": "cd ..",
  "slug": "changedirectorycdcommand"
}