{
  "id": 10,
  "title": "cp (Копирование)",
  "lessonContent": "Давайте начнем делать копии этих файлов. Подобно копированию и вставке файлов в других операционных системах, оболочка предоставляет нам еще более простой способ сделать это. \n\n<pre>$ cp mycoolfile /home/pete/Documents/cooldocs</pre>\n\nmycoolfile - это файл, который вы хотите скопировать, а /home/pete/Documents/cooldocs - это место, куда вы копируете файл.\n\nВы также можете копировать несколько файлов и каталогов, а также использовать шаблоны. Шаблон - это символ, который может быть заменен на выборочное совпадение, что дает вам большую гибкость при поиске. Вы можете использовать шаблоны в каждой команде для большей гибкости.\n\n<ul>\n<li>* самый универсальный шаблон, используется для представления всех отдельных символов или любой строки.</li>\n<li>? используется для представления одного символа</li>\n<li>[] используется для представления любого символа внутри скобок</li>\n</ul>\n\n<pre>$ cp *.jpg /home/pete/Pictures</pre>\n\nЭто скопирует все файлы с расширением .jpg из вашего текущего каталога в каталог Pictures.\n\nПолезной командой является использование флага -r, который рекурсивно скопирует файлы и каталоги внутри каталога. \n\nПопробуйте выполнить cp для каталога, содержащего несколько файлов, в ваш каталог Documents. Не сработало, верно? Это потому, что вам нужно скопировать также файлы и каталоги внутри с помощью команды -r.\n\n<pre>$ cp -r Pumpkin/ /home/pete/Documents</pre>\n\nОдна вещь, которую стоит отметить, если вы копируете файл в каталог с тем же именем файла, файл будет перезаписан тем, что вы копируете. Это не очень хорошо, если у вас есть файл, который вы не хотите случайно перезаписать. Вы можете использовать флаг -i (интерактивный), чтобы запросить подтверждение перед перезаписью файла. \n\n<pre>$ cp -i mycoolfile /home/pete/Pictures</pre>",
  "exercise": "Скопируйте несколько файлов, будьте осторожны, чтобы не перезаписать что-то важное.",
  "quizQuestion": "Какой флаг вам нужно указать, чтобы скопировать каталог?",
  "quizAnswer": "-r",
  "slug": "copycpcommand"
}