{
  "id": 4,
  "title": "ls (Список каталогов)",
  "lessonContent": "Теперь, когда мы знаем, как перемещаться по системе, как мы можем узнать, что доступно нам? Сейчас это похоже на то, что мы движемся в темноте. Хорошо, мы можем использовать замечательную команду ls для отображения содержимого каталога. Команда ls отобразит каталоги и файлы в текущем каталоге по умолчанию, однако вы можете указать путь, для которого хотите увидеть список каталогов.\n\n<pre>$ ls\n$ ls /home/pete</pre>\n\nls - довольно полезный инструмент, он также показывает вам подробную информацию о файлах и каталогах, которые вы просматриваете.\n\nТакже обратите внимание, что не все файлы в каталоге будут видны. Имена файлов, начинающиеся с точки, скрыты, однако вы можете их просмотреть с помощью команды ls и передать флаг -a (a для всех).\n\n<pre>$ ls -a</pre>\n\nЕсть еще один полезный флаг ls, -l для long, который показывает подробный список файлов в длинном формате. Это покажет вам подробную информацию, начиная слева: разрешения файла, количество ссылок, имя владельца, группа владельца, размер файла, временная метка последней модификации и имя файла/каталога.\n\n<pre>$ ls -l</pre>\n\n<pre>pete@icebox:~$ ls -l\ntotal 80\ndrwxr-x--- 7 pete penguingroup   4096 Nov 20 16:37 Desktop\ndrwxr-x--- 2 pete penguingroup   4096 Oct 19 10:46  Documents\ndrwxr-x--- 4 pete penguingroup   4096 Nov 20 09:30 Downloads\ndrwxr-x--- 2 pete penguingroup   4096 Oct  7 13:13   Music\ndrwxr-x--- 2 pete penguingroup   4096 Sep 21 14:02 Pictures\ndrwxr-x--- 2 pete penguingroup   4096 Jul 27 12:41   Public\ndrwxr-x--- 2 pete penguingroup   4096 Jul 27 12:41   Templates\ndrwxr-x--- 2 pete penguingroup   4096 Jul 27 12:41   Videos</pre>\n\nУ команд есть так называемые флаги (или аргументы или опции, как вы хотите их назвать), чтобы добавить больше функциональности. Заметьте, как мы добавили -a и -l, так вот, вы можете добавить их вместе с -la. Порядок флагов определяет их последовательность, большую часть времени это не имеет значения, поэтому вы также можете использовать ls -al и это все равно будет работать.\n\n<pre>$ ls -la</pre>",
  "exercise": "Запустите ls с различными флагами и посмотрите результат, который вы получите.",
  "quizQuestion": "Какую команду вы использовали бы для просмотра скрытых файлов?",
  "quizAnswer": "ls -a",
  "slug": "listdirectorieslscommand"
}