{
  "id": 4,
  "title": "Surveillance du processeur",
  "lessonContent": "Passons en revue une commande utile, <b>uptime</b>.\n\n<pre>\npete@icebox:~$ uptime\n 17:23:35 en marche depuis 1 jour,  5:59,  2 utilisateurs,  charge moyenne: 0.00, 0.02, 0.05\n</pre>\n\nNous avons parlé de l'uptime dans la première leçon de ce cours, mais nous n'avons pas abordé le champ de la charge moyenne. Les moyennes de charge sont un bon moyen de voir la charge CPU sur votre système. Ces chiffres représentent la charge CPU moyenne dans des intervalles de 1, 5 et 15 minutes. Que signifie la charge CPU, la charge CPU est le nombre moyen de processus qui attendent d'être exécutés par le CPU.\n\nDisons que vous avez un CPU monocœur, pensez à ce cœur comme une seule voie de circulation. S'il y a des embouteillages sur l'autoroute, cette voie sera très fréquentée et la circulation sera à 100% ou une charge de 1. Maintenant, la circulation est devenue si mauvaise qu'elle bloque l'autoroute et rend les routes normales deux fois plus fréquentées par les voitures, nous pouvons dire que votre charge est de 200% ou une charge de 2. Maintenant, disons que cela se dégage un peu et qu'il y a seulement la moitié des voitures sur la voie rapide, nous pouvons dire que la charge de la voie est de 0.5. Lorsque la circulation est inexistante et que nous pouvons rentrer chez nous plus rapidement, la charge devrait idéalement être très faible, comme à 2h du matin. Les voitures dans ce cas sont des processus et ces processus attendent simplement de sortir de l'autoroute et de rentrer chez eux.\n\nMaintenant, juste parce que vous avez une charge moyenne de 1 ne signifie pas que votre ordinateur rame. La plupart des machines modernes de nos jours ont plusieurs cœurs. Si vous aviez un processeur quadricœur (4 cœurs) et que votre charge moyenne est de 1, cela affecte vraiment seulement 25% de votre CPU. Pensez à chaque cœur comme une voie de circulation. Vous pouvez voir le nombre de cœurs que vous avez sur votre système avec <b>cat /proc/cpuinfo</b>.\n\nLors de l'observation de la charge moyenne, vous devez tenir compte du nombre de cœurs, si vous constatez que votre machine utilise toujours une charge supérieure à la moyenne, il pourrait y avoir un problème en cours.",
  "exercise": "Vérifiez la charge moyenne de votre système et voyez ce qu'elle fait.",
  "quizQuestion": "Quelle commande pouvez-vous utiliser pour voir la charge moyenne?",
  "quizAnswer": "uptime",
  "slug": "surveillanceduprocesseur"
}