{
  "id": 5,
  "title": "Surveillance E/S",
  "lessonContent": "Nous pouvons également surveiller l'utilisation du processeur ainsi que surveiller l'utilisation du disque avec un outil pratique connu sous le nom de <b>iostat</b>\n\n<pre>\npete@icebox:~$ iostat\nLinux 3.13.0-39-lowlatency (icebox)     01/28/2016      _i686_  (1 CPU)\n\navg-cpu:  %user   %nice %system %iowait  %steal   %idle\n           0.13    0.03    0.50    0.01    0.00   99.33\n\nDevice:            tps    kB_read/s    kB_wrtn/s    kB_read    kB_wrtn\nsda               0.17         3.49         1.92     385106     212417\n</pre>\n\nLa première partie concerne les informations sur le CPU :\n\n<ul>\n<li>%user - Affiche le pourcentage d'utilisation du CPU qui s'est produit lors de l'exécution au niveau utilisateur (application)</li>\n<li>%nice - Affiche le pourcentage d'utilisation du CPU qui s'est produit lors de l'exécution au niveau utilisateur avec une priorité nice. Utilisation du CPU utilisateur avec des priorités nice</li>\n<li>%system - Affiche le pourcentage d'utilisation du CPU qui s'est produit lors de l'exécution au niveau système (noyau).</li>\n<li>%iowait - Affiche le pourcentage de temps pendant lequel le CPU ou les CPU étaient inactifs alors que le système avait une demande d'E/S disque en attente.</li>\n<li>%steal - Affiche le pourcentage de temps passé en attente involontaire par le CPU ou les CPU virtuels pendant que l'hyperviseur servait un autre processeur virtuel.</li>\n<li>%idle - Affiche le pourcentage de temps pendant lequel le CPU ou les CPU étaient inactifs et le système n'avait pas de demande d'E/S disque en attente.</li>\n</ul>\n\nLa deuxième partie concerne l'utilisation du disque :\n\n<ul>\n<li>tps - Indique le nombre de transferts par seconde qui ont été émis vers le périphérique. Un transfert est une demande d'E/S au périphérique. De multiples demandes logiques peuvent être combinées en une seule demande d'E/S au périphérique. Un transfert est de taille indéterminée.</li>\n<li>kB_read/s - Indique la quantité de données lues à partir du périphérique exprimée en kilooctets par seconde.</li>\n<li>kB_wrtn/s - Indique la quantité de données écrites sur le périphérique exprimée en kilooctets par seconde.</li>\n<li>kB_read - Le nombre total de kilooctets lus.</li>\n<li>kB_wrtn - Le nombre total de kilooctets écrits.</li>\n</ul>",
  "exercise": "Utilisez iostat pour afficher l'utilisation de votre disque.",
  "quizQuestion": "Quelle commande peut être utilisée pour afficher l'utilisation de l'E/S et du CPU?",
  "quizAnswer": "iostat",
  "slug": "iomonitoring"
}