{
  "id": 2,
  "title": "lsof et fuser",
  "lessonContent": "Imaginons que vous ayez branché une clé USB et commencé à travailler sur des fichiers. Une fois que vous avez terminé, vous démontez le périphérique USB et vous obtenez une erreur \"Périphérique ou ressource occupé\". Comment trouver quels fichiers de la clé USB sont encore en cours d'utilisation ? Il existe en fait deux outils que vous pouvez utiliser pour cela : \n\n<b>lsof</b>\n\nRappelez-vous que les fichiers ne sont pas seulement des fichiers texte, des images, etc., ce sont toutes les ressources du système, disques, tubes, sockets réseau, périphériques, etc. Pour voir ce qui est utilisé par un processus, vous pouvez utiliser la commande lsof (abrégé de \"list open files\"), cela vous montrera une liste de tous les fichiers ouverts et leur processus associé. \n\n<pre>\npete@icebox:~$ lsof .\nCOMMAND    PID  USER   FD   TYPE DEVICE SIZE/OFF NODE NAME\nlxsession 1491 pete  cwd    DIR    8,6     4096  131 .\nupdate-no 1796 pete  cwd    DIR    8,6     4096  131 .\nnm-applet 1804 pete  cwd    DIR    8,6     4096  131 .\nindicator 1809 pete  cwd    DIR    8,6     4096  131 .\nxterm     2205 pete  cwd    DIR    8,6     4096  131 .\nbash      2207 pete  cwd    DIR    8,6     4096  131 .\nlsof      5914 pete  cwd    DIR    8,6     4096  131 .\nlsof      5915 pete  cwd    DIR    8,6     4096  131 .\n</pre>\n\nMaintenant je peux voir quels processus détiennent actuellement le fichier/périphérique ouvert. Dans notre exemple de clé USB, vous pouvez également arrêter ces processus pour pouvoir démonter ce fichu lecteur.\n\n<b>fuser</b>\n\nUne autre façon de suivre un processus est la commande fuser (abrégé de \"file user\"), cela vous montrera des informations sur le processus qui utilise le fichier ou l'utilisateur du fichier. \n\n<pre>\npete@icebox:~$ fuser -v .\n                     USER        PID ACCESS COMMAND\n/home/pete:         pete  1491 ..c.. lxsession\n                     pete  1796 ..c.. update-notifier\n                     pete  1804 ..c.. nm-applet\n                     pete  1809 ..c.. indicator-power\n                     pete  2205 ..c.. xterm\n                     pete  2207 ..c.. bash\n</pre>\n\nNous pouvons voir quels processus utilisent actuellement notre répertoire /home/pete. Les outils lsof et fuser sont très similaires, familiarisez-vous avec ces outils et essayez de les utiliser la prochaine fois que vous avez besoin de suivre un fichier ou un processus.",
  "exercise": "Lisez les pages de manuel de lsof et fuser, il y a beaucoup d'informations que nous n'avons pas couvertes qui vous permettent d'avoir une plus grande flexibilité avec ces outils.",
  "quizQuestion": "Quelle commande est utilisée pour lister les fichiers ouverts et leurs informations de processus ?",
  "quizAnswer": "lsof",
  "slug": "suiviprocessuslsoffuser"
}