{
  "id": 1,
  "title": "Suivi des processus : top",
  "lessonContent": "Dans ce cours, nous verrons comment lire et analyser l'utilisation des ressources sur votre système, cette leçon présente quelques excellents outils à utiliser lorsque vous avez besoin de suivre ce qu'un processus fait. \n\n<b>top</b>\n\nNous avons déjà discuté de top, mais nous allons approfondir les spécificités de ce qu'il affiche réellement. Rappelez-vous que top est l'outil que nous avons utilisé pour obtenir une vue en temps réel de l'utilisation du système par nos processus :\n\n<pre>\ntop - 18:06:26 up 6 jours,  4:07,  2 utilisateurs,  charge moyenne : 0.92, 0.62, 0.59\nTâches : 389 au total,   1 en cours d'exécution, 387 en attente,   0 arrêtées,   1 zombie\n%Cpu(s) :  1.8 us,  0.4 sy,  0.0 ni, 97.6 id,  0.1 wa,  0.0 hi,  0.0 si,  0.0 st\nKiB Mem :  32870888 au total, 27467976 utilisés,  5402912 libres,   518808 tampons\nKiB Swap : 33480700 au total,    39892 utilisés, 33440808 libres. 19454152 mémoire cache\n\n  PID UTILISATEUR      PR  NI    VIRT    RES    SHR S  %CPU %MEM     TIME+ COMMANDE                             \n 6675 patty    20   0 1731472 520960  30876 S   8.3  1.6 160:24.79 chrome                             \n 6926 patty    20   0  935888 163456  25576 S   4.3  0.5   5:28.13 chrome \n</pre>\n\nPassons en revue ce que signifie cette sortie, vous n'avez pas à mémoriser cela, mais revenez-y quand vous avez besoin d'une référence.\n\n<b>1ère ligne : Il s'agit des mêmes informations que vous verriez si vous exécutiez la commande uptime (à suivre)</b>\n\nLes champs sont de gauche à droite :\n<ol>\n<li>Heure actuelle</li>\n<li>Depuis combien de temps le système est en marche</li>\n<li>Combien d'utilisateurs sont actuellement connectés</li>\n<li>Charge moyenne du système (à suivre)</li>\n</ol>\n\n<b>2ème ligne : Tâches en cours d'exécution, en attente, arrêtées et zombies</b>\n\n<b>3ème ligne : Informations sur le CPU</b>\n\n<ol>\n<li>us : temps CPU utilisateur - Pourcentage de temps CPU passé à exécuter des processus utilisateurs non renicés.</li>\n<li>sy : temps CPU système - Pourcentage de temps CPU passé à exécuter le noyau et les processus du noyau</li>\n<li>ni : temps CPU agréable - Pourcentage de temps CPU passé à exécuter des processus renicés</li>\n<li>id : temps CPU inactif - Pourcentage de temps CPU passé inactif</li>\n<li>wa : attente E/S - Pourcentage de temps CPU passé en attente d'E/S. Si cette valeur est faible, le problème n'est probablement pas lié à l'E/S disque ou réseau</li> \n<li>hi : interruptions matérielles - Pourcentage de temps CPU passé à servir des interruptions matérielles</li>\n<li>si : interruptions logicielles - Pourcentage de temps CPU passé à servir des interruptions logicielles</li>\n<li>st : temps volé - Si vous exécutez des machines virtuelles, c'est le pourcentage de temps CPU qui vous a été volé pour d'autres tâches</li>\n</ol>\n\n<b>4ème et 5ème ligne : Utilisation de la mémoire et de l'échange</b>\n\n<b>Liste des processus actuellement en cours d'utilisation</b>\n\n<ol>\n<li>PID : Identifiant du processus</li>\n<li>UTILISATEUR : utilisateur propriétaire du processus</li>\n<li>PR : Priorité du processus</li>\n<li>NI : La valeur agréable</li>\n<li>VIRT : Mémoire virtuelle utilisée par le processus</li>\n<li>RES : Mémoire physique utilisée par le processus</li>\n<li>SHR : Mémoire partagée du processus</li>\n<li>S : Indique l'état du processus : S=sommeil, R=exécution, Z=zombie, D=non interruptible, T=arrêté</li>\n<li>%CPU - c'est le pourcentage de CPU utilisé par ce processus</li>\n<li>%MEM - pourcentage de RAM utilisé par ce processus</li>\n<li>TIME+ - temps total d'activité de ce processus</li>\n<li>COMMANDE - nom du processus</li>\n</ol>\n\nVous pouvez également spécifier un ID de processus si vous voulez simplement suivre certains processus :\n\n<pre>$ top -p 1</pre>",
  "exercise": "Jouez avec la commande top et voyez quels processus utilisent le plus de ressources.",
  "quizQuestion": "Quelle commande affiche la même sortie que la première ligne dans top?",
  "quizAnswer": "uptime",
  "slug": "suividesprocessustop"
}