{
  "id": 2,
  "title": "Componentes de DNS",
  "lessonContent": "La base de datos de DNS de Internet depende de sitios y organizaciones que proporcionan parte de esa base de datos. Para hacer eso, necesitan:\n\n<b>Servidor de nombres</b>\n\nConfiguramos DNS a través de \"servidores de nombres\", los servidores de nombres cargan nuestra configuración de DNS y responden a cualquier pregunta de clientes u otros servidores que quieran saber cosas como \"¿Quién es google.com?\". Si el servidor de nombres no conoce la respuesta a esa consulta, redirigirá la solicitud a otros servidores de nombres. Los servidores de nombres pueden ser \"autoritativos\", lo que significa que contienen los registros de DNS reales que estás buscando, o \"recursivos\", lo que significa que preguntarían a otros servidores y esos servidores preguntarían a otros servidores hasta encontrar un servidor autoritativo que contenga los registros de DNS. Los servidores recursivos también pueden tener la información que queremos en caché en lugar de llegar a un servidor autoritativo.\n\n<b>Archivo de zona</b>\n\nDentro de un servidor de nombres vive algo llamado archivos de zona. Los archivos de zona son cómo el servidor de nombres almacena información sobre el dominio o cómo llegar al dominio si no lo sabe.\n\n<b>Registros de recursos</b>\n\nUn archivo de zona está compuesto por entradas de registros de recursos. Cada línea es un registro y contiene información sobre hosts, servidores de nombres, otros recursos, etc. Los campos consisten en lo siguiente:\n\n<ul>\n<li>Nombre del registro</li>\n<li>TTL - El tiempo después del cual descartamos el registro y obtenemos uno nuevo, en DNS TTL se indica por tiempo, por lo que los registros podrían tener un TTL de una hora. La razón por la que hacemos esto es porque Internet está cambiando constantemente, un minuto un host puede estar mapeado a la dirección IP X y luego puede estar en la dirección IP Y</li>\n<li>Clase - Espacio de nombres de la información del registro, comúnmente se usa IN para Internet</li>\n<li>Tipo - Tipo de información almacenada en los datos del registro. No entraremos en los tipos de registros, pero probablemente hayas visto comunes como A para dirección, MX o intercambiador de correo, etc.</li>\n<li>Datos - Este campo puede contener una dirección IP si es un registro A o algo más dependiendo del tipo de registro.</li>\n</ul>\n<pre>\npatty    IN  A      192.168.0.4 \n</pre>",
  "exercise": "No hay ejercicios para esta lección.",
  "quizQuestion": "¿Qué tipo de registro de recurso se utiliza para los intercambiadores de correo?",
  "quizAnswer": "MX",
  "slug": "componentes-dns"
}