{
  "id": 3,
  "title": "Proceso DNS",
  "lessonContent": "Veamos un ejemplo de cómo tu host encuentra un dominio (catzontheinterwebz.com) con DNS. Básicamente, nos abrimos paso hasta llegar al servidor DNS que conoce ese dominio.\n\n<b>Servidor DNS Local</b>\n\nPrimero, nuestro host pregunta: \"¿Dónde está catzontheinterwebz.com?\". Nuestro servidor DNS local no lo sabe, así que comienza desde la parte superior del embudo para preguntar a los Servidores Raíz. Ten en cuenta que nuestro host no está haciendo estas solicitudes para encontrar catzontheinterwebz.com directamente, la mayoría de los usuarios hablan con un servidor DNS recursivo proporcionado por sus proveedores de servicios de Internet y ese servidor es el encargado de encontrar la ubicación de catzontheinterwebz.com.\n\n<b>Servidores Raíz</b>\n\nHay 13 Servidores Raíz para Internet, están duplicados y distribuidos en todo el mundo para manejar las solicitudes DNS de Internet, por lo que realmente hay cientos de servidores que están trabajando, son controlados por diferentes organizaciones y contienen información sobre Dominios de Nivel Superior. Los dominios de nivel superior son lo que conoces como direcciones .org, .com, .net, etc. Entonces, el Servidor Raíz no sabe dónde está catzontheinterwebz.com, así que nos dice que preguntemos al Servidor DNS de Dominio de Nivel Superior .com en una dirección IP que nos da.\n\n<b>Dominio de Nivel Superior</b>\n\nAhora enviamos otra solicitud al servidor de nombres que conoce las direcciones \".com\" y preguntamos si sabe dónde está catzontheinterwebz.com. El TLD no tiene catzontheinterwebz.com en sus archivos de zona, pero ve un registro para el servidor de nombres de catzontheinterwebz.com. Entonces nos da la dirección IP de ese servidor de nombres y nos dice que busquemos allí.\n\n<b>Servidor DNS Autorizado</b>\n\nAhora enviamos una solicitud final al servidor DNS que realmente tiene el registro que queremos. El servidor de nombres ve que tiene un archivo de zona para catzontheinterwebz.com y hay un registro de recursos para 'www' para este host. Luego nos da la dirección IP de este host y finalmente podemos ver algunos gatos en Internet.",
  "exercise": "No hay ejercicios para esta lección.",
  "quizQuestion": "¿Cuál es la abreviatura para los servidores de nombres donde se encuentran las direcciones .com, .net, .org, etc?",
  "quizAnswer": "TLD",
  "slug": "dnsprocess"
}