{
  "id": 4,
  "title": "/etc/hosts",
  "lessonContent": "<p>Antes de que nuestra máquina realmente acceda al DNS para hacer una consulta, primero busca localmente en nuestras máquinas.</p><br><p><b>/etc/hosts</b></p><p>El archivo /etc/hosts contiene asignaciones de algunos nombres de host a direcciones IP. Los campos son bastante autoexplicativos, hay uno para la dirección IP, el nombre de host y luego cualquier alias para el host.</p><pre>pete@icebox:~$ cat /etc/hosts<br>127.0.0.1       localhost<br>127.0.1.1       icebox</pre><p>Por lo general, verás tu dirección de localhost listada como predeterminada en este archivo. También puedes gestionar el acceso a los hosts modificando los archivos /etc/hosts.deny o /etc/hosts.allow. Sin embargo, si te preocupa la seguridad, este no es realmente el camino a seguir y deberías modificar las reglas de tu firewall en su lugar.</p><p>Vamos a ver un ejemplo divertido de /etc/hosts. Modifica el archivo y agrega una línea para:</p><pre>123.45.6.7  www.google.com</pre><p>Guarda el archivo y ahora ve a www.google.com. ¿Tienes problemas, verdad? Bueno, eso es porque acabamos de asignar www.google.com a una dirección IP completamente incorrecta. Dado que nuestros hosts primero buscan localmente asignaciones de direcciones IP, nunca llega al DNS para encontrar google.com.</p><p><b>/etc/resolv.conf</b></p><p>Tradicionalmente, hemos utilizado un archivo llamado /etc/resolv.conf para mapear servidores de nombres DNS para búsquedas más eficientes, sin embargo, con las mejoras realizadas en DNS este archivo a menudo es irrelevante, de hecho, puedes ver en mi ejemplo a continuación que /etc/resolv.conf no se gestiona manualmente. Consulta la configuración específica de tu distribución para gestionar los mapeos de servidores de nombres DNS.</p><pre>conf(5) file for glibc resolver(3) generated by resolvconf(8)<br>#     NO EDITE ESTE ARCHIVO MANUALMENTE -- SUS CAMBIOS SERÁN SOBREESCRITOS<br>nameserver 127.0.1.1<br>search localdomain</pre>",
  "exercise": "No hay ejercicios para esta lección.",
  "quizQuestion": "¿Qué archivo se utiliza para mapear nombres de host a direcciones IP en nuestras máquinas?",
  "quizAnswer": "/etc/hosts",
  "slug": "etchosts"
}