{
  "id": 3,
  "title": "/etc/passwd",
  "lessonContent": "Lembre-se de que os nomes de usuário não são realmente identificações para usuários. O sistema usa um ID de usuário (UID) para identificar um usuário. Para descobrir quais usuários estão mapeados para qual ID, olhe o arquivo /etc/passwd. \n\n<pre>$ cat /etc/passwd</pre>\n\nEste arquivo mostra uma lista de usuários e informações detalhadas sobre eles. Por exemplo, a primeira linha deste arquivo provavelmente se parece com isto:\n\n<pre>root:x:0:0:root:/root:/bin/bash</pre>\n\nCada linha exibe informações do usuário para um usuário, comumente você verá o usuário root como a primeira linha. Existem muitos campos separados por dois pontos que fornecem informações adicionais sobre o usuário, vamos ver todos eles:\n\n<ol>\n<li>Nome de usuário</li>\n<li>Senha do usuário - a senha não é realmente armazenada neste arquivo, geralmente é armazenada no arquivo /etc/shadow. Discutiremos mais sobre o /etc/shadow na próxima lição, mas por enquanto, saiba que ele contém senhas de usuários criptografadas. Você pode ver muitos símbolos diferentes neste campo, se você ver um \"x\" isso significa que a senha está armazenada no arquivo /etc/shadow, um \"*\" significa que o usuário não tem acesso de login e se houver um campo em branco significa que o usuário não tem senha.</li>\n<li>O ID do usuário - como você pode ver, o root tem o UID 0</li>\n<li>O ID do grupo</li>\n<li>Campo GECOS - Isso é usado para geralmente deixar comentários sobre o usuário ou conta, como seu nome real ou número de telefone, é delimitado por vírgulas.</li>\n<li>Diretório home do usuário</li>\n<li>Shell do usuário - você provavelmente verá muitos usuários usando o bash como shell padrão</li>\n</ol>\n\nNormalmente em uma página de configuração de usuário, você esperaria ver apenas usuários humanos. No entanto, você notará que o /etc/passwd contém outros usuários. Lembre-se de que os usuários estão realmente no sistema apenas para executar processos com permissões diferentes. Às vezes queremos executar processos com permissões pré-determinadas. Por exemplo, o usuário daemon é usado para processos de daemon.\n\nTambém deve-se observar que você pode editar o arquivo /etc/passwd manualmente se quiser adicionar usuários e modificar informações com a ferramenta <b>vipw</b>, no entanto, coisas como essas são melhor deixadas para as ferramentas que discutiremos em uma lição posterior, como useradd e userdel.",
  "exercise": "Olhe para o seu arquivo /etc/passwd, dê uma olhada em alguns dos usuários e observe o acesso que eles têm.",
  "quizQuestion": "Se um usuário não tem acesso de login, como isso é indicado no /etc/passwd?",
  "quizAnswer": "*",
  "slug": "etcpasswdfile"
}