{
  "id": 1,
  "title": "Usuários e Grupos",
  "lessonContent": "Em qualquer sistema operacional tradicional, existem usuários e grupos. Eles existem exclusivamente para acesso e permissões. Ao executar um processo, ele será executado como o proprietário desse processo, seja Jane ou Bob. O acesso e a propriedade de arquivos também dependem de permissões. Você não gostaria que Jane visse os documentos de Bob e vice-versa. \n\nCada usuário tem seu próprio diretório pessoal onde seus arquivos específicos do usuário são armazenados, geralmente localizado em /home/nome_de_usuário, mas pode variar em diferentes distribuições. \n\nO sistema usa identificadores de usuário (UID) para gerenciar usuários, os nomes de usuário são a maneira amigável de associar usuários à identificação, mas o sistema identifica os usuários pelo seu UID. O sistema também usa grupos para gerenciar permissões, grupos são apenas conjuntos de usuários com permissões definidas por esse grupo, eles são identificados pelo sistema com seu identificador de grupo (GID).\n\nNo Linux, você terá usuários além dos humanos normais que usam o sistema. Às vezes, esses usuários são daemons do sistema que executam continuamente processos para manter o sistema funcionando. Um dos usuários mais importantes é o root ou superusuário, o root é o usuário mais poderoso no sistema, o root pode acessar qualquer arquivo e iniciar e encerrar qualquer processo. Por esse motivo, pode ser perigoso operar sempre como root, você poderia potencialmente remover arquivos críticos do sistema. Felizmente, se for necessário o acesso como root e um usuário tiver acesso como root, ele pode executar um comando como root com o comando sudo. O comando sudo (superusuário faça) é usado para executar um comando com acesso de root, iremos aprofundar mais sobre como um usuário recebe acesso de root em uma lição posterior.\n\nVá em frente e tente visualizar um arquivo protegido como /etc/shadow:\n\n<pre>$ cat /etc/shadow</pre>\n\nObserve como você recebe um erro de permissão negada, veja as permissões com: \n\n<pre>$ ls -la /etc/shadow\n\n-rw-r----- 1 root shadow 1134 Dec 1 11:45 /etc/shadow\n</pre>\n\nAinda não passamos pelas permissões, mas o que está acontecendo aqui é que root é o proprietário do arquivo e você precisará de acesso como root ou fazer parte do grupo shadow para ler o conteúdo. Agora execute o comando com sudo:\n\n<pre>$ sudo cat /etc/shadow</pre>\n\nAgora você poderá ver o conteúdo do arquivo!",
  "exercise": "Não há exercícios para esta lição.",
  "quizQuestion": "Qual comando você usa para executar como root?",
  "quizAnswer": "sudo",
  "slug": "usuariosgrupos"
}