{
  "id": 2,
  "title": "Modificando Permissões",
  "lessonContent": "Alterar permissões pode ser facilmente feito com o comando <b>chmod</b>. \n\nPrimeiro, escolha qual conjunto de permissões você deseja alterar, usuário, grupo ou outro. Você pode adicionar ou remover permissões com um <b>+</b> ou <b>-</b>, vamos ver alguns exemplos.\n\n<b>Adicionando bit de permissão em um arquivo</b>\n<pre>$ chmod u+x myfile</pre>\n\nO comando acima é lido da seguinte forma: alterar permissão no myfile adicionando o bit de permissão executável no conjunto de usuário. Agora o usuário tem permissão de execução neste arquivo!\n\n<b>Removendo bit de permissão em um arquivo</b>\n<pre>$ chmod u-x myfile</pre>\n\n<b>Adicionando vários bits de permissão em um arquivo</b>\n<pre>$ chmod ug+w</pre>\n\nHá outra maneira de alterar permissões usando formato numérico. Este método permite que você altere as permissões de uma só vez. Em vez de usar r, w ou x para representar permissões, você usará uma representação numérica para um conjunto de permissões único. Portanto, não é necessário especificar o grupo com g ou o usuário com u.\n\nAs representações numéricas são vistas abaixo:\n\n<ul>\n<li>4: permissão de leitura</li>\n<li>2: permissão de escrita</li>\n<li>1: permissão de execução</li>\n</ul>\n\nVamos ver um exemplo: \n\n<pre>$ chmod 755 myfile</pre>\n\nVocê consegue adivinhar que permissões estamos dando a este arquivo? Vamos analisar isso, então agora 755 cobre as permissões para todos os conjuntos. O primeiro número (7) representa as permissões do usuário, o segundo número (5) representa as permissões do grupo e o último 5 representa as permissões de outros. \n\nEspere um minuto, 7 e 5 não foram listados acima, de onde estamos tirando esses números? Lembre-se de que estamos combinando todas as permissões em um único número agora, então você terá que envolver um pouco de matemática.\n\n7 = 4 + 2 + 1, então 7 são as permissões do usuário e ele tem permissões de leitura, escrita e execução\n\n5 = 4 + 1, o grupo tem permissões de leitura e execução\n\n5 = 4 + 1, e todos os outros usuários têm permissões de leitura e execução\n\nUma coisa a se observar: não é uma boa ideia ficar alterando permissões aleatoriamente, você poderia potencialmente expor um arquivo sensível para que todos modifiquem, no entanto, muitas vezes você quer legitimamente alterar permissões, apenas tome precauções ao usar o comando chmod.",
  "exercise": "Altere algumas permissões básicas de arquivos de texto e veja os bits mudando conforme você faz um ls -l.",
  "quizQuestion": "Que número representa a permissão de leitura ao usar o formato numérico?",
  "quizAnswer": "4",
  "slug": "modificandopermissoes"
}