{
  "id": 5,
  "title": "Setuid",
  "lessonContent": "Existem muitos casos em que usuários normais precisam de acesso elevado para fazer coisas. O administrador do sistema nem sempre pode estar presente para inserir uma senha de root toda vez que um usuário precisar de acesso a um arquivo protegido, então existem bits especiais de permissão de arquivo para permitir esse comportamento. O Set User ID (SUID) permite que um usuário execute um programa como o proprietário do arquivo do programa, em vez de como eles mesmos.\n\nVamos ver um exemplo: \n\nDigamos que eu queira alterar minha senha, simples certo? Basta usar o comando passwd:\n\n<pre>$ passwd</pre>\n\nO que o comando de senha está fazendo? Está modificando alguns arquivos, mas o mais importante é que está modificando o arquivo /etc/shadow. Vamos dar uma olhada nesse arquivo por um segundo: \n\n<pre>$ ls -l /etc/shadow\n\n-rw-r----- 1 root shadow 1134 Dec 1 11:45 /etc/shadow\n</pre>\n\nEspera um minuto aqui, este arquivo é de propriedade do root? Como é possível que possamos modificar um arquivo de propriedade do root? \n\nVamos dar uma olhada em outro conjunto de permissões, desta vez do comando que executamos: \n\n<pre>$ ls -l /usr/bin/passwd\n\n-rwsr-xr-x 1 root root 47032 Dec 1 11:45 /usr/bin/passwd\n</pre>\n\nVocê notará um novo bit de permissão aqui <b>s</b>. Esse bit de permissão é o SUID, quando um arquivo tem essa permissão definida, permite que os usuários que iniciaram o programa obtenham a permissão do proprietário do arquivo, bem como a permissão de execução, neste caso root. Então, essencialmente, enquanto um usuário está executando o comando de senha, ele está sendo executado como root.\n\nÉ por isso que conseguimos acessar um arquivo protegido como /etc/shadow quando executamos o comando passwd. Agora, se você remover esse bit, verá que não conseguirá modificar /etc/shadow e, portanto, alterar sua senha. \n\n<b>Modificando SUID</b>\n\nAssim como as permissões regulares, existem duas maneiras de modificar as permissões SUID. \n\n<i>Forma simbólica:</i>\n<pre>$ sudo chmod u+s myfile</pre>\n\n<i>Forma numérica:</i>\n<pre> sudo chmod 4755 myfile</pre>\n\nComo você pode ver, o SUID é denotado por um 4 e pre-pendido ao conjunto de permissões. Você pode ver o SUID denotado como um <b>S</b> maiúsculo, isso significa que ele ainda faz a mesma coisa, mas não tem permissões de execução.",
  "exercise": "Olhe com atenção as permissões para /etc/passwd, você nota mais alguma coisa? Arquivos com SUID habilitado também são facilmente distinguíveis.",
  "quizQuestion": "Que número representa o SUID?",
  "quizAnswer": "4",
  "slug": "setuidsetuserid"
}