{
  "id": 3,
  "title": "ディスクの解剖",
  "lessonContent": "ハードディスクはパーティションに分割でき、複数のブロックデバイスを作成できます。 例として、/dev/sda1や/dev/sda2などが挙げられます。/dev/sdaはディスク全体を指し、/dev/sda1はそのディスク上の最初のパーティションを指します。 パーティションはデータを分離するのに非常に役立ち、特定のファイルシステムが必要な場合、ディスク全体を1つのファイルシステムタイプにする代わりに、簡単にパーティションを作成できます。\n\n<b>パーティションテーブル</b>\n\nすべてのディスクにはパーティションテーブルがあり、このテーブルはディスクがどのようにパーティションされているかをシステムに伝えます。 このテーブルには、パーティションの開始と終了位置、ブート可能なパーティション、ディスクのどのセクタがどのパーティションに割り当てられているかなどが記載されます。 使用される主なパーティションテーブルスキームには、Master Boot Record（MBR）とGUID Partition Table（GPT）があります。\n\n<b>パーティション</b>\n\nディスクはデータを整理するのに役立つパーティションで構成されています。 ディスク上に複数のパーティションを持つことができ、これらは互いに重なることはありません。 パーティションに割り当てられていないスペースがある場合、それは未割り当て領域と呼ばれます。 パーティションの種類はパーティションテーブルに依存します。 パーティション内にはファイルシステムを持つか、スワップなど他の用途のためにパーティションを割り当てることができます。\n\n<i>MBR</i>\n\n<ul>\n<li>従来のパーティションテーブルで、標準として使用されていました</li>\n<li>プライマリ、拡張、論理パーティションを持つことができます</li>\n<li>MBRはプライマリパーティションを4つまでしか持つことができません</li>\n<li>追加のパーティションは、プライマリパーティションを拡張パーティションに変更することで作成できます（ディスク上には1つの拡張パーティションしか存在できません）。 その後、拡張パーティション内に論理パーティションを追加します。 論理パーティションは他のパーティションと同様に使用されます。</li>\n<li>2テラバイトまでのディスクをサポート</li>\n</ul>\n\n<i>GPT</i>\n\n<ul>\n<li>GUID Partition Table（GPT）は、ディスクのパーティション分割の新しい標準となっています</li>\n<li>1種類のパーティションのみを持ち、複数作成できます</li>\n<li>各パーティションにはグローバルに一意なID（GUID）があります</li>\n<li>UEFIベースのブートに主に使用されます（別のコースで詳細を説明します）</li>\n</ul>\n\n<b>ファイルシステム構造</b>\n\n前のレッスンから、ファイルシステムがファイルとディレクトリの整理されたコレクションであることを知っています。 最も単純な形態では、ファイルシステムはファイルを管理するデータベースと実際のファイル自体で構成されていますが、もう少し詳しく説明します。\n\n<ul>\n<li>ブートブロック - これはファイルシステムの最初の数セクタにあり、実際にはファイルシステムには使用されません。 代わりに、オペレーティングシステムの起動に使用される情報が含まれています。 オペレーティングシステムには1つのブートブロックしか必要ありません。 複数のパーティションがある場合、それぞれにブートブロックがありますが、そのうちの多くは使用されません。</li>\n<li>スーパーブロック - これはブートブロックの後に続く単一のブロックで、ファイルシステムのサイズ、inodeテーブルのサイズ、論理ブロックのサイズ、ファイルシステムのサイズなどの情報が含まれています。</li>\n<li>inodeテーブル - これはファイルを管理するデータベースと考えてください（inodeに関する詳細なレッスンがありますので、心配しないでください）。 各ファイルやディレクトリにはinodeテーブル内で一意のエントリがあり、ファイルに関するさまざまな情報が含まれています。</li>\n<li>データブロック - これはファイルとディレクトリの実際のデータです。</li>\n</ul>\n\n異なるパーティションテーブルを見てみましょう。 以下は、MBRパーティションテーブル（msdos）を使用したパーティションの例です。 マシン上のプライマリ、拡張、論理パーティションが表示されます。\n\n<pre>\npete@icebox:~$ sudo parted -l\nModel: Seagate (scsi)\nDisk /dev/sda: 21.5GB\nSector size (logical/physical): 512B/512B\nPartition Table: msdos\n\nNumber  Start   End     Size    Type      File system     Flags\n 1      1049kB  6860MB  6859MB  primary   ext4            boot\n 2      6861MB  21.5GB  14.6GB  extended\n 5      6861MB  7380MB  519MB   logical   linux-swap(v1)\n 6      7381MB  21.5GB  14.1GB  logical   xfs\n</pre>\n\n\nこの例はGPTを使用し、パーティションには一意のIDが使用されています。\n\n<pre>\nModel: Thumb Drive (scsi)\nDisk /dev/sdb: 4041MB\nSector size (logical/physical): 512B/512B\nPartition Table: gpt\n\nNumber  Start   End     Size     File system  Name        Flags\n 1      17.4kB  1000MB  1000MB                first\n 2      1000MB  4040MB  3040MB                second\n</pre>",
  "exercise": "自分のマシンで<b>parted -l</b>を実行し、結果を評価してください。",
  "quizQuestion": "MBRパーティショニングスキームで4つ以上のパーティションを作成するために使用されるパーティションタイプは何ですか？",
  "quizAnswer": "extended",
  "slug": "anatomyofadisk"
}