{
  "id": 3,
  "title": "पैकेट का मार्ग",
  "lessonContent": "<b>चलो देखते हैं कि एक पैकेट अपने स्थानीय नेटवर्क के भीतर कैसे यात्रा करता है</b>\n\n<ol>\n<li>पहले स्थानीय मशीन गंतव्य IP पते की तुलना करेगी ताकि यह देख सके कि क्या यह एक ही सबनेट में है यह अपनी सबनेट मास्क देखकर।</li>\n<li>पैकेट भेजे जाते हैं तो उन्हें एक स्रोत MAC पता, गंतव्य MAC पता, स्रोत IP पता और गंतव्य IP पता होना चाहिए, इस समय हमें गंतव्य MAC पता नहीं पता है।</li>\n<li>गंतव्य होस्ट तक पहुंचने के लिए, हम ARP का उपयोग करते हैं ताकि स्थानीय नेटवर्क पर गंतव्य होस्ट के MAC पता प्राप्त करने के लिए एक अनुरोध प्रसारित कर सकें।</li>\n<li>अब पैकेट सफलतापूर्वक भेजा जा सकता है!</li>\n</ol>\n\n<b>चलो देखते हैं कि एक पैकेट अपने नेटवर्क के बाहर कैसे यात्रा करता है</b>\n\n<ol>\n<li>पहले स्थानीय मशीन गंतव्य IP पता की तुलना करेगी, क्योंकि यह हमारे नेटवर्क के बाहर है, इसलिए यह गंतव्य होस्ट का MAC पता नहीं देखता। और हम ARP का उपयोग नहीं कर सकते क्योंकि ARP अनुरोध स्थानीय रूप से कनेक्टेड होस्ट्स को प्रसारित करता है।</li>\n<li>इसलिए हमारा पैकेट अब रूटिंग टेबल पर देखता है, यह गंतव्य IP का पता नहीं जानता है, इसलिए यह इसे डिफ़ॉल्ट गेटवे (एक और राउटर) पर भेजता है। तो अब हमारे पैकेट में हमारा स्रोत IP, गंतव्य IP और स्रोत MAC होता है, हालांकि हमें एक गंतव्य MAC नहीं है। ध्यान रखें MAC पते केवल एक ही नेटवर्क के माध्यम से पहुंचे जाते हैं। तो यह क्या करता है? यह डिफ़ॉल्ट गेटवे के MAC पता प्राप्त करने के लिए ARP अनुरोध भेजता है।</li>\n<li>राउटर पैकेट को देखता है और गंतव्य MAC पता सत्यापित करता है, लेकिन यह अंतिम गंतव्य IP पता नहीं है, इसलिए यह पैकेट को आगे बढ़ाने के लिए एक और IP पते की ओर देखता है जो पैकेट को उसके गंतव्य तक आगे बढ़ाने में मदद कर सकता है। हर बार पैकेट चलता है, पुराने स्रोत और गंतव्य MAC पते को हटाता है और पैकेट को नए स्रोत और गंतव्य MAC पतों के साथ अपडेट करता है।</li>\n<li>एक बार पैकेट को वही नेटवर्क आगे भेजा जाता है, हम अंतिम गंतव्य MAC पता प्राप्त करने के लिए ARP का उपयोग करते हैं</li>\n<li>इस प्रक्रिया के दौरान, हमारा पैकेट स्रोत या गंतव्य IP पता नहीं बदलता।</li>\n</ol>",
  "exercise": "इस पाठ के लिए कोई व्यायाम नहीं।",
  "quizQuestion": "एक IP पते के MAC पता कैसे पाया जाता है?",
  "quizAnswer": "ARP",
  "slug": "pathofapacket"
}