{
  "id": 1,
  "title": "राउटर क्या है?",
  "lessonContent": "हमने पहले भी इस शब्द 'राउटर' का उपयोग किया है, आशा है कि आप जानते होंगे कि यह क्या है, क्योंकि शायद आपके घर में एक होगा। एक राउटर नेटवर्क पर मशीनों को एक-दूसरे के साथ संचार करने की सुविधा प्रदान करता है साथ ही अन्य नेटवर्कों के साथ। एक सामान्य राउटर पर आपके पास एलएएन पोर्ट्स होंगे, जो आपकी मशीनों को एक ही स्थानीय क्षेत्रीय नेटवर्क से कनेक्ट करने की अनुमति देते हैं और आपके पास इंटरनेट अपलिंक पोर्ट होता है जो आपको इंटरनेट से कनेक्ट करता है, कभी-कभी आप इस पोर्ट को डब्ल्यूएएन के रूप में लेबल किया देखेंगे, क्योंकि यह आपको एक व्यापक नेटवर्क से कनेक्ट कर रहा है। हम किसी भी प्रकार की नेटवर्किंग गतिविधि करते हैं, तो यह राउटर के माध्यम से जाना पड़ता है। राउटर तय करता है कि हमारे नेटवर्क पैकेट कहाँ जाएं और कौन से आएं। यह हमारे पैकेट को एक से अधिक नेटवर्कों के बीच मार्गदर्शन करता है ताकि इसके स्रोत होस्ट से लक्ष्य होस्ट तक पहुंच सके। \n\n<b>राउटर कैसे काम करता है?</b>\n\nरूटिंग को मेल वितरण के रूप में सोचें, हमें एक पता है जिसे हम एक पत्र भेजना चाहते हैं, जब हम इसे डाकघर को भेजते हैं, वे पत्र प्राप्त करते हैं और देखते हैं, ओह यह कैलिफोर्निया जा रहा है, मैं इसे कैलिफोर्निया जाने वाले ट्रक पर रख दूंगा (मुझे सच में नहीं पता कि डाक सिस्टम कैसे काम करता है)। फिर पत्र सैन फ्रांसिस्को भेजा जाता है, सैन फ्रांसिस्को के अंदर विभिन्न ज़िप कोड होते हैं, और फिर उन ज़िप कोड में छोटे पता कोड होते हैं, जब तक आखिरकार कोई व्यक्ति आपके पते पर पत्र पहुंचा सकता है। दूसरी ओर, अगर आप पहले से ही सैन फ्रांसिस्को में रहते हैं और उसी ज़िप कोड में हैं, तो डाक वितरक शायद बिना किसी और को सौंपे बिना यह जान जाएगा कि पत्र को कहाँ भेजना है। \n\nजब हम पैकेट रूट करते हैं, तो वे समान पता \"रूट\" का उपयोग करते हैं, जैसे कि नेटवर्क ए को पहुंचने के लिए, इन पैकेट्स को नेटवर्क बी में भेजें। जब हमारे पास उसके लिए एक रूट सेट नहीं होता है, तो हमारे पैकेट्स का उपयोग किया जाएगा। ये रूट एक रूटिंग टेबल पर सेट होते हैं जिसका हमारे सिस्टम को नेटवर्कों के बीच नेविगेट करने के लिए उपयोग किया जाता है।\n\n<b>हॉप्स</b>\n\nजब पैकेट्स नेटवर्कों के बीच चलते हैं, तो वे हॉप्स में यात्रा करते हैं, एक हॉप वह दूरी है जिसे हम अंदाज़ से मापते हैं जिसे पैकेट को स्रोत से लक्ष्य तक पहुंचने के लिए यात्रा करनी पड़ती है। मान लीजिए मेरे पास होस्ट ए से होस्ट बी को जोड़ने वाले दो राउटर हैं, इसलिए हम कहते हैं कि होस्ट ए और होस्ट बी के बीच दो हॉप्स हैं। प्रत्येक हॉप एक इंटरमीडिएट डिवाइस है जैसे कि राउटर जिन्हें हमें पार करना होता है।\n\n<b>स्विचिंग, रूटिंग और फ्लडिंग के बीच मूल अंतर समझना</b>\nपैकेट स्विचिंग मूल रूप से डेटा प्राप्त करना, प्रसंस्करण करना और लक्ष्य उपकरण तक फॉरवर्ड करना है।\nरूटिंग एक रूटिंग टेबल बनाने की प्रक्रिया है, ताकि हम स्विचिंग बेहतर कर सकें।\nरूटिंग से पहले, फ्लडिंग का उपयोग किया जाता था। अगर एक राउटर को यह पता नहीं है कि पैकेट को किस तरह भेजना है तो हर आने वाले पैकेट को उसे आयातित लिंक के अलावा सभी आउटगोइंग लिंक के माध्यम से भेज दिया जाता था।",
  "exercise": "इस सबक के लिए कोई व्यायाम नहीं है।",
  "quizQuestion": "पैकेट किस दूरी को मापते हैं?",
  "quizAnswer": "हॉप्स",
  "slug": "whatisarouter"
}