{
  "id": 2,
  "title": "सबनेट्स",
  "lessonContent": "मैं कैसे पता लगा सकता हूं कि मैं पैटी के समान नेटवर्क पर हूं? अच्छा हम बस सबनेट देख सकते हैं जिसे सबनेटवर्क के लिए छोटा कहा जाता है। एक सबनेट एक समान ढंग से आईपी पतों वाले होस्टों का एक समूह है। इन होस्ट्स के बीच सामान्यत: एक पास की स्थिति में होते हैं और आप आसानी से एक समान सबनेट पर होस्ट्स को डेटा भेज सकते हैं और प्राप्त कर सकते हैं। इसे एक जिप कोड में मेल भेजने के रूप में सोचें, यह एक अलग राज्य में मेल भेजने से कहीं बेहतर है। \n\nउदाहरण के लिए, एक आईपी पति के साथ शुरू होने वाले सभी होस्ट एक ही सबनेट पर होंगे। मेरे होस्ट का आईपी 123.45.67.8 है और पैटी का 123.45.67.9 है। सामान्य संख्याएँ मेरा नेटवर्क प्रिफिक्स हैं और 8 और 9 हमारे होस्ट हैं, इसलिए मेरा नेटवर्क पैटी के समान है। एक सबनेट को एक नेटवर्क प्रिफिक्स में विभाजित किया जाता है, जैसे 123.45.67.0 और एक सबनेट मास्क।\n\n<b>सबनेट मास्क</b>\n\nसबनेट मास्क यह निर्धारित करते हैं कि आपके आईपी पते का कौन सा हिस्सा नेटवर्क हिस्सा है और कौन सा होस्ट हिस्सा है। \n\nएक साधारण सबनेट मास्क इस तरह दिख सकता है:\n\n<pre>255.255.255.0</pre>\n\n255 हिस्सा वास्तव में हमारी मास्क है। इसे समझने के लिए थोड़ा सहज बनाने के लिए, याद रखें कि हम प्रत्येक ऑक्टेट को 8 बिट के रूप में कैसे संदर्भित करते हैं? कंप्यूटर विज्ञान में एक बिट को बाइनरी रूप में 0 या 1 द्वारा दर्शाया जाता है। जब बाइनरी संख्याएँ उपयोग की जाती हैं, तो 1 का अर्थ है चालू और 0 का अर्थ है बंद। तो 8 0 या 1 का अर्थ क्या है?\n\nGoogle में \"बाइनरी से दशमलव कैलकुलेटर\" में प्रवेश करें और 11111111 को दशमलव रूप में परिवर्तित करें। आपको क्या मिलता है? 255! तो एक ऑक्टेट 0 से 255 तक की श्रेणी होती है। तो अगर हमारा सबनेट मास्क 255.255.255.0 है, और एक आईपी पता 192.168.1.0 है, तो उस सबनेट पर कितने होस्ट हैं? हम सबनेट गणित सबक के उत्तर को पता करेंगे।\n\nइसके अलावा जब हम अपने सबनेट के बारे में बात करते हैं, तो हम सामान्यत: नेटवर्क प्रिफिक्स के बाद सबनेट मास्क द्वारा इसे दर्शाते हैं:\n\n<pre>123.234.0.0/255.255.0.0</pre>\n\n<b>क्यों?</b>\n\nधरती पर क्यों हम सबनेट बनाते हैं? सबनेटिंग का उपयोग नेटवर्क को खंडित करने और उस नेटवर्क के भीतर ट्रैफिक को नियंत्रित करने के लिए किया जाता है। इसलिए एक सबनेट पर एक होस्ट एक दूसरे सबनेट पर एक होस्ट से संवाद नहीं कर सकता। \n\nलेकिन एक मिनट रुकिए, अगर मैं अन्य होस्टों से जैसे yahoo.com से कनेक्ट करना चाहता हूं? तो आपको सबनेट्स को एक साथ कनेक्ट करने की आवश्यकता है। सबनेट्स को कनेक्ट करने के लिए आपको बस उन होस्टों को खोजना होगा जो एक से अधिक सबनेट से कनेक्ट हैं। उदाहरण के लिए, अगर मेरा होस्ट 192.168.1.129 एक स्थानीय नेटवर्क 192.168.1.129/24 से कनेक्ट है, तो वह उस नेटवर्क पर किसी भी होस्ट तक पहुंच सकता है। इंटरनेट के बाकी होस्टों तक पहुंचने के लिए, इसे राउटर के माध्यम से संवाद करने की आवश्यकता है। पारंपरिक रूप से, ज्यादातर सबनेट मास्क 255.255.255.0 के साथ नेटवर्क में राउटर सामान्यत: पता 1 पर होता है, इसलिए 192.168.1.1। अब उस राउटर के पास एक पोर्ट होगा जो इसे दूसरे सबनेट से जोड़ता है (रूटिंग कोर्स में अधिक है)। कुछ आईपी पते (निजी नेटवर्क) इंटरनेट को दिखाई नहीं देते हैं, और हमारे पास इस तरह की चीजें हैं जैसे एनएटी (इसके बारे में बाद में)।",
  "exercise": "अपनी सबनेट मास्क देखने के लिए ifconfig का उपयोग करें।",
  "quizQuestion": "सही या गलत, एक सबनेट में एक सबनेट मास्क और नेटवर्क प्रिफिक्स होता है।",
  "quizAnswer": "सही",
  "slug": "subnets"
}