{
  "id": 1,
  "title": "Vue d'ensemble du processus de démarrage",
  "lessonContent": "Maintenant que nous avons une assez bonne compréhension de certains des composants importants de Linux, rassemblons-les en apprenant comment le système démarre. Lorsque vous allumez votre machine, elle effectue des choses intéressantes comme vous montrer l'écran de logo, afficher différents messages, puis à la fin, vous êtes invité à une fenêtre de connexion. Eh bien, il se passe en réalité beaucoup de choses entre le moment où vous appuyez sur le bouton d'alimentation et le moment où vous vous connectez, et nous en discuterons dans ce cours. \n\nLe processus de démarrage de Linux peut être décomposé en 4 étapes simples : \n\n<b>1. BIOS</b>\n\nLe BIOS (qui signifie \"Basic Input/Output System\") initialise le matériel et s'assure avec un test d'autocontrôle (POST) que tout le matériel est prêt à fonctionner. Le rôle principal du BIOS est de charger le chargeur d'amorçage.\n\n<b>2. Chargeur d'amorçage</b>\n\nLe chargeur d'amorçage charge le noyau en mémoire, puis démarre le noyau avec un ensemble de paramètres du noyau. Un des chargeurs d'amorçage les plus courants est GRUB, qui est une norme universelle pour Linux. \n\n<b>3. Noyau</b>\n\nLorsque le noyau est chargé, il initialise immédiatement les périphériques et la mémoire. Le rôle principal du noyau est de charger le processus d'initialisation. \n\n<b>4. Init</b>\n\nRappelez-vous que le processus d'initialisation est le premier processus qui démarre, init démarre et arrête les processus de service essentiels sur le système. Il existe trois implémentations majeures d'init dans les distributions Linux. Nous les survolerons brièvement, puis nous les approfondirons dans un autre cours.\n\nVoilà, l'explication (très) simple du processus de démarrage de Linux. Nous approfondirons ces étapes dans les prochaines leçons.",
  "exercise": "Redémarrez votre système et voyez si vous pouvez repérer chaque étape pendant le démarrage de votre machine.",
  "quizQuestion": "Quelle est la dernière étape du processus de démarrage de Linux ?",
  "quizAnswer": "init",
  "slug": "vue-d-ensemble-du-processus-de-demarrage"
}