{
  "id": 2,
  "title": "Processus de démarrage : BIOS",
  "lessonContent": "<b>BIOS</b>\n\nLa première étape du processus de démarrage de Linux est le BIOS qui effectue des vérifications d'intégrité du système. Le BIOS est un micrologiciel qui se trouve le plus souvent dans les ordinateurs compatibles PC IBM, le type d'ordinateurs dominant aujourd'hui. Vous avez probablement utilisé le micrologiciel BIOS pour modifier l'ordre de démarrage de vos disques durs, vérifier l'heure système, l'adresse MAC de votre machine, etc. L'objectif principal du BIOS est de trouver le chargeur d'amorçage du système.\n\nUne fois que le BIOS a démarré le disque dur, il recherche le bloc de démarrage pour savoir comment démarrer le système. En fonction de la façon dont vous avez partitionné votre disque, il cherchera le secteur de démarrage principal (MBR) ou GPT. Le MBR se trouve dans le premier secteur du disque dur, les premiers 512 octets. Le MBR contient le code pour charger un autre programme quelque part sur le disque, ce programme charge ensuite notre chargeur d'amorçage.\n\nMaintenant, si vous avez partitionné votre disque avec GPT, l'emplacement du chargeur d'amorçage change un peu.\n\n<b>UEFI</b>\n\nIl existe une autre façon de démarrer votre système au lieu d'utiliser le BIOS, c'est avec UEFI (qui signifie \"Interface micrologicielle extensible unifiée\"). UEFI a été conçu pour être le successeur du BIOS, la plupart du matériel disponible aujourd'hui est livré avec le micrologiciel UEFI intégré. Les machines Macintosh utilisent le démarrage EFI depuis des années maintenant et Windows a pour la plupart déplacé tous leurs éléments vers le démarrage UEFI. Le format GPT était destiné à être utilisé avec l'EFI. Vous n'avez pas nécessairement besoin de l'EFI si vous démarrez un disque GPT. Le premier secteur d'un disque GPT est réservé à un \"MBR de protection\" pour permettre le démarrage sur une machine basée sur le BIOS.\n\nUEFI stocke toutes les informations de démarrage dans un fichier .efi. Ce fichier est stocké sur une partition spéciale appelée partition système EFI sur le matériel. À l'intérieur de cette partition, il contiendra le chargeur d'amorçage. UEFI apporte de nombreuses améliorations par rapport au micrologiciel BIOS traditionnel. Cependant, comme nous utilisons Linux, la majorité d'entre nous utilisons le BIOS. Donc, toutes ces leçons suivront cette prémisse.",
  "exercise": "Accédez au menu de votre BIOS et vérifiez si le démarrage UEFI est activé.",
  "quizQuestion": "Que charge le BIOS?",
  "quizAnswer": "chargeur d'amorçage",
  "slug": "processusdedemarragebios"
}