{
  "id": 3,
  "title": "Processus de démarrage : Chargeur d'amorçage",
  "lessonContent": "Les principales responsabilités du chargeur d'amorçage sont :\n\n<ul>\n<li>Démarrer dans un système d'exploitation, il peut également être utilisé pour démarrer vers des systèmes d'exploitation non-Linux</li>\n<li>Sélectionner un noyau à utiliser</li>\n<li>Spécifier les paramètres du noyau</li>\n</ul>\n\nLe chargeur d'amorçage le plus courant pour Linux est GRUB, vous l'utilisez très probablement sur votre système. Il existe de nombreux autres chargeurs d'amorçage que vous pouvez utiliser tels que LILO, efilinux, coreboot, SYSLINUX et d'autres. Cependant, nous travaillerons uniquement avec GRUB comme chargeur d'amorçage. \n\nNous savons donc que l'objectif principal du chargeur d'amorçage est de charger le noyau, mais où trouve-t-il le noyau ? Pour le trouver, nous devrons examiner nos paramètres du noyau. Les paramètres peuvent être trouvés en accédant au menu GRUB au démarrage en utilisant la touche 'e'. Si vous n'avez pas GRUB, pas de soucis, nous passerons en revue les paramètres de démarrage que vous verrez :\n\n<ul>\n<li>initrd - Spécifie l'emplacement du disque RAM initial (nous en parlerons davantage dans la prochaine leçon).</li>\n<li>BOOT_IMAGE - C'est là que se trouve l'image du noyau</li>\n<li>root - L'emplacement du système de fichiers racine, le noyau recherche à l'intérieur de cet emplacement pour trouver init. Il est souvent représenté par son UUID ou le nom du périphérique tel que /dev/sda1.</li>\n<li>ro - Ce paramètre est assez standard, il monte le système de fichiers en mode lecture seule.</li>\n<li>quiet - Cela est ajouté pour que vous ne voyiez pas les messages d'affichage qui se déroulent en arrière-plan pendant le démarrage.</li>\n<li>splash - Cela permet d'afficher l'écran de démarrage.</li>\n</ul>",
  "exercise": "Si vous avez GRUB comme chargeur d'amorçage, accédez au menu GRUB avec 'e' et examinez les paramètres.",
  "quizQuestion": "Quel paramètre du noyau fait en sorte que vous ne voyiez pas les messages de démarrage ?",
  "quizAnswer": "quiet",
  "slug": "processusdedemarragechargeur"
}