{
  "id": 9,
  "title": "historique",
  "lessonContent": "Dans votre shell, il y a un historique des commandes que vous avez précédemment saisies, vous pouvez effectivement parcourir ces commandes. C'est assez utile lorsque vous voulez trouver et exécuter une commande que vous avez utilisée précédemment sans la retaper.\n\n<pre>$ history</pre>\n\nVous voulez exécuter la même commande que celle que vous avez faite précédemment, appuyez simplement sur la flèche vers le haut.\n\nVous voulez exécuter la commande précédente sans la retaper ? Utilisez !!. Si vous avez tapé cat fichier1 et que vous voulez l'exécuter à nouveau, vous pouvez simplement taper !! et cela exécutera la dernière commande que vous avez exécutée.\n\nUn autre raccourci d'historique est ctrl-R, c'est la commande de recherche inversée, si vous appuyez sur ctrl-R et que vous commencez à taper des parties de la commande que vous voulez, il vous montrera des correspondances et vous pourrez simplement naviguer à travers elles en appuyant à nouveau sur la touche ctrl-R. Une fois que vous avez trouvé la commande que vous voulez utiliser à nouveau, appuyez simplement sur la touche Entrée.\n\nNotre terminal est un peu encombré, n'est-ce pas ? Faisons un peu de nettoyage, utilisez la commande clear pour nettoyer votre affichage.\n\n<pre>$ clear</pre>\n\nCela a l'air mieux, n'est-ce pas ?\n\nPendant que nous parlons de choses utiles, l'une des fonctionnalités les plus utiles dans n'importe quel environnement en ligne de commande est l'auto-complétion. Si vous commencez à taper le début d'une commande, d'un fichier, d'un répertoire, etc. et appuyez sur la touche Tab, cela complétera automatiquement en fonction de ce qu'il trouve dans le répertoire que vous recherchez tant que vous n'avez pas d'autres fichiers qui commencent par ces lettres. Par exemple, si vous essayiez d'exécuter la commande chrome, vous pouvez taper chr et appuyer sur Tab et cela complétera automatiquement chrome.",
  "exercise": "Naviguez dans l'historique de vos commandes précédentes avec les touches Haut et Bas. Jouez avec la recherche inversée ctrl-R.",
  "quizQuestion": "Quelle est la commande pour effacer le terminal ?",
  "quizAnswer": "clear",
  "slug": "commandehistorique"
}