{
  "id": 4,
  "title": "ls (Lister les répertoires)",
  "lessonContent": "Maintenant que nous savons comment nous déplacer dans le système, comment pouvons-nous savoir ce qui est disponible pour nous ? Pour l'instant, c'est comme si nous nous déplacions dans l'obscurité. Eh bien, nous pouvons utiliser la merveilleuse commande ls pour lister le contenu des répertoires. La commande ls listera les répertoires et fichiers du répertoire actuel par défaut, cependant vous pouvez spécifier le chemin que vous souhaitez lister.\n\n<pre>$ ls\n$ ls /home/pete</pre>\n\nls est un outil assez utile, il vous montre également des informations détaillées sur les fichiers et répertoires que vous regardez.\n\nNotez également que tous les fichiers d'un répertoire ne seront pas visibles. Les noms de fichiers commençant par . sont cachés, vous pouvez cependant les voir avec la commande ls en passant le drapeau -a (a pour tous).\n\n<pre>$ ls -a</pre>\n\nIl y a aussi un autre drapeau ls utile, -l pour long, cela affiche une liste détaillée des fichiers dans un format long. Cela vous montrera des informations détaillées, en commençant par la gauche : les permissions du fichier, le nombre de liens, le nom du propriétaire, le groupe propriétaire, la taille du fichier, l'horodatage de la dernière modification et le nom du fichier/répertoire.\n\n<pre>$ ls -l</pre>\n\n<pre>pete@icebox:~$ ls -l\ntotal 80\ndrwxr-x--- 7 pete penguingroup   4096 Nov 20 16:37 Desktop\ndrwxr-x--- 2 pete penguingroup   4096 Oct 19 10:46  Documents\ndrwxr-x--- 4 pete penguingroup   4096 Nov 20 09:30 Downloads\ndrwxr-x--- 2 pete penguingroup   4096 Oct  7 13:13   Music\ndrwxr-x--- 2 pete penguingroup   4096 Sep 21 14:02 Pictures\ndrwxr-x--- 2 pete penguingroup   4096 Jul 27 12:41   Public\ndrwxr-x--- 2 pete penguingroup   4096 Jul 27 12:41   Templates\ndrwxr-x--- 2 pete penguingroup   4096 Jul 27 12:41   Videos</pre>\n\nLes commandes ont des choses appelées drapeaux (ou arguments ou options, comme vous voulez l'appeler) pour ajouter plus de fonctionnalités. Voyez comment nous avons ajouté -a et -l, eh bien vous pouvez les ajouter tous les deux ensemble avec -la. L'ordre des drapeaux détermine dans quel ordre cela se fait, la plupart du temps cela n'a pas vraiment d'importance, donc vous pouvez également faire ls -al et cela fonctionnerait toujours.\n\n<pre>$ ls -la</pre>",
  "exercise": "Exécutez ls avec différents drapeaux et observez la sortie que vous recevez.",
  "quizQuestion": "Quelle commande utiliseriez-vous pour voir les fichiers cachés ?",
  "quizAnswer": "ls -a",
  "slug": "listdirectorieslscommand"
}