{
  "id": 2,
  "title": "DNS-Komponenten",
  "lessonContent": "Die DNS-Datenbank des Internets basiert darauf, dass Websites und Organisationen einen Teil dieser Datenbank bereitstellen. Dafür benötigen sie:\n\n<b>Name Server</b>\n\nWir richten DNS über \"Nameserver\" ein. Die Nameserver laden unsere DNS-Einstellungen und Konfigurationen und beantworten Fragen von Clients oder anderen Servern, die beispielsweise wissen möchten: \"Wer ist google.com?\". Wenn der Nameserver die Antwort auf diese Abfrage nicht kennt, leitet er die Anfrage an andere Nameserver weiter. Nameserver können \"authoritativ\" sein, was bedeutet, dass sie die tatsächlichen DNS-Einträge, nach denen gesucht wird, enthalten, oder \"rekursiv\", was bedeutet, dass sie andere Server fragen und diese Server wiederum andere Server fragen, bis sie einen autoritativen Server gefunden haben, der die DNS-Einträge enthält. Rekursive Server können auch die gewünschten Informationen zwischenspeichern, anstatt einen autoritativen Server zu erreichen.\n\n<b>Zonen-Datei</b>\n\nIn einem Nameserver befindet sich etwas, das Zonendateien genannt wird. Zonendateien enthalten Informationen über die Domain oder wie man zur Domain gelangt, wenn der Nameserver sie nicht kennt.\n\n<b>Resource Records</b>\n\nEine Zonendatei besteht aus Einträgen von Ressourceneinträgen. Jede Zeile ist ein Eintrag und enthält Informationen über Hosts, Nameserver, andere Ressourcen usw. Die Felder bestehen aus folgendem: \n\n<ul>\n<li>Eintragsname</li>\n<li>TTL - Die Zeit, nach der wir den Eintrag verwerfen und einen neuen erhalten, wird in DNS durch Zeit angegeben, sodass Einträge eine TTL von einer Stunde haben können. Der Grund dafür ist, dass sich das Internet ständig ändert. Innerhalb einer Minute kann ein Host einer IP-Adresse X zugeordnet sein und im nächsten Moment einer IP-Adresse Y.</li>\n<li>Klasse - Namensraum der Eintragsinformationen, am häufigsten wird IN für Internet verwendet</li>\n<li>Typ - Art der Informationen, die in den Eintragsdaten gespeichert sind. Wir werden nicht auf Einzelheiten der Eintragstypen eingehen, aber Sie haben wahrscheinlich gängige wie A für Adresse, MX für Mail-Exchanger usw. gesehen.</li>\n<li>Daten - Dieses Feld kann je nach Eintragstyp eine IP-Adresse oder etwas anderes enthalten.</li>\n</ul>\n<pre>\npatty    IN  A      192.168.0.4 \n</pre>",
  "exercise": "Für diese Lektion sind keine Übungen vorgesehen.",
  "quizQuestion": "Welcher Ressourceneintragstyp wird für Mail-Exchanger verwendet?",
  "quizAnswer": "MX",
  "slug": "dnskomponenten"
}