{
  "id": 3,
  "title": "DNS-Prozess",
  "lessonContent": "Schauen wir uns ein Beispiel an, wie Ihr Host eine Domain (catzontheinterwebz.com) mit DNS findet. Im Wesentlichen arbeiten wir uns nach unten, bis wir den DNS-Server erreichen, der von dieser Domain weiß.\n\n<b>Lokaler DNS-Server</b>\n\nZuerst fragt unser Host: \"Wo ist catzontheinterwebz.com?\" Unser lokaler DNS-Server weiß es nicht, also geht er zum Anfang des Trichters, um die Root-Server zu fragen. Beachten Sie, dass unser Host diese Anfragen nicht direkt stellt, um catzontheinterwebz.com zu finden. Die meisten Benutzer sprechen mit einem rekursiven DNS-Server, der von ihren ISPs bereitgestellt wird, und dieser Server ist dann damit beauftragt, den Standort von catzontheinterwebz.com zu finden.\n\n<b>Root-Server</b>\n\nEs gibt 13 Root-Server für das Internet, sie sind gespiegelt und weltweit verteilt, um DNS-Anfragen für das Internet zu bearbeiten. Es gibt also wirklich Hunderte von Servern, die arbeiten, sie werden von verschiedenen Organisationen kontrolliert und enthalten Informationen über Top-Level-Domains. Top-Level-Domains sind Ihnen als .org, .com, .net usw. bekannt. Der Root-Server weiß also nicht, wo catzontheinterwebz.com ist, also sagt er uns, den .com-Top-Level-Domain-DNS-Server an der IP-Adresse zu fragen, die er uns gibt.\n\n<b>Top-Level-Domain</b>\n\nJetzt senden wir eine weitere Anfrage an den Namensserver, der über \".com\"-Adressen Bescheid weiß, und fragen, ob er weiß, wo catzontheinterwebz.com ist? Die TLD hat catzontheinterwebz.com nicht in ihren Zonendateien, sieht aber einen Eintrag für den Namensserver von catzontheinterwebz.com. Also gibt sie uns die IP-Adresse dieses Namensservers und sagt uns, dort nachzusehen.\n\n<b>Autoritativer DNS-Server</b>\n\nJetzt senden wir eine letzte Anfrage an den DNS-Server, der tatsächlich den Datensatz hat, den wir wollen. Der Namensserver sieht, dass er eine Zonendatei für catzontheinterwebz.com hat und es einen Ressourceneintrag für 'www' für diesen Host gibt. Dann gibt er uns die IP-Adresse dieses Hosts und wir können endlich einige Katzen im Internet sehen.",
  "exercise": "Keine Übungen für diese Lektion.",
  "quizQuestion": "Was ist die Abkürzung für die Namensserver, wo .com, .net, .org usw. Adressen gefunden werden?",
  "quizAnswer": "TLD",
  "slug": "dnsprocess"
}