{
  "id": 4,
  "title": "/etc/hosts",
  "lessonContent": "<p>Bevor unsere Maschine tatsächlich auf DNS zugreift, um eine Abfrage durchzuführen, sucht sie zuerst lokal auf unseren Maschinen. </p><br><p><b>/etc/hosts</b></p><p>Die Datei /etc/hosts enthält Zuordnungen einiger Hostnamen zu IP-Adressen. Die Felder sind ziemlich selbsterklärend, es gibt eines für die IP-Adresse, den Hostnamen und dann etwaige Aliasnamen für den Host. </p><pre>pete@icebox:~$ cat /etc/hosts<br>127.0.0.1       localhost<br>127.0.1.1       icebox</pre><p>Sie sehen normalerweise Ihre localhost-Adresse standardmäßig in dieser Datei aufgeführt. Sie können auch den Zugriff auf Hosts verwalten, indem Sie die Dateien /etc/hosts.deny oder /etc/hosts.allow ändern. Wenn Sie jedoch sicherheitsbewusst sind, ist dies nicht wirklich der richtige Weg, und Sie sollten stattdessen Ihre Firewall-Regeln ändern. </p><p>Lassen Sie uns ein lustiges Beispiel für /etc/hosts sehen. Ändern Sie die Datei und fügen Sie eine Zeile für hinzu:</p><pre>123.45.6.7  www.google.com</pre><p>Speichern Sie die Datei und gehen Sie jetzt zu www.google.com. Haben Sie Probleme? Nun, das liegt daran, dass wir www.google.com gerade auf eine völlig falsche IP-Adresse abgebildet haben. Da unsere Hosts zuerst lokal nach IP-Adresszuordnungen suchen, erreichen sie DNS nie, um google.com zu finden. </p><p><b>/etc/resolv.conf</b></p><p>Traditionell haben wir eine Datei namens /etc/resolv.conf verwendet, um DNS-Namensserver für effizientere Abfragen zuzuordnen. Mit den Verbesserungen, die an DNS vorgenommen wurden, ist diese Datei jedoch oft irrelevant. Tatsächlich können Sie in meinem Beispiel unten sehen, dass /etc/resolv.conf nicht manuell verwaltet wird. Konsultieren Sie die distributions-spezifischen Einstellungen, um DNS-Namensserverzuordnungen zu verwalten.</p><pre>conf(5)-Datei für von resolvconf(8) generierten glibc-resolver(3)<br>#     DIESE DATEI NICHT MANUELL BEARBEITEN -- IHRE ÄNDERUNGEN WERDEN ÜBERSCHRIEBEN<br>nameserver 127.0.1.1<br>search localdomain</pre>",
  "exercise": "Keine Übungen für diese Lektion.",
  "quizQuestion": "Welche Datei wird verwendet, um Hostnamen auf unseren Maschinen IP-Adressen zuzuordnen?",
  "quizAnswer": "/etc/hosts",
  "slug": "etchosts"
}