{
  "id": 3,
  "title": "cd (Cambiar Directorio)",
  "lessonContent": "Ahora que sabes dónde estás, veamos si podemos movernos un poco por el sistema de archivos. Recuerda que necesitaremos navegar usando rutas. Hay dos formas diferentes de especificar una ruta, con rutas absolutas y relativas. \n\n<ul>\n<li>Ruta absoluta: Esta es la ruta desde el directorio raíz. El raíz es el jefe supremo. El directorio raíz comúnmente se muestra como una barra inclinada. Cada vez que tu ruta comienza con / significa que estás partiendo desde el directorio raíz. Por ejemplo, /home/pete/Desktop.</li>\n\n<li>Ruta relativa: Esta es la ruta desde donde te encuentras actualmente en el sistema de archivos. Si estuviera en la ubicación /home/pete/Documents y quisiera ir a un directorio dentro de Documents llamado taxes, no tengo que especificar toda la ruta desde la raíz como /home/pete/Documents/taxes, puedo simplemente ir a taxes/ en su lugar.</li>\n</ul>\n\nAhora que sabes cómo funcionan las rutas, solo necesitamos algo que nos ayude a cambiar al directorio que queremos. Afortunadamente, tenemos cd o “cambiar directorio” para hacer eso. \n\n<pre>$ cd /home/pete/Pictures</pre> \n\nAsí que ahora he cambiado mi ubicación de directorio a /home/pete/Pictures.\n\nAhora desde este directorio tengo una carpeta adentro llamada Hawaii, puedo navegar a esa carpeta con:\n\n<pre>$ cd Hawaii</pre>\n\n¿Notaste cómo solo usé el nombre de la carpeta? Es porque ya estaba en /home/pete/Pictures.\n\nPuede ser bastante agotador navegar con rutas absolutas y relativas todo el tiempo, afortunadamente hay algunos atajos para ayudarte. \n\n<ul>\n<li>. (directorio actual). Este es el directorio en el que te encuentras actualmente. </li>\n<li>.. (directorio anterior). Te lleva al directorio encima de tu actual.</li>\n<li>~ (directorio de inicio). Este directorio se establece por defecto en tu “directorio de inicio”. Como /home/pete.</li>\n<li>- (directorio anterior). Esto te llevará al directorio anterior en el que estabas justo antes.</li>\n</ul>\n\n<pre>$ cd .\n$ cd ..\n$ cd ~\n$ cd -\n</pre>\n¡Pruébalos!",
  "exercise": "<ol>\n<li>Ejecuta el comando cd sin ninguna bandera, ¿a dónde te lleva?</li>\n</ol>",
  "quizQuestion": "Si estás en /home/pete/Pictures y quieres ir a /home/pete, ¿cuál es un buen atajo para usar?",
  "quizAnswer": "cd ..",
  "slug": "cambiardirectoriocomandocd"
}