{
  "id": 4,
  "title": "ls (Listar Directorios)",
  "lessonContent": "Ahora que sabemos cómo movernos por el sistema, ¿cómo averiguamos qué está disponible para nosotros? En este momento es como si estuviéramos moviéndonos a ciegas. Bueno, podemos usar el maravilloso comando ls para listar el contenido de directorios. El comando ls mostrará directorios y archivos en el directorio actual por defecto, sin embargo, puedes especificar la ruta de la cual deseas listar los directorios.\n\n<pre>$ ls\n$ ls /home/pete</pre>\n\nls es una herramienta bastante útil, también te muestra información detallada sobre los archivos y directorios que estás viendo.\n\nTambién ten en cuenta que no todos los archivos en un directorio serán visibles. Los nombres de archivo que comienzan con . están ocultos, sin embargo, puedes verlos con el comando ls y pasarle la bandera -a (a por todos).\n\n<pre>$ ls -a</pre>\n\nTambién hay una bandera ls más útil, -l para largo, esto muestra una lista detallada de archivos en un formato largo. Esto te mostrará información detallada, comenzando desde la izquierda: permisos de archivo, número de enlaces, nombre del propietario, grupo del propietario, tamaño del archivo, marca de tiempo de la última modificación y nombre de archivo/directorio.\n\n<pre>$ ls -l</pre>\n\n<pre>pete@icebox:~$ ls -l\ntotal 80\ndrwxr-x--- 7 pete penguingroup   4096 Nov 20 16:37 Desktop\ndrwxr-x--- 2 pete penguingroup   4096 Oct 19 10:46  Documents\ndrwxr-x--- 4 pete penguingroup   4096 Nov 20 09:30 Downloads\ndrwxr-x--- 2 pete penguingroup   4096 Oct  7 13:13   Music\ndrwxr-x--- 2 pete penguingroup   4096 Sep 21 14:02 Pictures\ndrwxr-x--- 2 pete penguingroup   4096 Jul 27 12:41   Public\ndrwxr-x--- 2 pete penguingroup   4096 Jul 27 12:41   Templates\ndrwxr-x--- 2 pete penguingroup   4096 Jul 27 12:41   Videos</pre>\n\nLos comandos tienen cosas llamadas banderas (o argumentos u opciones, como quieras llamarlo) para agregar más funcionalidad. Observa cómo agregamos -a y -l, bueno, puedes agregarlos juntos con -la. El orden de las banderas determina en qué orden va, la mayoría de las veces esto no importa realmente, por lo que también puedes hacer ls -al y seguirá funcionando.\n\n<pre>$ ls -la</pre>",
  "exercise": "Ejecuta ls con diferentes banderas y observa la salida que recibes.",
  "quizQuestion": "¿Qué comando usarías para ver archivos ocultos?",
  "quizAnswer": "ls -a",
  "slug": "listdirectorieslscommand"
}