{
  "id": 2,
  "title": "Niveaux de privilège",
  "lessonContent": "Les prochaines leçons deviennent assez théoriques, donc si vous cherchez des choses pratiques, vous pouvez sauter et revenir plus tard.\n\nPourquoi avons-nous différentes couches d'abstraction pour l'espace utilisateur et le noyau ? Pourquoi ne pouvons-nous pas combiner les deux pouvoirs en une seule couche ? Eh bien, il y a une très bonne raison pour laquelle ces deux couches existent séparément. Elles fonctionnent toutes les deux dans des modes différents, le noyau fonctionne en mode noyau et l'espace utilisateur fonctionne en mode utilisateur. \n\nEn mode noyau, le noyau a un accès complet au matériel, il contrôle tout. En mode espace utilisateur, il y a une très petite quantité de mémoire et de CPU sécurisés auxquels vous êtes autorisé à accéder. Fondamentalement, lorsque nous voulons faire quelque chose qui implique du matériel, lire des données de nos disques, écrire des données sur nos disques, contrôler notre réseau, etc., tout cela se fait en mode noyau. Pourquoi est-ce nécessaire ? Imaginez si votre machine était infectée par des logiciels espions, vous ne voudriez pas qu'elle puisse avoir un accès direct au matériel de votre système. Elle pourrait accéder à toutes vos données, à votre webcam, etc. et ce n'est pas bon. \n\nCes différents modes sont appelés niveaux de privilège (bien nommés pour les niveaux de privilège que vous obtenez) et sont souvent décrits comme des anneaux de protection. Pour rendre cette image plus facile à comprendre, disons que vous découvrez que Britney Spears est en ville dans votre klerb local, elle est protégée par ses groupies, puis ses gardes du corps personnels, puis le videur à l'extérieur du klerb. Vous voulez obtenir son autographe (parce que pourquoi pas ?), mais vous ne pouvez pas l'atteindre car elle est fortement protégée. Les anneaux fonctionnent de la même manière, l'anneau le plus interne correspond au niveau de privilège le plus élevé. Il y a deux niveaux principaux ou modes dans une architecture d'ordinateur x86. L'anneau n°3 est le privilège dans lequel les applications en mode utilisateur s'exécutent, l'anneau n°0 est le privilège dans lequel le noyau s'exécute. L'anneau n°0 peut exécuter n'importe quelle instruction système et bénéficie d'une confiance totale. Maintenant que nous savons comment fonctionnent ces niveaux de privilège, comment pouvons-nous écrire quelque chose sur notre matériel ? Ne serons-nous pas toujours dans un mode différent du noyau ? \n\nLa réponse est avec les appels système, les appels système nous permettent d'exécuter une instruction privilégiée en mode noyau puis de revenir en mode utilisateur.",
  "exercise": "Pas d'exercices pour cette leçon.",
  "quizQuestion": "Quel numéro d'anneau a les privilèges les plus élevés ?",
  "quizAnswer": "0",
  "slug": "niveauxprivilegekernel"
}