{
  "id": 4,
  "title": "Installation du Noyau",
  "lessonContent": "Ok, maintenant que nous avons terminé avec toutes ces choses ennuyeuses, parlons de l'installation et de la modification réelle des noyaux. Vous pouvez installer plusieurs noyaux sur votre système, vous vous souvenez de notre leçon sur le processus de démarrage ? Dans notre menu GRUB, nous pouvons choisir quel noyau démarrer. \n\nPour voir quelle version de noyau vous avez sur votre système, utilisez la commande suivante :\n\n<pre>$ uname -r\n3.19.0-43-generic</pre>\n\nLa commande uname affiche des informations système, la commande -r affichera toute la version de publication du noyau.\n\nVous pouvez installer le noyau Linux de différentes manières, vous pouvez télécharger le paquet source et le compiler à partir de la source ou l'installer à l'aide d'outils de gestion de paquets.\n\n<pre>$ sudo apt install linux-generic-lts-vivid</pre>\n\net ensuite redémarrez simplement dans le noyau que vous avez installé. Simple non ? En quelque sorte, vous devrez également installer d'autres paquets Linux tels que les en-têtes Linux, linux-image-generic, etc.). Vous pouvez également spécifier le numéro de version, donc la commande ci-dessus peut ressembler à ceci, <b>sudo apt install 3.19.0-43-generic</b>\n\nAlternativement, si vous voulez simplement la version de noyau mise à jour, utilisez simplement dist-upgrade, cela effectue des mises à jour de tous les paquets sur votre système :\n\n<pre>$ sudo apt dist-upgrade</pre>\n\nIl existe de nombreuses versions de noyaux différentes, certaines sont utilisées comme LTS (support à long terme), d'autres sont les dernières et les meilleures, la compatibilité peut être très différente entre les versions de noyau, vous voudrez peut-être essayer différents noyaux.",
  "exercise": "<ol>\n<li>Découvrez quelle version de noyau vous avez.</li>\n<li>Recherchez les différentes versions de noyaux disponibles</li>\n</ol>",
  "quizQuestion": "Comment voir la version du noyau de votre système ?",
  "quizAnswer": "uname -r",
  "slug": "installation-du-noyau"
}