{
  "id": 6,
  "title": "Modules du Noyau",
  "lessonContent": "Disons que j'ai une voiture de sport, j'investis beaucoup de temps et d'argent dedans. J'ajoute un aileron, une attache, un porte-vélos et d'autres choses aléatoires. Ces composants ne modifient pas réellement la fonctionnalité de base de la voiture et je peux les retirer et les ajouter très facilement. Le noyau utilise le même concept avec les modules du noyau.\n\nLe noyau en lui-même est une pièce logicielle monolithique, lorsque nous voulons ajouter le support pour un nouveau type de clavier, nous n'écrivons pas ce code directement dans le code du noyau. Tout comme nous ne fusionnerions pas un porte-vélos à notre voiture (enfin, peut-être que certaines personnes le feraient). Les modules du noyau sont des morceaux de code qui peuvent être chargés et déchargés dans le noyau à la demande. Ils nous permettent d'étendre la fonctionnalité du noyau sans ajouter au code du noyau de base. Nous pouvons également ajouter des modules sans devoir redémarrer le système (dans la plupart des cas).\n\n<b>Visualiser une liste des modules actuellement chargés</b>\n\n<pre>$ lsmod</pre>\n\n<b>Charger un module</b>\n\n<pre>$ sudo modprobe bluetooth</pre>\n\nModprobe essaie de charger le module depuis <b>/lib/modules/(version du noyau)/kernel/drivers</b>. Les modules du noyau peuvent également avoir des dépendances, modprobe charge nos dépendances de module si elles ne sont pas déjà chargées.\n\n<b>Retirer un module</b>\n\n<pre>$ sudo modprobe -r bluetooth</pre>\n\n<b>Chargement au démarrage</b>\n\nVous pouvez également charger des modules lors du démarrage du système, au lieu de les charger temporairement avec modprobe (qui seront déchargés lorsque vous redémarrez). Modifiez simplement le répertoire <b>/etc/modprobe.d</b> et ajoutez-y un fichier de configuration comme ceci :\n\n<pre>pete@icebox:~$ /etc/modprobe.d/peanutbutter.conf\n\noptions peanut_butter type=almond\n</pre>\n\nUn exemple un peu excentrique, mais si vous aviez un module nommé peanut_butter et que vous vouliez ajouter un paramètre de noyau pour type=almond, vous pouvez le charger au démarrage en utilisant ce fichier de configuration. Notez également que les modules du noyau ont leurs propres paramètres de noyau, donc vous voudrez en apprendre davantage sur le module spécifiquement pour en savoir plus.\n\n<b>Ne pas charger au démarrage</b>\n\nVous pouvez également vous assurer qu'un module ne se charge pas au démarrage en ajoutant un fichier de configuration comme ceci :\n\n<pre>pete@icebox:~$ /etc/modprobe.d/peanutbutter.conf\n\nblacklist peanut_butter\n</pre>",
  "exercise": "Déchargez votre module bluetooth avec modprobe et voyez ce qui se passe. Comment allez-vous résoudre cela ?",
  "quizQuestion": "Quelle commande est utilisée pour décharger un module ?",
  "quizAnswer": "modprobe -r",
  "slug": "modulesnoyau"
}