{
  "id": 5,
  "title": "env (Umgebung)",
  "lessonContent": "Führen Sie den folgenden Befehl aus: \n\n<pre>$ echo $HOME</pre>\n\nSie sollten den Pfad zu Ihrem Home-Verzeichnis sehen, meiner sieht so aus: /home/pete. \n\nWas bewirkt dieser Befehl? \n\n<pre>$ echo $USER </pre>\n\nSie sollten Ihren Benutzernamen sehen!\n\nWoher stammen diese Informationen? Sie stammen von Ihren Umgebungsvariablen. Sie können diese anzeigen, indem Sie\n\n<pre>$ env </pre>\n\neingeben. Dies gibt eine Menge Informationen über die Umgebungsvariablen aus, die Sie derzeit festgelegt haben. Diese Variablen enthalten nützliche Informationen, die die Shell und andere Prozesse verwenden können.\n\nHier ist ein kurzes Beispiel:\n\n<pre>\nPATH=/usr/local/sbin:/usr/local/bin:/usr/sbin:/bin\nPWD=/home/user\nUSER=pete\n</pre>\n\n\nEine besonders wichtige Variable ist die PATH-Variable. Sie können auf diese Variablen zugreifen, indem Sie einen $ vor den Variablennamen setzen, wie folgt:\n\n<pre>\n$ echo $PATH\n/usr/local/sbin:/usr/local/bin:/usr/sbin:/bin\n</pre>\n\nDies gibt eine Liste von Pfaden zurück, die durch einen Doppelpunkt getrennt sind und die Ihr System durchsucht, wenn es einen Befehl ausführt. Angenommen, Sie laden manuell ein Paket aus dem Internet herunter, installieren es und legen es in ein nicht standardmäßiges Verzeichnis und möchten diesen Befehl ausführen. Sie geben $ coolcommand ein und die Eingabeaufforderung gibt den Fehler 'Befehl nicht gefunden' aus. Nun, das ist seltsam, Sie betrachten die Binärdatei in einem Ordner und wissen, dass sie existiert. Was passiert ist, dass die $PATH-Variable dieses Verzeichnis nicht für diese Binärdatei überprüft, daher wird ein Fehler ausgegeben. \n\nAngenommen, Sie hätten eine Vielzahl von Binärdateien, die Sie aus diesem Verzeichnis ausführen möchten, Sie können einfach die PATH-Variable ändern, um dieses Verzeichnis in Ihre PATH-Umgebungsvariable aufzunehmen.",
  "exercise": "Was gibt die folgende Ausgabe aus? Warum?\n<pre>$ echo $HOME</pre>",
  "quizQuestion": "Wie sehen Sie Ihre Umgebungsvariablen?",
  "quizAnswer": "env",
  "slug": "envenvironment"
}