{
  "id": 2,
  "title": "D'abord quelques fichiers journaux standard. Journal par service.",
  "lessonContent": "Le service syslog gère et envoie des journaux vers le journal système. Rsyslog est une version avancée de syslog, la plupart des distributions Linux devraient utiliser cette nouvelle version. La sortie de tous les journaux collectés par le service syslog se trouve dans /var/log/syslog (chaque message sauf les messages d'authentification).\n\nPour savoir quels fichiers sont gérés par notre journal système, consultez les fichiers de configuration dans /etc/rsyslog.d:\n\n<pre>\npete@icebox:~$ less /etc/rsyslog.d/50-default.conf \n#\nauth,authpriv.*                 /var/log/auth.log\n*.*;auth,authpriv.none          -/var/log/syslog\n#cron.*                         /var/log/cron.log\n#daemon.*                       -/var/log/daemon.log\nkern.*                          -/var/log/kern.log\n#lpr.*                          -/var/log/lpr.log\nmail.*                          -/var/log/mail.log\n#user.*                         -/var/log/user.log\n</pre>\n\nCes règles pour les fichiers journaux sont indiquées par le sélecteur dans la colonne de gauche et l'action dans la colonne de droite. L'action nous indique où envoyer les informations de journalisation, dans un fichier, une console, etc. Rappelez-vous que toutes les applications et services n'utilisent pas rsyslog pour gérer leurs journaux, donc si vous voulez savoir spécifiquement ce qui est journalisé, vous devrez regarder à l'intérieur de ce répertoire.\n\nVoyons en fait la journalisation en action, vous pouvez envoyer manuellement un journal avec la commande logger:\n\n<pre>\nlogger -s Bonjour\n</pre>\n\nMaintenant, regardez à l'intérieur de votre /var/log/syslog et vous devriez voir cette entrée dans vos journaux!",
  "exercise": "Consultez votre fichier de configuration /etc/rsyslog.d et voyez ce qui est également journalisé via le journal système.",
  "quizQuestion": "Quelle commande pouvez-vous utiliser pour journaliser manuellement un message?",
  "quizAnswer": "logger",
  "slug": "syslog"
}