{
  "id": 1,
  "title": "Journalisation du système",
  "lessonContent": "Les services, le noyau, les démons, etc. de votre système font constamment quelque chose, ces données sont en fait envoyées pour être enregistrées sur votre système sous forme de journaux. Cela nous permet d'avoir un journal lisible par l'homme des événements qui se produisent sur notre système. Ces données sont généralement conservées dans le répertoire /var, le répertoire /var est l'endroit où nous conservons nos données variables, telles que les journaux !\n\nComment ces messages sont-ils même reçus sur votre système ? Il existe un service appelé syslog qui envoie ces informations au journal système. \n\nSyslog contient en fait de nombreux composants, l'un des plus importants est un démon en cours d'exécution appelé syslogd (les distributions Linux plus récentes utilisent rsyslogd), qui attend que des messages d'événements se produisent et filtre ceux dont il veut être informé, et en fonction de ce qu'il est censé faire avec ce message, il l'enverra à un fichier, à votre console ou ne fera rien avec.\n\nVous penseriez que ce journal système est l'endroit centralisé pour gérer les journaux, mais malheureusement ce n'est pas le cas. Vous verrez de nombreuses applications qui écrivent leurs propres règles de journalisation et génèrent différents fichiers journaux, cependant en général le format des journaux devrait inclure une horodatage et les détails de l'événement. \n\nVoici un exemple d'une ligne de syslog :\n\n<pre>\npete@icebox:~$ less /var/log/syslog\nJan 27 07:41:32 icebox anacron[4650]: Job `cron.weekly' started\n</pre>\n\nIci, nous pouvons voir qu'à Jan 27 07:41:32 notre service cron a exécuté la tâche cron.weekly. Vous pouvez consulter tous les messages d'événements collectés par syslog dans le fichier /var/log/syslog.",
  "exercise": "Consultez votre fichier /var/log/syslog et voyez ce qui se passe d'autre sur votre machine.",
  "quizQuestion": "Quel est le démon qui gère les journaux sur les nouveaux systèmes Linux ?",
  "quizAnswer": "rsyslogd",
  "slug": "journalisationsysteme"
}