{
  "id": 6,
  "title": "Módulos do Kernel",
  "lessonContent": "Digamos que eu tenha um carro legal, invisto muito tempo e dinheiro nele. Adiciono um aerofólio, engate, suporte para bicicleta e outras coisas aleatórias. Esses componentes na verdade não alteram a funcionalidade principal do carro e posso removê-los e adicioná-los facilmente. O kernel usa o mesmo conceito com módulos do kernel.\n\nO kernel em si é uma peça de software monolítica, quando queremos adicionar suporte para um novo tipo de teclado, não escrevemos esse código diretamente no código do kernel. Assim como não acoplaríamos um suporte para bicicleta ao nosso carro (bem, talvez algumas pessoas fizessem isso). Os módulos do kernel são pedaços de código que podem ser carregados e descarregados no kernel sob demanda. Eles nos permitem estender a funcionalidade do kernel sem realmente adicionar ao código principal do kernel. Também podemos adicionar módulos sem precisar reiniciar o sistema (na maioria dos casos).\n\n<b>Visualizar uma lista de módulos atualmente carregados</b>\n\n<pre>$ lsmod</pre>\n\n<b>Carregar um módulo</b>\n\n<pre>$ sudo modprobe bluetooth</pre>\n\nModprobe tenta carregar o módulo de <b>/lib/modules/(versão do kernel)/kernel/drivers</b>. Os módulos do kernel também podem ter dependências, modprobe carrega as dependências do nosso módulo se elas ainda não estiverem carregadas.\n\n<b>Remover um módulo</b>\n\n<pre>$ sudo modprobe -r bluetooth</pre>\n\n<b>Carregar na inicialização</b>\n\nVocê também pode carregar módulos durante a inicialização do sistema, em vez de carregá-los temporariamente com modprobe (que será descarregado quando você reiniciar). Basta modificar o diretório <b>/etc/modprobe.d</b> e adicionar um arquivo de configuração nele da seguinte forma:\n\n<pre>pete@icebox:~$ /etc/modprobe.d/peanutbutter.conf\n\noptions peanut_butter type=almond\n</pre>\n\nUm exemplo um pouco extravagante, mas se você tivesse um módulo chamado peanut_butter e quisesse adicionar um parâmetro de kernel para type=almond, você pode fazer com que ele seja carregado na inicialização usando este arquivo de configuração. Também observe que os módulos do kernel têm seus próprios parâmetros de kernel, então você vai querer ler sobre o módulo especificamente para saber mais.\n\n<b>Não carregar na inicialização</b>\n\nVocê também pode garantir que um módulo não seja carregado na inicialização adicionando um arquivo de configuração da seguinte forma:\n\n<pre>pete@icebox:~$ /etc/modprobe.d/peanutbutter.conf\n\nblacklist peanut_butter\n</pre>",
  "exercise": "Descarregue o seu módulo bluetooth com modprobe e veja o que acontece. Como você vai corrigir isso?",
  "quizQuestion": "Qual comando é usado para descarregar um módulo?",
  "quizAnswer": "modprobe -r",
  "slug": "kernelmodules"
}