{
  "id": 2,
  "title": "Níveis de Privilégio",
  "lessonContent": "As próximas lições ficam bastante teóricas, então se você está procurando por algo prático, pode pular adiante e voltar depois.\n\nPor que temos diferentes camadas de abstração para o espaço do usuário e o kernel? Por que não podemos combinar ambos os poderes em uma única camada? Bem, existe uma razão muito boa para essas duas camadas existirem separadamente. Ambas operam em modos diferentes, o kernel opera no modo kernel e o espaço do usuário opera no modo usuário. \n\nNo modo kernel, o kernel tem acesso completo ao hardware, ele controla tudo. No modo espaço do usuário, há uma pequena quantidade de memória segura e CPU que você pode acessar. Basicamente, quando queremos fazer qualquer coisa que envolva hardware, ler dados de nossos discos, escrever dados em nossos discos, controlar nossa rede, etc., tudo é feito no modo kernel. Por que isso é necessário? Imagine se sua máquina estivesse infectada com spyware, você não gostaria que ele tivesse acesso direto ao hardware do seu sistema. Ele pode acessar todos os seus dados, sua webcam, etc., e isso não é bom. \n\nEsses modos diferentes são chamados de níveis de privilégio (apropriadamente nomeados pelos níveis de privilégio que você obtém) e são frequentemente descritos como anéis de proteção. Para facilitar a compreensão, vamos dizer que você descobre que Britney Spears está na cidade em seu klerb local, ela está protegida por seus seguranças pessoais, depois por seus guarda-costas pessoais e depois pelo segurança na porta do klerb. Você quer conseguir um autógrafo dela (por que não?), mas não consegue chegar até ela porque ela está muito protegida. Os anéis funcionam da mesma maneira, o anel mais interno corresponde ao nível de privilégio mais alto. Existem dois níveis principais ou modos em uma arquitetura de computador x86. O Anel #3 é o privilégio no qual as aplicações do modo usuário são executadas, o Anel #0 é o privilégio no qual o kernel é executado. O Anel #0 pode executar qualquer instrução do sistema e tem total confiança. Agora que sabemos como esses níveis de privilégio funcionam, como conseguimos escrever algo em nosso hardware? Não estaremos sempre em um modo diferente do kernel? \n\nA resposta está nas chamadas de sistema, as chamadas de sistema nos permitem executar uma instrução privilegiada no modo kernel e depois voltar ao modo usuário.",
  "exercise": "Não há exercícios para esta lição.",
  "quizQuestion": "Qual número de anel tem os privilégios mais altos?",
  "quizAnswer": "0",
  "slug": "kernelprivilegelevels"
}