{
  "id": 4,
  "title": "Шпаргалка по подсетям",
  "lessonContent": "Мне не хочется добавлять этот раздел, в реальном мире вам скорее всего никогда не придется делать математику подсети вручную, однако если вас спрашивают об этом на собеседовании, вам придется знать, как конвертировать в двоичную форму для подсетей. К счастью, есть несколько арифметических хитростей, которые вы можете запомнить. \n\nСначала запомните ваши вычисления в двоичной системе, просто сделайте это:\n\n<ul>\n<li>2^1 = 2</li>\n<li>2^2 = 4</li>\n<li>2^3 = 8</li>\n<li>2^4 = 16</li>\n<li>2^5 = 32</li>\n<li>2^6 = 64</li>\n<li>2^7 = 128</li>\n<li>2^8 = 256</li>\n<li>2^9 = 512</li>\n<li>2^10 = 1024</li>\n<li>2^11 = 2048</li>\n<li>2^12 = 4096</li>\n</ul>\n\n<b>Таблица десятичных чисел в двоичной системе</b>\n\n<pre>\n1   1  1  1  1 1 1 1\n128 64 32 16 8 4 2 1\n</pre>\n\nЕсть много причин, почему следующая таблица выглядит так, как она выглядит, если вас интересует, как она работает, есть много ресурсов в Интернете.\n\nХорошо, запомнили это? Давайте быстро конвертируем десятичное число в двоичное:\n\n<b>Конвертировать 192.168.23.43 в двоичную систему</b>\n\nПомните: 128 / 64 / 32 / 16 / 8 / 4 / 2 / 1\n\nДавайте пройдемся по конвертации первого октета в двоичную систему, и вы поймете, как это работает.\n\n<ol>\n<li>Можете ли вы вычесть 192 - 128? Да, поэтому первый бит равен 1</li>\n<li>192 - 128 = 64, следующее число в таблице - 64, можете ли вы вычесть 64 - 64? Да, поэтому второй бит равен 1</li>\n<li>У нас закончились числа для вычитания, поэтому наша двоичная форма числа 192 - 11000000</li>\n</ol>\n\n<b>Конвертировать двоичное число 11000000 в десятичное</b>\n\nДля конвертации двоичного числа в десятичное вы складываете числа, у которых стоит 1, поэтому:\n\n128 + 64 + 0 + 0 + 0 + 0 + 0 + 0 = 192!",
  "exercise": "Посмотрите на свой IP-адрес и маску подсети и посчитайте, сколько у вас может быть хостов в вашей подсети.",
  "quizQuestion": "Каково двоичное представление числа 123?",
  "quizAnswer": "1111011",
  "slug": "шпаргалка-по-подсетям"
}