{
  "id": 2,
  "title": "Подсети",
  "lessonContent": "Как я могу определить, находлюсь ли я в одной сети с Пэтти? Ну, мы можем просто посмотреть на подсеть, сокращенно от подсетевая сеть. Подсеть - это группа хостов с IP-адресами, которые похожи определенным образом. Эти хосты обычно находятся близко друг к другу, и вы легко можете отправлять данные к хостам в одной подсети и от них. Подумайте о ней как о отправке почты в один и тот же почтовый индекс, это намного проще, чем отправлять почту в другой штат. \n\nНапример, все хосты с IP-адресом, начинающимся с 123.45.67, будут находиться в одной подсети. Мой хост имеет IP-адрес 123.45.67.8, а у Пэтти - 123.45.67.9. Общие цифры - это мой префикс сети, а 8 и 9 - наши хосты, поэтому моя сеть такая же, как у Пэтти. Подсеть делится на префикс сети, такой как 123.45.67.0, и маску подсети.\n\n<b>Маски подсети</b>\n\nМаски подсети определяют, какая часть вашего IP-адреса является сетевой частью, а какая - хостовой. \n\nТипичная маска подсети может выглядеть примерно так:\n\n<pre>255.255.255.0</pre>\n\nЧасть 255 на самом деле является нашей маской. Чтобы сделать это немного понятнее, помните, как мы называем каждый октет 8 битами? В компьютерной науке бит обозначается 0 или 1 в двоичной форме. Когда используются двоичные числа, 1 означает включено, а 0 - выключено. Итак, что означает 8 нулей или единиц?\n\nВбейте в Google \"калькулятор двоичного в десятичный формат\" и преобразуйте 11111111 в десятичную форму. Что у вас получится? 255! Таким образом, октет находится в диапазоне от 0 до 255. Итак, если у нас есть маска подсети 255.255.255.0 и IP-адрес 192.168.1.0, сколько хостов находится в этой подсети? Мы узнаем ответ на этот вопрос в нашем уроке по математике подсети.\n\nТакже, когда мы говорим о нашей подсети, мы обычно обозначаем ее префикс сети, за которым следует маска подсети:\n\n<pre>123.234.0.0/255.255.0.0</pre>\n\n<b>Почему?</b>\n\nПочему мы создаем подсети? Подсети используются для сегментации сетей и контроля потока трафика внутри этой сети. Таким образом, хост в одной подсети не может взаимодействовать с другим хостом в другой подсети. \n\nНо подождите минутку, а если я хочу подключиться к другим хостам, например, yahoo.com? Тогда вам нужно соединить подсети вместе. Для этого просто найдите хосты, которые подключены к более чем одной подсети. Например, если мой хост на 192.168.1.129 подключен к локальной сети 192.168.1.129/24, он может достичь любых хостов в этой сети. Чтобы достичь хостов в остальной части Интернета, ему нужно общаться через маршрутизатор. Традиционно, в большинстве сетей с маской подсети 255.255.255.0 маршрутизатор обычно находится по адресу 1 в подсети, то есть 192.168.1.1. Теперь у этого маршрутизатора будет порт, который соединяет его с другой подсетью (больше в курсе по маршрутизации). Некоторые IP-адреса (частные сети) не видны в Интернете, и у нас есть такие вещи, как NAT (больше об этом позже).",
  "exercise": "Используйте ifconfig для просмотра вашей маски подсети.",
  "quizQuestion": "Верно или неверно, подсеть состоит из маски подсети и префикса сети.",
  "quizAnswer": "Верно",
  "slug": "podseti"
}