{
  "id": 4,
  "title": "Monitoreo de CPU",
  "lessonContent": "Vamos a repasar un comando útil, <b>uptime</b>.\n\n<pre>\npete@icebox:~$ uptime\n 17:23:35 encendido 1 día,  5:59,  2 usuarios,  carga promedio: 0.00, 0.02, 0.05\n</pre>\n\nHablamos sobre uptime en la primera lección de este curso, pero no hemos revisado el campo de carga promedio. Las cargas promedio son una buena manera de ver la carga de CPU en tu sistema. Estos números representan la carga promedio de la CPU en intervalos de 1, 5 y 15 minutos. ¿Qué quiero decir con carga de CPU? La carga de CPU es el número promedio de procesos que están esperando ser ejecutados por la CPU.\n\nDigamos que tienes una CPU de un solo núcleo, piensa en este núcleo como un carril único en el tráfico. Si es hora punta en la autopista, este carril va a estar muy ocupado y el tráfico va a estar al 100% o una carga de 1. Ahora el tráfico se ha vuelto tan malo que está congestionando la autopista y está poniendo las carreteras normales ocupadas con el doble de autos, podemos decir que tu carga es del 200% o una carga de 2. Ahora digamos que se despeja un poco y solo hay la mitad de autos en el carril de la autopista, podemos decir que la carga del carril es de 0.5. Cuando el tráfico es inexistente y podemos llegar a casa más rápido, la carga debería ser idealmente muy baja, como el tráfico de las 2 am. Los autos en este caso son procesos y estos procesos solo están esperando para salir de la autopista y llegar a casa.\n\nAhora, solo porque tienes una carga promedio de 1 no significa que tu computadora esté funcionando lentamente. La mayoría de las máquinas modernas hoy en día tienen múltiples núcleos. Si tuvieras un procesador de cuatro núcleos (4 núcleos) y tu carga promedio es de 1, realmente solo está afectando al 25% de tu CPU. Piensa en cada núcleo como un carril en el tráfico. Puedes ver la cantidad de núcleos que tienes en tu sistema con <b>cat /proc/cpuinfo</b>.\n\nAl observar la carga promedio, debes tener en cuenta el número de núcleos, si descubres que tu máquina siempre está utilizando una carga por encima del promedio, podría haber algo mal sucediendo.",
  "exercise": "Verifica la carga promedio de tu sistema y observa qué está haciendo.",
  "quizQuestion": "¿Qué comando puedes usar para ver la carga promedio?",
  "quizAnswer": "uptime",
  "slug": "monitoreo-de-cpu"
}