{
  "id": 2,
  "title": "lsof y fuser",
  "lessonContent": "Imaginemos que has conectado una unidad USB y has empezado a trabajar en algunos archivos. Una vez que hayas terminado, desmontas el dispositivo USB y recibes un error \"Dispositivo o recurso ocupado\". ¿Cómo averiguarías qué archivos en la unidad USB siguen en uso? En realidad, hay dos herramientas que puedes utilizar para esto: \n\n<b>lsof</b>\n\nRecuerda que los archivos no son solo archivos de texto, imágenes, etc., son todo en el sistema, discos, tuberías, sockets de red, dispositivos, etc. Para ver qué está en uso por un proceso, puedes usar el comando lsof (abreviatura de \"listar archivos abiertos\"), esto te mostrará una lista de todos los archivos abiertos y su proceso asociado. \n\n<pre>\npete@icebox:~$ lsof .\nCOMMAND    PID  USER   FD   TYPE DEVICE SIZE/OFF NODE NAME\nlxsession 1491 pete  cwd    DIR    8,6     4096  131 .\nupdate-no 1796 pete  cwd    DIR    8,6     4096  131 .\nnm-applet 1804 pete  cwd    DIR    8,6     4096  131 .\nindicator 1809 pete  cwd    DIR    8,6     4096  131 .\nxterm     2205 pete  cwd    DIR    8,6     4096  131 .\nbash      2207 pete  cwd    DIR    8,6     4096  131 .\nlsof      5914 pete  cwd    DIR    8,6     4096  131 .\nlsof      5915 pete  cwd    DIR    8,6     4096  131 .\n</pre>\n\nAhora puedo ver qué procesos están manteniendo abierto el dispositivo/archivo. En nuestro ejemplo de USB, también puedes finalizar estos procesos para poder desmontar esta molesta unidad.\n\n<b>fuser</b>\n\nOtra forma de rastrear un proceso es el comando fuser (abreviatura de \"usuario de archivo\"), esto te mostrará información sobre el proceso que está utilizando el archivo o el usuario de archivo. \n\n<pre>\npete@icebox:~$ fuser -v .\n                     USER        PID ACCESS COMMAND\n/home/pete:         pete  1491 ..c.. lxsession\n                     pete  1796 ..c.. update-notifier\n                     pete  1804 ..c.. nm-applet\n                     pete  1809 ..c.. indicator-power\n                     pete  2205 ..c.. xterm\n                     pete  2207 ..c.. bash\n</pre>\n\nPodemos ver qué procesos están utilizando actualmente nuestro directorio /home/pete. Las herramientas lsof y fuser son muy similares, familiarízate con estas herramientas e intenta usarlas la próxima vez que necesites rastrear un archivo o proceso.",
  "exercise": "Lee las páginas de manual de lsof y fuser, hay mucha información que no cubrimos que te permite tener una mayor flexibilidad con estas herramientas.",
  "quizQuestion": "¿Qué comando se utiliza para listar archivos abiertos y su información de proceso?",
  "quizAnswer": "lsof",
  "slug": "rastreandoprocesoslsoffuser"
}