{
  "id": 3,
  "title": "Анатомия диска",
  "lessonContent": "Жесткие диски могут быть разделены на разделы, фактически создавая несколько блочных устройств. Например, /dev/sda1 и /dev/sda2, где /dev/sda - весь диск, а /dev/sda1 - первый раздел на этом диске. Разделы чрезвычайно полезны для разделения данных, и если вам нужна определенная файловая система, вы легко можете создать раздел вместо того, чтобы делать весь диск одним типом файловой системы.\n\n<b>Таблица разделов</b>\n\nНа каждом диске есть таблица разделов, которая сообщает системе, как диск разделен. Эта таблица указывает, где начинаются и заканчиваются разделы, какие разделы загружаемые, какие сектора диска выделены для какого раздела и т. д. Существует две основные схемы таблиц разделов: Master Boot Record (MBR) и GUID Partition Table (GPT).\n\n<b>Раздел</b>\n\nДиски состоят из разделов, которые помогают нам организовывать наши данные. На диске может быть несколько разделов, которые не могут перекрываться. Если есть пространство, которое не выделено под раздел, то оно называется свободным пространством. Типы разделов зависят от вашей таблицы разделов. Внутри раздела можно иметь файловую систему или выделить раздел под другие вещи, такие как подкачка (мы скоро к этому вернемся).\n\n<i>MBR</i>\n\n<ul>\n<li>Традиционная таблица разделов, использовалась как стандарт</li>\n<li>Может иметь основные, расширенные и логические разделы</li>\n<li>MBR имеет ограничение в четыре основных раздела</li>\n<li>Дополнительные разделы можно создать, превратив основной раздел в расширенный раздел (на диске может быть только один расширенный раздел). Затем внутри расширенного раздела добавляются логические разделы. Логические разделы используются так же, как и любой другой раздел. Смешно, я знаю.</li>\n<li>Поддерживает диски до 2 терабайт</li>\n</ul>\n\n<i>GPT</i>\n\n<ul>\n<li>GUID Partition Table (GPT) становится новым стандартом для разделения дисков</li>\n<li>Имеет только один тип раздела, и их можно создавать много</li>\n<li>Каждый раздел имеет глобально уникальный идентификатор (GUID)</li>\n<li>В основном используется с загрузкой на основе UEFI (мы рассмотрим детали в другом курсе)</li>\n</ul>\n\n<b>Структура файловой системы</b>\n\nМы знаем из предыдущего урока, что файловая система - это организованная коллекция файлов и каталогов. В простейшей форме она состоит из базы данных для управления файлами и самих файлов, но мы пойдем немного глубже.\n\n<ul>\n<li>Загрузочный блок - он находится в первых нескольких секторах файловой системы и на самом деле не используется файловой системой. Он содержит информацию, используемую для загрузки операционной системы. Операционной системе нужен только один загрузочный блок. Если у вас несколько разделов, у них будет загрузочные блоки, но многие из них не используются.</li>\n<li>Суперблок - это один блок, который следует за загрузочным блоком, и он содержит информацию о файловой системе, такую как размер таблицы инодов, размер логических блоков и размер файловой системы.</li>\n<li>Таблица инодов - представьте себе это как базу данных, управляющую нашими файлами (у нас есть целый урок об инодах, так что не волнуйтесь). У каждого файла или каталога есть уникальная запись в таблице инодов, и в ней содержится различная информация о файле.</li>\n<li>Блоки данных - это фактические данные для файлов и каталогов.</li>\n</ul>\n\nДавайте посмотрим на различные таблицы разделов. Ниже приведен пример раздела, использующего таблицу разделов MBR (msdos). Вы можете увидеть основные, расширенные и логические разделы на машине.\n\n<pre>\npete@icebox:~$ sudo parted -l\nModel: Seagate (scsi)\nDisk /dev/sda: 21.5GB\nSector size (logical/physical): 512B/512B\nPartition Table: msdos\n\nNumber  Start   End     Size    Type      File system     Flags\n 1      1049kB  6860MB  6859MB  primary   ext4            boot\n 2      6861MB  21.5GB  14.6GB  extended\n 5      6861MB  7380MB  519MB   logical   linux-swap(v1)\n 6      7381MB  21.5GB  14.1GB  logical   xfs\n</pre>\n\n\nЭтот пример GPT, использующий только уникальный идентификатор для разделов.\n\n<pre>\nModel: Thumb Drive (scsi)\nDisk /dev/sdb: 4041MB\nSector size (logical/physical): 512B/512B\nPartition Table: gpt\n\nNumber  Start   End     Size     File system  Name        Flags\n 1      17.4kB  1000MB  1000MB                first\n 2      1000MB  4040MB  3040MB                second\n</pre>",
  "exercise": "Запустите <b>parted -l</b> на своей машине и оцените результаты.",
  "quizQuestion": "Какой тип раздела используется для создания более чем 4 разделов в схеме разделения MBR?",
  "quizAnswer": "расширенный",
  "slug": "anatomyofadisk"
}