{
  "id": 4,
  "title": "Разбиение диска",
  "lessonContent": "Давайте проведем практические действия с файловыми системами, работая через процесс на USB-накопителе. Если у вас его нет, не беспокойтесь, вы все равно можете следовать за этими следующими уроками. \n\nСначала нам нужно разбить наш диск на разделы. Для этого существует много инструментов: \n\n<ul>\n<li>fdisk - базовый инструмент разбиения командной строки, не поддерживает GPT</li>\n<li>parted - это инструмент командной строки, который поддерживает как MBR, так и GPT разбиение</li>\n<li>gparted - это графическая версия parted</li>\n<li>gdisk - fdisk, но не поддерживает MBR, только GPT</li>\n</ul>\n\nДавайте используем parted для разбиения наших разделов. Допустим, я подключаю USB-устройство, и мы видим, что имя устройства - /dev/sdb2. \n\n<b>Запуск parted</b>\n\n<pre>$ sudo parted</pre>\n\nВы войдете в инструмент parted, здесь вы можете выполнять команды для разбиения вашего устройства. \n\n<b>Выбор устройства</b>\n\n<pre>select /dev/sdb2</pre>\n\nДля выбора устройства, с которым вы будете работать, выберите его по имени устройства.\n\n<b>Просмотр текущей таблицы разделов</b>\n\n<pre>\n(parted) print                                                            \nModel: Seagate (scsi)\nDisk /dev/sda: 21.5GB\nSector size (logical/physical): 512B/512B\nPartition Table: msdos\n\nNumber  Start   End     Size    Type      File system     Flags\n 1      1049kB  6860MB  6859MB  primary   ext4            boot\n 2      6861MB  21.5GB  14.6GB  extended\n 5      6861MB  7380MB  519MB   logical   linux-swap(v1)\n 6      7381MB  21.5GB  14.1GB  logical   xfs\n</pre>\n\nЗдесь вы увидите доступные разделы на устройстве. <b>Начало</b> и <b>конец</b> - это места, где разделы занимают место на жестком диске, вам нужно найти хорошее начальное и конечное местоположение для ваших разделов. \n\n<b>Разбиение устройства</b>\n\n<pre>mkpart primary 123 4567</pre>\n\nПросто выберите начальную и конечную точку и создайте раздел, вам нужно указать тип раздела в зависимости от используемой таблицы. \n\n<b>Изменение размера раздела</b>\n\nВы также можете изменить размер раздела, если у вас нет свободного места. \n\n<pre>resize 2 1245 3456</pre>\n\nВыберите номер раздела, а затем начальную и конечную точки, куда вы хотите изменить его размер. \n\nParted - очень мощный инструмент, и вам следует быть осторожным при разбиении ваших дисков.",
  "exercise": "Разбить USB-накопитель так, чтобы половина диска была ext4, а другая половина - свободным местом.",
  "quizQuestion": "Какая команда parted используется для создания раздела?",
  "quizAnswer": "mkpart",
  "slug": "diskpartitioning"
}