{
  "id": 1,
  "title": "Иерархия файловой системы",
  "lessonContent": "На данном этапе вы, вероятно, уже хорошо знакомы с структурой каталогов вашей системы, если нет, то скоро будете. Файловые системы могут различаться по структуре, но в большинстве случаев они должны соответствовать стандарту иерархии файловой системы. \n\nВыполните команду <b>ls -l /</b>, чтобы увидеть перечень каталогов, перечень на вашем компьютере может отличаться от моего, но каталоги в основном должны выглядеть следующим образом:\n\n<ul>\n<li>/ - Корневой каталог всей иерархии файловой системы, все находится внутри этого каталога.</li>\n<li>/bin - Основные готовые к запуску программы (бинарники), включает в себя самые базовые команды, такие как ls и cp.</li>\n<li>/boot - Содержит файлы загрузчика ядра.</li>\n<li>/dev - Файлы устройств.</li>\n<li>/etc - Основной каталог конфигурации системы, должен содержать только файлы конфигурации, но не бинарные файлы.</li>\n<li>/home - Личные каталоги пользователей, содержит ваши документы, файлы, настройки и т. д.</li>\n<li>/lib - Содержит библиотечные файлы, которые могут использовать бинарники.</li>\n<li>/media - Используется как точка подключения для съемных носителей, таких как USB-накопители.</li>\n<li>/mnt - Временно подключаемые файловые системы.</li>\n<li>/opt - Дополнительные пакеты прикладного программного обеспечения.</li>\n<li>/proc - Информация о текущих запущенных процессах.</li>\n<li>/root - Домашний каталог пользователя root.</li>\n<li>/run - Информация о работающей системе с момента последней загрузки.</li>\n<li>/sbin - Содержит основные системные бинарники, обычно могут быть запущены только root-пользователем.</li>\n<li>/srv - Данные, специфичные для сайта, обслуживаемые системой.</li>\n<li>/tmp - Хранилище для временных файлов</li>\n<li>/usr - К сожалению, этот каталог имеет неудачное название, в большинстве случаев он не содержит пользовательских файлов в смысле домашнего каталога. Здесь размещаются установленные пользователем программное обеспечение и утилиты, однако это не означает, что нельзя добавлять личные каталоги. Внутри этого каталога находятся подкаталоги /usr/bin, /usr/local и т. д.</li>\n<li>/var - Каталог переменных, используется для системного журналирования, отслеживания пользователей, кэширования и т. д. Практически все, что подвержено постоянным изменениям.</li>\n</ul>",
  "exercise": "Посмотрите внутрь вашего каталога /usr, какая информация там находится?",
  "quizQuestion": "В каком каталоге хранятся журналы?",
  "quizAnswer": "/var",
  "slug": "filesystemhierarchy"
}