{
  "id": 2,
  "title": "Типы файловых систем",
  "lessonContent": "Существует множество различных реализаций файловых систем. Некоторые работают быстрее, чем другие, некоторые поддерживают более крупные накопители, а другие работают только с небольшими накопителями. Различные файловые системы имеют разные способы организации своих данных, и мы подробно рассмотрим, какие существуют типы файловых систем. Поскольку существует множество различных реализаций, приложениям необходим способ работы с различными операциями. Для этого существует так называемый уровень абстракции виртуальной файловой системы (VFS). Это слой между приложениями и различными типами файловых систем, поэтому независимо от того, какая файловая система у вас есть, ваши приложения смогут с ней работать. \n\nНа ваших дисках может быть много файловых систем, в зависимости от того, как они разделены, и мы рассмотрим это в следующем уроке.\n\n<b>Журналирование</b>\n\nЖурналирование по умолчанию присутствует в большинстве типов файловых систем, но на всякий случай, если его нет, вам следует знать, что оно делает. Допустим, вы копируете большой файл, и вдруг теряете питание. Ну, если вы используете файловую систему без журналирования, файл окажется поврежденным, ваша файловая система будет несогласованной, и затем при повторном включении вашей системы будет выполнена проверка файловой системы, чтобы убедиться, что все в порядке. Однако ремонт может занять некоторое время в зависимости от размера вашей файловой системы. \n\nТеперь, если вы используете систему с журналированием, перед тем как ваш компьютер начнет копировать файл, он запишет в журнал (журнал) то, что вы собираетесь делать. Теперь, когда вы действительно скопируете файл, по завершении операции журнал отметит эту задачу как завершенную. Файловая система всегда находится в согласованном состоянии благодаря этому, поэтому она точно знает, где вы остановились, если ваш компьютер внезапно выключится. Это также уменьшает время загрузки, потому что вместо проверки всей файловой системы она просто просматривает ваш журнал.\n\n<b>Общие типы файловых систем для настольных компьютеров</b>\n\n<ul>\n<li>ext4 - Это самая актуальная версия нативных файловых систем Linux. Она совместима с более старыми версиями ext2 и ext3. Поддерживает дисковые тома до 1 эксабайта и размеры файлов до 16 терабайт и многое другое. Это стандартный выбор для файловых систем Linux.</li>\n<li>Btrfs - \"Better or Butter FS\", это новая файловая система для Linux, которая поставляется со снимками, инкрементными резервными копиями, увеличением производительности и многое другое. Она широко доступна, но еще не совсем стабильна и совместима.</li>\n<li>XFS - Высокопроизводительная журналирующая файловая система, отлично подходит для систем с большими файлами, таких как медиасервер.</li>\n<li>NTFS и FAT - Файловые системы Windows</li>\n<li>HFS+ - Файловая система Macintosh</li>\n</ul>\n\nПроверьте, какие файловые системы есть на вашем компьютере: \n\n<pre>\npete@icebox:~$ df -T\nFilesystem     Type     1K-blocks    Used Available Use% Mounted on\n/dev/sda1      ext4       6461592 2402708   3707604  40% /\nudev           devtmpfs    501356       4    501352   1% /dev\ntmpfs          tmpfs       102544    1068    101476   2% /run\n/dev/sda6      xfs       13752320  460112  13292208   4% /home\n</pre>\n\nКоманда <b>df</b> сообщает об использовании дискового пространства файловой системы и других деталях о вашем диске, о котором мы поговорим позже.",
  "exercise": "Проведите небольшое исследование в Интернете о других типах файловых систем: ReiserFS, ZFS, JFS и других, которые вы можете найти.",
  "quizQuestion": "Какой общий тип файловой системы используется в Linux?",
  "quizAnswer": "ext4",
  "slug": "filesystemtypes"
}