{
  "id": 6,
  "title": "mount и umount",
  "lessonContent": "Прежде чем вы сможете просмотреть содержимое вашей файловой системы, вам нужно будет ее примонтировать. Для этого мне понадобится местоположение устройства, тип файловой системы и точка монтирования, которая является каталогом в системе, куда будет присоединена файловая система. Таким образом, мы хотим примонтировать наше устройство к точке монтирования. \n\nСначала создайте точку монтирования, в нашем случае <b>mkdir /mydrive</b>\n\n<pre>$ sudo mount -t ext4 /dev/sdb2 /mydrive</pre>\n\nПросто так! Теперь, когда мы перейдем в /mydrive, мы сможем увидеть содержимое нашей файловой системы, <b>-t</b> указывает тип файловой системы, затем у нас есть местоположение устройства, а затем точка монтирования. \n\nЧтобы отмонтировать устройство с точки монтирования: \n\n<pre>$ sudo umount /mydrive \nили \n$ sudo umount /dev/sdb2</pre>\n\nПомните, что ядро именует устройства в порядке их обнаружения. Что если имя нашего устройства изменится по какой-то причине после его монтирования? Что ж, к счастью, вы можете использовать уникальный идентификатор устройства (UUID) вместо имени.\n\nЧтобы просмотреть UUID на вашей системе для блочных устройств:\n\n<pre>\npete@icebox:~$ sudo blkid\n/dev/sda1: UUID=\"130b882f-7d79-436d-a096-1e594c92bb76\" TYPE=\"ext4\" \n/dev/sda5: UUID=\"22c3d34b-467e-467c-b44d-f03803c2c526\" TYPE=\"swap\" \n/dev/sda6: UUID=\"78d203a0-7c18-49bd-9e07-54f44cdb5726\" TYPE=\"xfs\" \n</pre>\n\nМы видим имена наших устройств, их соответствующие типы файловых систем и их UUID. Теперь, когда мы хотим что-то примонтировать, мы можем использовать:\n\n<pre>$ sudo mount UUID=130b882f-7d79-436d-a096-1e594c92bb76 /mydrive</pre>\n\nБольшую часть времени вам не понадобится монтировать устройства по их UUID, гораздо проще использовать имя устройства, и часто операционная система сама знает, как монтировать обычные устройства, такие как USB-накопители. Однако, если вам нужно автоматически монтировать файловую систему при запуске, например, если вы добавили второй жесткий диск, вам следует использовать UUID, и мы рассмотрим это в следующем уроке.",
  "exercise": "Посмотрите страницу руководства для mount и umount и посмотрите, какие другие опции вы можете использовать.",
  "quizQuestion": "Какая команда используется для присоединения файловой системы?",
  "quizAnswer": "mount",
  "slug": "mountingandunmountingfilesystems"
}