{
  "id": 2,
  "title": "बूट प्रक्रिया: BIOS",
  "lessonContent": "<b>BIOS</b>\n\nलिनक्स बूट प्रक्रिया में पहला कदम BIOS है जो सिस्टम अखंडता जांच करता है। BIOS एक फर्मवेयर है जो आजकल सबसे आम आईबीएम पीसी संगत कंप्यूटर्स में आता है, जो आजकल के कंप्यूटरों के प्रमुख प्रकार हैं। आपने संभावत: अपने हार्डडिस्क की बूट क्रम बदलने, सिस्टम समय, आपकी मशीन का मैक एड्रेस आदि जांच करने के लिए BIOS फर्मवेयर का उपयोग किया होगा। BIOS का मुख्य लक्ष्य सिस्टम बूटलोडर खोजना है।\n\nतो जब BIOS हार्ड ड्राइव को बूट करता है, तो सिस्टम को बूट करने के लिए बूट ब्लॉक खोजता है। आपके डिस्क को कैसे पार्टीशन किया गया है, इस पर निर्भर करेगा, यह मास्टर बूट रिकॉर्ड (MBR) या GPT की ओर देखेगा। MBR हार्ड ड्राइव के पहले सेक्टर में स्थित है, पहले 512 बाइट्स में। MBR में कोड होता है जो डिस्क के किसी अन्य प्रोग्राम को लोड करने के लिए होता है, यह प्रोग्राम फिर वास्तव में हमारा बूटलोडर लोड करता है।\n\nअब यदि आपने अपने डिस्क को GPT के साथ पार्टीशन किया है, तो बूटलोडर का स्थान थोड़ा बदल जाता है।\n\n<b>UEFI</b>\n\nBIOS का उपयोग करने के बजाय अपने सिस्टम को बूट करने का एक और तरीका है और वह UEFI के साथ है (जिसका मतलब है \"एकीकृत विस्तारयोग्य फर्मवेयर इंटरफेस\"). UEFI को BIOS के उत्तराधिकारी के रूप में डिज़ाइन किया गया था, आजकल के अधिकांश हार्डवेयर UEFI फर्मवेयर सहित आता है। मैकिंटॉश मशीनों ने वर्षों से EFI बूटिंग का उपयोग किया है और विंडोज ने अधिकांश अपनी चीजों को UEFI बूटिंग पर हटा दिया है। GPT प्रारूप का उपयोग EFI के साथ करने के लिए था। यदि आप GPT डिस्क को बूट कर रहे हैं तो आपको आवश्यकता नहीं है कि आपके पास EFI हो। GPT डिस्क का पहला सेक्टर एक \"संरक्षक MBR\" के लिए आरक्षित होता है ताकि BIOS आधारित मशीन को बूट करना संभव हो।\n\nUEFI स्टार्टअप के बारे में सभी जानकारी को एक .efi फ़ाइल में संग्रहित करता है। इस फ़ाइल को हार्डवेयर पर EFI सिस्टम पार्टीशन कहलाने वाले विशेष पार्टीशन पर संग्रहित किया जाता है। इस पार्टीशन के अंदर बूटलोडर होता है। UEFI ट्रेडिशनल BIOS फर्मवेयर से कई सुधार लेकर आया है। हालांकि, क्योंकि हम लिनक्स का उपयोग कर रहे हैं, हम अधिकांश लोग BIOS का उपयोग कर रहे हैं। इसलिए इन सभी सबकों के साथ यह धारणा जारी रहेगी।",
  "exercise": "अपने BIOS मेनू में जाएं और देखें कि क्या आपके पास UEFI बूटिंग सक्षम है।",
  "quizQuestion": "BIOS क्या लोड करता है?",
  "quizAnswer": "बूटलोडर",
  "slug": "bootprocessbios"
}