{
  "id": 2,
  "title": "Processo de Inicialização: BIOS",
  "lessonContent": "<b>BIOS</b>\n\nO primeiro passo no processo de inicialização do Linux é a BIOS, que realiza verificações de integridade do sistema. A BIOS é um firmware que é mais comum em computadores compatíveis com IBM PC, o tipo dominante de computadores existente hoje. Você provavelmente já usou o firmware da BIOS para alterar a ordem de inicialização dos seus discos rígidos, verificar a hora do sistema, o endereço MAC da sua máquina, etc. O objetivo principal da BIOS é encontrar o carregador de inicialização do sistema.\n\nEntão, uma vez que a BIOS inicializa o disco rígido, ela procura pelo bloco de inicialização para descobrir como inicializar o sistema. Dependendo de como você particionou seu disco, ela procurará o registro de inicialização principal (MBR) ou GPT. O MBR está localizado no primeiro setor do disco rígido, nos primeiros 512 bytes. O MBR contém o código para carregar outro programa em algum lugar do disco, e esse programa, por sua vez, carrega nosso carregador de inicialização.\n\nAgora, se você particionou seu disco com GPT, a localização do carregador de inicialização muda um pouco.\n\n<b>UEFI</b>\n\nExiste outra maneira de inicializar seu sistema em vez de usar a BIOS, e isso é com o UEFI (que significa \"Interface de Firmware Extensível Unificada\"). O UEFI foi projetado para ser o sucessor da BIOS, a maioria do hardware existente hoje vem com o firmware UEFI embutido. As máquinas Macintosh têm usado inicialização EFI há anos e a Microsoft mudou a maior parte de suas coisas para inicialização UEFI. O formato GPT foi destinado ao uso com EFI. Você não necessariamente precisa de EFI se estiver inicializando um disco GPT. O primeiro setor de um disco GPT é reservado para um \"MBR protetor\" para tornar possível a inicialização em uma máquina baseada em BIOS.\n\nO UEFI armazena todas as informações sobre a inicialização em um arquivo .efi. Este arquivo é armazenado em uma partição especial chamada partição de sistema EFI no hardware. Dentro desta partição, ele conterá o carregador de inicialização. O UEFI traz muitas melhorias em relação ao firmware da BIOS tradicional. No entanto, como estamos usando o Linux, a maioria de nós está usando a BIOS. Portanto, todas essas lições seguirão essa premissa.",
  "exercise": "Acesse o menu da BIOS e veja se a inicialização UEFI está ativada.",
  "quizQuestion": "O que a BIOS carrega?",
  "quizAnswer": "carregador de inicialização",
  "slug": "processoinicializacaobios"
}