{
  "id": 2,
  "title": "Terminal de Controle",
  "lessonContent": "Discutimos como há um campo TTY na saída do comando ps. O TTY é o terminal que executou o comando.\n\nExistem dois tipos de terminais, dispositivos de terminal regulares e dispositivos de pseudoterminal. Um dispositivo de terminal regular é um dispositivo de terminal nativo no qual você pode digitar e enviar saída para o seu sistema, isso se parece com o aplicativo de terminal que você tem lançado para acessar seu shell, mas não é. \n\nVamos fazer uma transição para que você possa ver essa ação, vá em frente e digite Ctrl-Alt-F1 para entrar no TTY1 (a primeira console virtual), você notará que não tem nada além do terminal, sem gráficos, etc. Isso é considerado um dispositivo de terminal regular, você pode sair disso com Ctrl-Alt-F7. \n\nUm pseudoterminal é o que você está acostumado a trabalhar, eles emulam terminais com a janela do terminal do shell e são denotados por PTS. Se você olhar para o ps novamente, verá seu processo de shell sob pts/*. \n\nOk, agora voltando ao terminal de controle, os processos geralmente estão vinculados a um terminal de controle. Por exemplo, se você estivesse executando um programa na janela do seu shell, como find, e fechasse a janela, seu processo também seria encerrado. \n\nExistem processos como processos daemon, que são processos especiais que basicamente mantêm o sistema em funcionamento. Eles costumam iniciar na inicialização do sistema e geralmente são encerrados quando o sistema é desligado. Eles são executados em segundo plano e, como não queremos que esses processos especiais sejam encerrados, eles não estão vinculados a um terminal de controle. Na saída do ps, o TTY é listado como um ? significando que não tem um terminal de controle.",
  "exercise": "Olhe para a saída do seu ps e liste todos os valores TTY únicos.",
  "quizQuestion": "Que valor é atribuído a um processo que não tem um terminal de controle?",
  "quizAnswer": "?",
  "slug": "terminaldecontrole"
}