{
  "id": 11,
  "title": "Controle de Trabalho",
  "lessonContent": "Digamos que você esteja trabalhando em uma única janela de terminal e esteja executando um comando que está demorando muito. Você não pode interagir com o shell até que ele seja concluído, no entanto, queremos continuar trabalhando em nossas máquinas, então precisamos manter esse shell aberto. Felizmente, podemos controlar como nossos processos são executados com jobs: \n\n<b>Enviando um job para segundo plano</b>\n\nAdicionar um e comercial (&) ao comando o executará em segundo plano para que você ainda possa usar seu shell. Vamos ver um exemplo:\n\n<pre>$ sleep 1000 &\n$ sleep 1001 &\n$ sleep 1002 &\n</pre>\n\n<b>Visualizar todos os jobs em segundo plano</b>\n\nAgora você pode visualizar os jobs que acabou de enviar para segundo plano.\n\n<pre>$ jobs\n\n[1]    Executando     sleep 1000 &\n[2]-   Executando     sleep 1001 &\n[3]+   Executando     sleep 1002 &\n\n</pre>\n\nIsso mostrará o ID do job na primeira coluna, em seguida, o status e o comando que foi executado. O <b>+</b> ao lado do ID do job significa que é o job em segundo plano mais recente que foi iniciado. O job com o <b>-</b> é o segundo comando mais recente.\n\n<b>Enviando um job para segundo plano em um job existente</b>\n\nSe você já executou um job e deseja enviá-lo para segundo plano, não é necessário terminá-lo e reiniciá-lo. Primeiro suspenda o job com Ctrl-Z, em seguida, execute o comando <b>bg</b> para enviá-lo para segundo plano.\n\n<pre>\npete@icebox ~ $ sleep 1003\n^Z\n[4]+    Parado     sleep 1003\n\npete@icebox ~ $ bg\n[4]+    sleep 1003 &\n\npete@icebox ~ $ jobs\n\n[1]    Executando     sleep 1000 &\n[2]    Executando     sleep 1001 &\n[3]-   Executando     sleep 1002 &\n[4]+   Executando     sleep 1003 &\n</pre>\n\n<b>Movendo um job do segundo plano para o primeiro plano</b>\n\nPara mover um job do segundo plano, basta especificar o ID do job que você deseja. Se você executar fg sem nenhuma opção, ele trará de volta o job em segundo plano mais recente (o job com o sinal + ao lado dele)\n\n<pre>$ fg %1</pre>\n\n<b>Encerrar jobs em segundo plano</b>\n\nSemelhante à movimentação de jobs do segundo plano, você pode usar a mesma forma para encerrar os processos usando seus IDs de Job.\n\n<pre>kill %1</pre>",
  "exercise": "Mova alguns jobs entre o segundo plano e o primeiro plano",
  "quizQuestion": "Qual comando é usado para listar os jobs em segundo plano?",
  "quizAnswer": "jobs",
  "slug": "controletrabalho"
}