{
  "id": 8,
  "title": "bondade",
  "lessonContent": "Quando você executa várias coisas em seu computador, como talvez Chrome, Microsoft Word ou Photoshop ao mesmo tempo, pode parecer que esses processos estão sendo executados ao mesmo tempo, mas isso não é exatamente verdade. \n\nOs processos usam a CPU por um pequeno período de tempo chamado fatia de tempo. Em seguida, eles pausam por milissegundos e outro processo obtém uma pequena fatia de tempo. Por padrão, o agendamento de processos acontece dessa forma round-robin. Cada processo recebe fatias de tempo suficientes até que termine o processamento. O kernel lida com todas essas trocas de processos e geralmente faz um bom trabalho na maioria das vezes.\n\nOs processos não são capazes de decidir quando e por quanto tempo recebem tempo de CPU, se todos os processos se comportassem normalmente, cada um receberia (aproximadamente) a mesma quantidade de tempo de CPU. No entanto, há uma maneira de influenciar o algoritmo de agendamento de processos do kernel com um valor de bondade. Bondade é um nome bastante estranho, mas o que significa é que os processos têm um número para determinar sua prioridade para a CPU. Um número alto significa que o processo é bom e tem uma prioridade mais baixa para a CPU e um número baixo ou negativo significa que o processo não é muito bom e deseja obter o máximo possível da CPU. \n\n<pre>$ top</pre>\n\nVocê pode ver uma coluna para NI agora, que é o nível de bondade de um processo.\n\nPara alterar o nível de bondade, você pode usar os comandos nice e renice:\n\n<pre>$ nice -n 5 apt upgrade</pre>\n\nO comando nice é usado para definir a prioridade para um novo processo. O comando renice é usado para definir a prioridade em um processo existente. \n\n<pre>$ renice 10 -p 3245</pre>",
  "exercise": "Quais processos não são muito bons e por quê?",
  "quizQuestion": "Se eu quiser que um processo tenha mais prioridade de CPU, eu uso um número nice mais baixo ou mais alto?",
  "quizAnswer": "mais baixo",
  "slug": "bondadedeprocesso"
}