{
  "id": 5,
  "title": "Terminação de Processos",
  "lessonContent": "Agora que sabemos o que acontece quando um processo é criado, o que acontece quando não precisamos mais dele? Esteja avisado, às vezes o Linux pode ficar um pouco sombrio...\n\nUm processo pode sair usando a chamada de sistema _exit, isso liberará os recursos que o processo estava usando para realocação. Então, quando um processo está pronto para terminar, ele informa ao kernel o motivo pelo qual está terminando com algo chamado status de término. Mais comumente, um status de 0 significa que o processo teve sucesso. No entanto, isso não é suficiente para terminar completamente um processo. O processo pai tem que reconhecer o término do processo filho usando a chamada de sistema wait e o que isso faz é verificar o status de término do processo filho. Eu sei que é horrível pensar sobre isso, mas a chamada de wait é uma necessidade, afinal, que pai não gostaria de saber como seu filho morreu?\n\nHá outra maneira de terminar um processo e isso envolve o uso de sinais, o que discutiremos em breve.\n\n<b>Processos Órfãos</b>\n\nQuando um processo pai morre antes de um processo filho, o kernel sabe que não receberá uma chamada de wait, então em vez disso, ele torna esses processos \"órfãos\" e os coloca sob os cuidados do init (lembre-se, mãe de todos os processos). O init eventualmente realizará a chamada de sistema wait para esses órfãos para que possam morrer.\n\n<b>Processos Zumbis</b>\n\nO que acontece quando um filho termina e o processo pai ainda não chamou wait? Ainda queremos ser capazes de ver como um processo filho terminou, então mesmo que o processo filho tenha terminado, o kernel transforma o processo filho em um processo zumbi. Os recursos que o processo filho usou ainda são liberados para outros processos, no entanto, ainda há uma entrada na tabela de processos para esse zumbi. Os processos zumbis também não podem ser mortos, uma vez que estão tecnicamente \"mortos\", então você não pode usar sinais para matá-los. Eventualmente, se o processo pai chamar a chamada de sistema wait, o zumbi desaparecerá, isso é conhecido como \"reaproveitamento\". Se o pai não realizar uma chamada de wait, o init adotará o zumbi e realizará automaticamente o wait e removerá o zumbi. Pode ser ruim ter muitos processos zumbis, pois ocupam espaço na tabela de processos, se ela ficar cheia, impedirá que outros processos sejam executados.",
  "exercise": "Não há exercícios para esta lição.",
  "quizQuestion": "Qual é o status de término mais comum para um processo que teve sucesso?",
  "quizAnswer": "0",
  "slug": "terminacaodeprocessos"
}