{
  "id": 5,
  "title": "Visión general de Systemd",
  "lessonContent": "Systemd se está convirtiendo lentamente en el estándar emergente para init. Si tienes un directorio /usr/lib/systemd, es muy probable que estés utilizando systemd.\n\nSystemd utiliza objetivos para poner en marcha tu sistema. Básicamente tienes un objetivo que deseas lograr y este objetivo también tiene dependencias que necesitamos alcanzar. Systemd es extremadamente flexible y robusto, no sigue una secuencia estricta para iniciar procesos. Esto es lo que sucede durante el arranque típico de systemd:\n\n<ol>\n<li>Primero, systemd carga sus archivos de configuración, que generalmente se encuentran en /etc/systemd/system o /usr/lib/systemd/system</li>\n<li>Luego determina su objetivo de arranque, que suele ser default.target</li>\n<li>Systemd averigua las dependencias del objetivo de arranque y las activa</li>\n</ol>\n\nSimilar a los niveles de ejecución de Sys V, systemd arranca en diferentes objetivos:\n\n<ul>\n<li>poweroff.target - apagar el sistema</li>\n<li>rescue.target - modo de usuario único</li>\n<li>multi-user.target - usuario múltiple con red</li>\n<li>graphical.target - usuario múltiple con red y GUI</li>\n<li>reboot.target - reiniciar</li>\n</ul>\n\nEl objetivo de arranque predeterminado default.target generalmente apunta a graphical.target.\n\nEl principal objeto con el que trabaja systemd se conoce como unidades. Systemd no solo detiene y arranca servicios, puede montar sistemas de archivos, monitorear tus sockets de red, etc. y debido a esa robustez tiene diferentes tipos de unidades con las que opera. Las unidades más comunes son:\n\n<ul>\n<li>Unidades de servicio - estos son los servicios que hemos estado iniciando y deteniendo, estos archivos de unidad terminan en .service</li>\n<li>Unidades de montaje - Estas montan sistemas de archivos, estos archivos de unidad terminan en .mount</li>\n<li>Unidades de objetivo - Estas agrupan otras unidades, los archivos terminan en .target</li>\n</ul>\n\nPor ejemplo, digamos que arrancamos en nuestro default.target, bueno, este objetivo agrupa la unidad networking.service, la unidad crond.service, etc., por lo que una vez que activamos una sola unidad, todo lo que está por debajo de esa unidad también se activa.",
  "exercise": "No hay ejercicios para esta lección.",
  "quizQuestion": "¿Qué unidad se utiliza para agrupar otras unidades?",
  "quizAnswer": "target",
  "slug": "systemdoverview"
}