{
  "id": 6,
  "title": "Objetivos de Systemd",
  "lessonContent": "No entraremos en los detalles de cómo escribir archivos de unidad de systemd. Sin embargo, repasaremos brevemente un resumen de un archivo de unidad y cómo controlar manualmente las unidades. \n\nAquí tienes un archivo de unidad de servicio básico: foobar.service\n\n<pre>\n[Unit]\nDescription=Mi Foobar\nBefore=bar.target\n\n[Service]\nExecStart=/usr/bin/foobar\n\n[Install]\nWantedBy=multi-user.target\n</pre>\n\nEste es un simple archivo de destino de servicio, al principio del archivo vemos una sección para [Unit], esto nos permite darle a nuestro archivo de unidad una descripción y controlar el orden de activación de la unidad. La siguiente parte es la sección [Service], aquí podemos iniciar, detener o recargar un servicio. Y la sección [Install] se utiliza para dependencias. Esto es solo la punta del iceberg para escribir archivos de systemd, así que te insto a que leas más sobre el tema si quieres saber más. \n\nAhora, veamos algunos comandos que puedes usar con las unidades de systemd: \n\n<b>Listar unidades</b>\n\n<pre>$ systemctl list-units</pre>\n\n<b>Ver estado de la unidad</b>\n\n<pre>$ systemctl status networking.service</pre>\n\n<b>Iniciar un servicio</b>\n\n<pre>$ sudo systemctl start networking.service</pre>\n\n<b>Detener un servicio</b>\n\n<pre>$ sudo systemctl stop networking.service</pre>\n\n<b>Reiniciar un servicio</b>\n\n<pre>$ sudo systemctl restart networking.service</pre>\n\n<b>Habilitar una unidad</b>\n\n<pre>$ sudo systemctl enable networking.service</pre>\n\n<b>Deshabilitar una unidad</b>\n\n<pre>$ sudo systemctl disable networking.service</pre>\n\nNuevamente, aún no has visto cuánta profundidad alcanza systemd, así que infórmate más si quieres aprender más.",
  "exercise": "Observa los estados de las unidades y inicia y detén algunos servicios. ¿Qué observas?",
  "quizQuestion": "¿Cuál es el comando para iniciar un servicio llamado peanut.service?",
  "quizAnswer": "sudo systemctl start peanut.service",
  "slug": "systemdgoals"
}