{
  "id": 1,
  "title": "Visión general de System V",
  "lessonContent": "El propósito principal de init es iniciar y detener procesos esenciales en el sistema. Hay tres implementaciones principales de init en Linux, System V, Upstart y systemd. En esta lección, vamos a repasar la versión más tradicional de init, System V init o Sys V (pronunciado como 'System Five'). \n\nPara saber si estás utilizando la implementación Sys V init, si tienes un archivo /etc/inittab es muy probable que estés ejecutando Sys V. \n\nSys V inicia y detiene procesos secuencialmente, por lo que si quisieras iniciar un servicio llamado foo-a, antes de que foo-b pueda funcionar, debes asegurarte de que foo-a ya esté en ejecución. Sys V hace esto con scripts, estos scripts inician y detienen servicios para nosotros, podemos escribir nuestros propios scripts o la mayoría de las veces usar los que ya están integrados en el sistema operativo y se utilizan para cargar servicios esenciales. \n\nLas ventajas de usar esta implementación de init es que es relativamente fácil resolver dependencias, ya que sabes que foo-a viene antes que foo-b, sin embargo, el rendimiento no es óptimo porque generalmente una cosa se está iniciando o deteniendo a la vez. \n\nCuando se utiliza Sys V, el estado de la máquina está definido por los niveles de ejecución que van del 0 al 6. Estos modos diferentes variarán dependiendo de la distribución, pero la mayoría de las veces se verán así: \n\n<ul>\n<li>0: Apagado</li>\n<li>1: Modo de usuario único</li>\n<li>2: Modo multiusuario sin red</li>\n<li>3: Modo multiusuario con red</li>\n<li>4: No utilizado</li>\n<li>5: Modo multiusuario con red y GUI</li>\n<li>6: Reinicio</li>\n</ul>\n\nCuando tu sistema se inicia, busca en qué nivel de ejecución te encuentras y ejecuta los scripts ubicados dentro de esa configuración de nivel de ejecución. Los scripts se encuentran en <b>/etc/rc.d/rc[número de nivel de ejecución].d/</b> o <b>/etc/init.d</b>. Los scripts que comienzan con S (inicio) o K (finalización) se ejecutarán al inicio y al apagado, respectivamente. Los números junto a estos caracteres indican el orden en que se ejecutan. \n\nPor ejemplo:\n\n<pre>\npete@icebox:/etc/rc.d/rc0.d$ ls\nK10updates  K80openvpn        \n</pre>\n\nVemos que al cambiar al nivel de ejecución 0 o modo de apagado, nuestra máquina intentará ejecutar un script para finalizar los servicios de actualización y luego openvpn. Para saber en qué nivel de ejecución se está iniciando tu máquina, puedes ver el nivel de ejecución predeterminado en el archivo /etc/inittab. También puedes cambiar tu nivel de ejecución predeterminado en este archivo. \n\nCabe destacar que System V se está reemplazando lentamente, tal vez no hoy, ni siquiera en años. Sin embargo, es posible que veas niveles de ejecución en otras implementaciones de init, principalmente para admitir aquellos servicios que solo se inician o detienen mediante scripts de init de System V.",
  "exercise": "Si estás ejecutando System V, cambia el nivel de ejecución predeterminado de tu máquina a otro y observa qué sucede.",
  "quizQuestion": "¿Qué nivel de ejecución se utiliza generalmente para el apagado?",
  "quizAnswer": "0",
  "slug": "visión-general-sysv"
}