{
  "id": 3,
  "title": "Visión general de Upstart",
  "lessonContent": "Upstart fue desarrollado por Canonical, por lo que fue la implementación de inicio en Ubuntu durante un tiempo, sin embargo, en las instalaciones modernas de Ubuntu ahora se utiliza systemd. Upstart fue creado para mejorar los problemas con Sys V, como los estrictos procesos de inicio, bloqueo de tareas, etc. El modelo basado en eventos y trabajos de Upstart le permite responder a los eventos a medida que ocurren. \n\nPara saber si estás usando Upstart, si tienes un directorio /usr/share/upstart, eso es un indicador bastante bueno. \n\nLos trabajos son las acciones que realiza Upstart y los eventos son mensajes que se reciben de otros procesos para activar trabajos. Para ver una lista de trabajos y su configuración:\n\n<pre>\npete@icebox:~$ ls /etc/init\nacpid.conf                   mountnfs.sh.conf\nalsa-restore.conf            mtab.sh.conf\nalsa-state.conf              networking.conf\nalsa-store.conf              network-interface.conf\nanacron.conf                 network-interface-container.conf\n</pre>\n\nDentro de estas configuraciones de trabajo, se incluirá información sobre cómo iniciar trabajos y cuándo iniciar trabajos.\n\nPor ejemplo, en el archivo networking.conf, podría decir algo tan simple como:\n<pre>\nstart on runlevel [235]\nstop on runlevel [0]\n</pre>\n\nEsto significa que iniciará la configuración de la red en el runlevel 2, 3 o 5 y detendrá la red en el runlevel 0. Hay muchas formas de escribir el archivo de configuración y descubrirás eso cuando veas las diferentes configuraciones de trabajo disponibles. \n\nLa forma en que funciona Upstart es la siguiente: \n\n<ol>\n<li>Primero, carga las configuraciones de trabajo desde /etc/init</li>\n<li>Una vez que ocurre un evento de inicio, ejecutará trabajos desencadenados por ese evento.</li>\n<li>Estos trabajos generarán nuevos eventos y luego esos eventos activarán más trabajos</li>\n<li>Upstart continúa haciendo esto hasta que complete todos los trabajos necesarios</li>\n</ol>",
  "exercise": "Si estás ejecutando Upstart, intenta entender las configuraciones de trabajo en /etc/init.",
  "quizQuestion": "¿Cuál es la implementación de inicio que se utiliza en Ubuntu?",
  "quizAnswer": "upstart",
  "slug": "upstartoverview"
}