{
  "id": 4,
  "title": "Trabajos de Upstart",
  "lessonContent": "Upstart puede desencadenar muchos eventos y trabajos para ejecutarse, desafortunadamente no hay una manera fácil de ver de dónde proviene un evento o trabajo, por lo que tendrás que investigar las configuraciones de trabajo en /etc/init. La mayoría del tiempo, nunca necesitarás mirar los archivos de configuración de trabajos de Upstart, pero querrás controlar algunos trabajos específicos de manera más fácil. Hay muchos comandos útiles que puedes usar en un sistema Upstart. \n\n<b>Ver trabajos</b>\n\n<pre>initctl list\n\nshutdown stop/waiting\nconsole stop/waiting\n...\n</pre>\n\nVerás una lista de trabajos de Upstart con diferentes estados aplicados a ellos. En cada línea, el nombre del trabajo es el primer valor y el segundo campo (antes de la /) es en realidad el objetivo del trabajo, el tercer valor (después de la /) es el estado actual. Así que vemos que nuestro trabajo de apagado eventualmente quiere detenerse, pero actualmente está en un estado de espera. El estado y los objetivos del trabajo cambiarán a medida que inicies o detengas trabajos. \n\n<b>Ver trabajo específico</b>\n\n<pre>initctl status networking\nnetworking start/running\n</pre>\n\nNo entraremos en los detalles de cómo escribir una configuración de trabajo de Upstart, sin embargo, ya sabemos que los trabajos se detienen, inician y reinician en estas configuraciones. Estos trabajos también emiten eventos, por lo que pueden iniciar otros trabajos. Repasaremos los comandos manuales de la operación de Upstart, pero si tienes curiosidad, deberías profundizar en los archivos .conf.\n\n<b>Iniciar manualmente un trabajo</b>\n\n<pre>$ sudo initctl start networking</pre>\n\n<b>Detener manualmente un trabajo</b>\n\n<pre>$ sudo initctl stop networking</pre>\n\n<b>Reiniciar manualmente un trabajo</b>\n\n<pre>$ sudo initctl restart networking</pre>\n\n<b>Emitir manualmente un evento</b>\n\n<pre>$ sudo initctl emit some_event</pre>",
  "exercise": "Observa tu lista de trabajos de Upstart, ahora cambia el estado del trabajo con uno de los comandos que aprendimos hoy. ¿Qué notas después?",
  "quizQuestion": "¿Cómo reiniciaría manualmente un trabajo de Upstart llamado peanuts?",
  "quizAnswer": "sudo initctl restart peanuts",
  "slug": "trabajosdeupstart"
}