{
  "id": 2,
  "title": "DNS Components",
  "lessonContent": "इंटरनेट का DNS डेटाबेस साइट्स और संगठनों पर निर्भर करता है जो उस डेटाबेस का हिस्सा प्रदान करते हैं। उसे करने के लिए, उन्हें चाहिए:\n\n<b>नाम सर्वर</b>\n\nहम DNS को \"नाम सर्वर\" के माध्यम से सेटअप करते हैं, नाम सर्वर हमारी DNS सेटिंग्स और कॉन्फ़िगरेशन लोड करते हैं और क्लाइंट्स या अन्य सर्वरों से किसी भी प्रश्न का उत्तर देते हैं जो जानना चाहते हैं कि \"गूगल कौन है?\"। यदि नाम सर्वर उस प्रश्न का उत्तर नहीं जानता है, तो वह अन्य नाम सर्वरों को अनुरोध को दूसरे नाम सर्वरों पर पुनर्निर्देशित करेगा। नाम सर्वर \"आधिकारिक\" हो सकते हैं, जिसका अर्थ है कि वे वास्तविक DNS रिकॉर्ड्स को धारण करते हैं जिनकी आप खोज रहे हैं, या \"पुनरावृत्तिक\" हो सकते हैं जिसका अर्थ है कि वे अन्य सर्वरों से पूछेंगे और वे सर्वर अन्य सर्वरों से पूछेंगे जब तक वे एक आधिकारिक सर्वर नहीं मिल जाते जिसमें DNS रिकॉर्ड्स होते हैं। पुनरावृत्तिक सर्वरों में हमें चाहिए जानकारी को कैश किया जा सकता है बजाय एक आधिकारिक सर्वर तक पहुंचने की।\n\n<b>ज़ोन फ़ाइल</b>\n\nनाम सर्वर के अंदर कुछ ज़ोन फ़ाइल्स रहती हैं। ज़ोन फ़ाइल्स वहाँ जानकारी को कैसे रखती हैं जो डोमेन के बारे में है या जिसे वह नहीं जानता है कैसे पहुंचा जाए।\n\n<b>संसाधन रिकॉर्ड्स</b>\n\nएक ज़ोन फ़ाइल संसाधन रिकॉर्ड्स के एंट्री से बनी होती है। प्रत्येक पंक्ति एक रिकॉर्ड है और होस्ट्स, नेम सर्वर्स, अन्य संसाधनों आदि के बारे में जानकारी शामिल है। फ़ील्ड निम्नलिखित होते हैं:\n\n<ul>\n<li>रिकॉर्ड नाम</li>\n<li>TTL - रिकॉर्ड को हम कितने समय तक छोड़ देंगे और एक नया प्राप्त करेंगे, DNS में TTL को समय द्वारा दर्शाया जाता है, इसलिए रिकॉर्ड्स का एक घंटे का TTL हो सकता है। हम इसे इसलिए करते हैं क्योंकि इंटरनेट लगातार बदल रहा है, एक मिनट में एक होस्ट को X आईपी पते से मैप किया जा सकता है फिर अगले में Y आईपी पता हो सकता है</li>\n<li>क्लास - रिकॉर्ड जानकारी का नेमस्पेस, इंटरनेट के लिए सबसे आम IN का उपयोग किया जाता है</li>\n<li>प्रकार - रिकॉर्ड डेटा में संग्रहित जानकारी का प्रकार। हम रिकॉर्ड प्रकारों में नहीं जाएंगे, लेकिन आपने सामान्य रूप से देखे होंगे जैसे A आईपी पते के लिए, MX या मेल एक्सचेंजर आदि।</li>\n<li>डेटा - यह फ़ील्ड एक आईपी पता या कुछ और जो रिकॉर्ड प्रकार पर निर्भर करता है, उसमें शामिल हो सकता है।</li>\n</ul>\n<pre>\npatty    IN  A      192.168.0.4 \n</pre>",
  "exercise": "इस पाठ के लिए कोई अभ्यास नहीं।",
  "quizQuestion": "मेल एक्सचेंजर्स के लिए कौन सा संसाधन रिकॉर्ड प्रकार उपयोग किया जाता है?",
  "quizAnswer": "MX",
  "slug": "dnscomponents"
}