{
  "id": 3,
  "title": "DNS प्रक्रिया",
  "lessonContent": "चलो एक उदाहरण देखते हैं कि आपका होस्ट DNS के साथ एक डोमेन (catzontheinterwebz.com) को कैसे खोजता है। मौलिक रूप से, हम नीचे की ओर जाते हैं जब तक हम उस डोमेन के बारे में जानकारी रखने वाले DNS सर्वर तक नहीं पहुंच जाते।\n\n<b>स्थानीय DNS सर्वर</b>\n\nसबसे पहले हमारा होस्ट पूछता है, \"catzontheinterwebz.com कहाँ है?\", हमारा स्थानीय DNS सर्वर नहीं जानता है इसलिए वह ऊपर से शुरू होकर रूट सर्वरों से पूछने जाता है। ध्यान रखें कि हमारा होस्ट catzontheinterwebz.com को सीधे खोजने के लिए ये अनुरोध नहीं कर रहा है, अधिकांश उपयोगकर्ता अपने आईएसपी के द्वारा प्रदान किए गए एक रिकर्सिव DNS सर्वर से बात करते हैं और उस सर्वर को फिर catzontheinterwebz.com की स्थान खोजने के लिए काम मिलता है।\n\n<b>रूट सर्वर</b>\n\nइंटरनेट के लिए 13 रूट सर्वर हैं, वे दुनिया भर में मिरर और वितरित हैं ताकि वे इंटरनेट के DNS अनुरोधों को संभाल सकें, इसलिए वास्तव में सैकड़ों सर्वर हैं जो काम कर रहे हैं, वे विभिन्न संगठनों द्वारा नियंत्रित हैं और उनमें टॉप-लेवल डोमेन के बारे में जानकारी है। टॉप-लेवल डोमेन वे हैं जिन्हें आप .org, .com, .net, आदि पतों के रूप में जानते हैं। इसलिए रूट सर्वर को नहीं पता है कि catzontheinterwebz.com कहाँ है, इसलिए वह हमें उस आईपी पते पर .com टॉप-लेवल डोमेन DNS सर्वर से पूछने के लिए कहता है।\n\n<b>टॉप-लेवल डोमेन</b>\n\nअब हम उस नाम सर्वर को एक और अनुरोध भेजते हैं जो \".com\" पतों के बारे में जानकारी रखता है और पूछते हैं कि क्या उसे पता है कि catzontheinterwebz.com कहाँ है? TLD के पास catzontheinterwebz.com नहीं है, लेकिन उसे catzontheinterwebz.com के लिए नाम सर्वर के लिए एक रिकॉर्ड दिखाई देता है। इसलिए वह हमें इस नाम सर्वर का आईपी पता देता है और हमें वहाँ देखने के लिए कहता है।\n\n<b>अधिकारिक DNS सर्वर</b>\n\nअब हम उस DNS सर्वर को अंतिम अनुरोध भेजते हैं जिसके पास हमें चाहिए रिकॉर्ड है। नाम सर्वर देखता है कि उसके पास catzontheinterwebz.com के लिए एक ज़ोन फ़ाइल है और इस होस्ट के लिए 'www' के लिए एक संसाधन रिकॉर्ड है। फिर वह हमें इस होस्ट का आईपी पता देता है और हम अंततः इंटरनेट पर कुछ बिल्लियों को देख सकते हैं।",
  "exercise": "इस सबक के लिए कोई व्यायाम नहीं है।",
  "quizQuestion": ".com, .net, .org, आदि पतों के नाम सर्वरों के लिए शब्दक्षेप क्या है?",
  "quizAnswer": "TLD",
  "slug": "dnsprocess"
}