{
  "id": 3,
  "title": "डिस्क की एनाटॉमी",
  "lessonContent": "हार्ड डिस्क को विभाजित किया जा सकता है भागों में, मुख्य रूप से कई ब्लॉक उपकरण बनाते हैं। उसी उदाहरणों को याद करें, जैसे, /dev/sda1 और /dev/sda2, /dev/sda पूरी डिस्क है, लेकिन /dev/sda1 उस डिस्क पर पहला विभाजन है। विभाजन डेटा को अलग करने के लिए बहुत उपयोगी है और यदि आपको किसी विशेष फ़ाइल सिस्टम की आवश्यकता है, तो आप आसानी से एक विभाजन बना सकते हैं बजाय पूरी डिस्क को एक ही फ़ाइल सिस्टम प्रकार बनाने की।\n\n<b>विभाजन सारणी</b>\n\nप्रत्येक डिस्क में एक विभाजन सारणी होगी, यह सारणी सिस्टम को बताती है कि डिस्क को कैसे विभाजित किया गया है। यह सारणी आपको बताती है कि विभाजन कहाँ शुरू होते हैं और कहाँ समाप्त होते हैं, कौन से विभाजन बूट करने योग्य हैं, डिस्क के कौन से सेक्टर किस विभाजन को क्या आवंटित किए गए हैं, आदि। दो मुख्य विभाजन सारणी योजनाएँ हैं, मास्टर बूट रिकॉर्ड (MBR) और GUID विभाजन सारणी (GPT)।\n\n<b>विभाजन</b>\n\nडिस्क विभाजनों से मिलकर बने होते हैं जो हमें हमारे डेटा को संगठित करने में मदद करते हैं। आप एक डिस्क पर कई विभाजन रख सकते हैं और वे एक-दूसरे के ऊपर नहीं चढ़ सकते। यदि कोई विभाजन के लिए आवंटित नहीं है, तो उसे फ्री स्पेस कहा जाता है। विभाजनों के प्रकार आपकी विभाजन सारणी पर निर्भर करते हैं। एक विभाजन के अंदर, आप एक फ़ाइल सिस्टम रख सकते हैं या एक विभाजन को स्वैप जैसी अन्य चीजों के लिए समर्पित कर सकते हैं (हम जल्द ही उस पर आएंगे)।\n\n<i>MBR</i>\n\n<ul>\n<li>पारंपरिक विभाजन सारणी, मानक के रूप में प्रयोग किया जाता था</li>\n<li>प्राथमिक, विस्तारित, और तार्किक विभाजन हो सकते हैं</li>\n<li>MBR में चार प्राथमिक विभाजनों की सीमा होती है</li>\n<li>अतिरिक्त विभाजन बनाए जा सकते हैं एक प्राथमिक विभाजन को विस्तारित विभाजन में बदलकर (एक डिस्क पर केवल एक विस्तारित विभाजन हो सकता है)। फिर विस्तारित विभाजन के अंदर आप तार्किक विभाजन जोड़ते हैं। तार्किक विभाजनों का उपयोग अन्य किसी विभाजन की तरह किया जाता है। मजाकिया, मैं जानता हूँ।</li> \n<li>2 टेराबाइट तक के डिस्क का समर्थन करता है</li>\n</ul>\n\n<i>GPT</i>\n\n<ul>\n<li>GUID विभाजन सारणी (GPT) डिस्क विभाजन के लिए नए मानक बन रहा है</li>\n<li>केवल एक प्रकार का विभाजन है और आप उनमें कई बना सकते हैं</li>\n<li>प्रत्येक विभाजन का एक वैश्विक अद्वितीय आईडी (GUID) होता है</li>\n<li>यह अधिकांशत: UEFI आधारित बूटिंग के साथ प्रयोग किया जाता है (हम एक अन्य पाठ्यक्रम में विस्तार से जाएंगे)</li> \n</ul>\n\n<b>फ़ाइल सिस्टम संरचना</b>\n\nहम पिछले सबक से जानते हैं कि एक फ़ाइल सिस्टम फ़ाइलों और निर्देशिकाओं का एक संगठित संग्रह है। इसके सरल रूप में, यह फ़ाइलों को प्रबंधित करने वाला डेटाबेस से मिलकर बना होता है और वास्तविक फ़ाइलों को। हालांकि, हम थोड़ा और विस्तार से जाएँगे।\n\n<ul>\n<li>बूट ब्लॉक - यह फ़ाइल सिस्टम द्वारा उपयोग नहीं किया जाता है, बल्कि यह ऑपरेटिंग सिस्टम को बूट करने के लिए उपयोग होने वाली जानकारी शामिल करता है। ऑपरेटिंग सिस्टम को केवल एक बूट ब्लॉक की आवश्यकता होती है। यदि आपके पास कई विभाजन हैं, तो उनमें बूट ब्लॉक होगा, लेकिन उनमें से बहुत से अप्रयोगी होते हैं।</li>\n<li>सुपर ब्लॉक - यह बूट ब्लॉक के बाद आने वाला एक एकल ब्लॉक है, और इसमें फ़ाइल सिस्टम के बारे में जानकारी होती है, जैसे आइनोड तालिका का आकार, तार्किक ब्लॉकों का आकार और फ़ाइल सिस्टम का आकार।</li>\n<li>आइनोड तालिका - इसे हमारी फ़ाइलों का प्रबंधन करने वाला डेटाबेस समझें (हमें आइनोड्स पर पूरा सबक है, इसलिए चिंता न करें)। प्रत्येक फ़ाइल या निर्देशिका का आइनोड तालिके में एक अद्वितीय प्रविष्टि होती है और इसमें फ़ाइल के बारे में विभिन्न जानकारियाँ होती हैं।</li>\n<li>डेटा ब्लॉक - यह वास्तविक डेटा है फ़ाइलों और निर्देशिकाओं के लिए।</li>\n</ul>\n \nचलिए विभिन्न विभाजन सारणियों पर एक नज़र डालते हैं। नीचे एक उदाहरण है एक विभाजन का उपयोग करके MBR विभाजन सारणी (msdos) का। आप मशीन पर प्राथमिक, विस्तारित और तार्किक विभाजन देख सकते हैं।\n\n<pre>\npete@icebox:~$ sudo parted -l\nModel: Seagate (scsi)\nDisk /dev/sda: 21.5GB\nSector size (logical/physical): 512B/512B\nPartition Table: msdos\n\nNumber  Start   End     Size    Type      File system     Flags\n 1      1049kB  6860MB  6859MB  primary   ext4            boot\n 2      6861MB  21.5GB  14.6GB  extended\n 5      6861MB  7380MB  519MB   logical   linux-swap(v1)\n 6      7381MB  21.5GB  14.1GB  logical   xfs\n</pre>\n\n\nयह उदाहरण GPT है, जिसमें विभाजनों के लिए केवल एक अद्वितीय आईडी का उपयोग किया जाता है।\n\n<pre>\nModel: Thumb Drive (scsi)\nDisk /dev/sdb: 4041MB\nSector size (logical/physical): 512B/512B\nPartition Table: gpt\n\nNumber  Start   End     Size     File system  Name        Flags\n 1      17.4kB  1000MB  1000MB                first\n 2      1000MB  4040MB  3040MB                second\n</pre>",
  "exercise": "अपनी मशीन पर <b>parted -l</b> चलाएं और अपने परिणाम का मूल्यांकन करें।",
  "quizQuestion": "MBR विभाजन सारणी योजना में 4 से अधिक विभाजन बनाने के लिए कौन सा विभाजन प्रकार प्रयोग किया जाता है?",
  "quizAnswer": "विस्तारित",
  "slug": "anatomyofadisk"
}