{
  "id": 4,
  "title": "डिस्क पार्टीशनिंग",
  "lessonContent": "एक यूएसबी ड्राइव पर फाइल सिस्टम के साथ कुछ व्यावहारिक काम करें और प्रक्रिया के माध्यम से काम करें। यदि आपके पास एक नहीं है, तो चिंता न करें, आप इन अगले कुछ पाठों का पालन कर सकते हैं। \n\nपहले हमें अपनी डिस्क को पार्टीशन करने की आवश्यकता है। इसे करने के लिए कई उपकरण उपलब्ध हैं: \n\n<ul>\n<li>fdisk - बुनियादी कमांड-लाइन पार्टीशनिंग उपकरण, यह GPT का समर्थन नहीं करता है</li>\n<li>parted - यह एक कमांड लाइन उपकरण है जो MBR और GPT पार्टीशनिंग दोनों का समर्थन करता है</li>\n<li>gparted - यह parted का GUI संस्करण है</li>\n<li>gdisk - fdisk, लेकिन यह MBR का समर्थन नहीं करता है, केवल GPT</li>\n</ul>\n\nचलो parted का उपयोग करके हमारा पार्टीशनिंग करें। मान लो मैं यूएसबी डिवाइस कनेक्ट करता हूं और हम देखते हैं कि डिवाइस का नाम /dev/sdb2 है। \n\n<b>parted को लॉन्च करें</b>\n\n<pre>$ sudo parted</pre>\n\nआप parted उपकरण में प्रवेश कर जाएंगे, यहाँ आप अपनी डिवाइस को पार्टीशन करने के लिए कमांड चला सकते हैं। \n\n<b>डिवाइस का चयन करें</b>\n\n<pre>select /dev/sdb2</pre>\n\nआपको काम कर रहे डिवाइस का चयन करने के लिए, उसे उसके डिवाइस नाम द्वारा चुनें।\n\n<b>वर्तमान पार्टीशन तालिका देखें</b>\n\n<pre>\n(parted) print                                                            \nModel: Seagate (scsi)\nDisk /dev/sda: 21.5GB\nSector size (logical/physical): 512B/512B\nPartition Table: msdos\n\nNumber  Start   End     Size    Type      File system     Flags\n 1      1049kB  6860MB  6859MB  primary   ext4            boot\n 2      6861MB  21.5GB  14.6GB  extended\n 5      6861MB  7380MB  519MB   logical   linux-swap(v1)\n 6      7381MB  21.5GB  14.1GB  logical   xfs\n</pre>\n\nयहाँ आप डिवाइस पर उपलब्ध पार्टीशन देखेंगे। <b>शुरुआत</b> और <b>समाप्ति</b> बिंदु हैं जहाँ पार्टीशन्स हार्ड ड्राइव पर स्थान लेते हैं, आपको अपने पार्टीशन के लिए एक अच्छा शुरुआत और समाप्ति स्थान ढूंढना होगा। \n\n<b>डिवाइस को पार्टीशन करें</b>\n\n<pre>mkpart primary 123 4567</pre>\n\nअब बस एक शुरुआत और समाप्ति बिंदु चुनें और पार्टीशन बनाएं, आपको पार्टीशन के प्रकार का निर्धारण करना होगा जिस परत आपने उपयोग किया। \n\n<b>पार्टीशन को आकार दें</b>\n\nयदि आपके पास कोई स्थान नहीं है तो आप पार्टीशन का आकार बढ़ा सकते हैं। \n\n<pre>resize 2 1245 3456</pre>\n\nपार्टीशन संख्या का चयन करें और फिर उस स्थान का चयन करें जहाँ आप इसे बढ़ाना चाहते हैं। \n\nParted एक बहुत शक्तिशाली उपकरण है और जब आप अपनी डिस्क को पार्टीशन कर रहे हो तो सावधान रहना चाहिए।",
  "exercise": "एक यूएसबी ड्राइव को पार्टीशन करें जिसमें ड्राइव का आधा हिस्सा ext4 और दूसरा आधा खाली हो।",
  "quizQuestion": "पार्टेड कमांड क्या है जिससे पार्टीशन बनाया जा सकता है?",
  "quizAnswer": "mkpart",
  "slug": "diskpartitioning"
}