{
  "id": 1,
  "title": "फ़ाइल सिस्टम व्यवस्था",
  "lessonContent": "इस बिंदु पर, आप शायद अपने सिस्टम के निर्देशिका संरचना के साथ अच्छी तरह से परिचित होंगे, यदि नहीं तो जल्द ही होंगे। फ़ाइल सिस्टम अपने संरचना के साथ भिन्न हो सकते हैं, लेकिन अधिकांश भाग में वे फ़ाइल सिस्टम व्यवस्था मानक का पालन करना चाहिए। \n\nआगे बढ़ें और <b>ls -l /</b> करें ताकि जड़ निर्देशिका के तहत सूचीबद्ध निर्देशिकाएँ देखें, आपकी निर्देशिका मेरी से भिन्न दिख सकती है, लेकिन अधिकांश भाग में निर्देशिकाएँ निम्नलिखित तरह दिखनी चाहिए:\n\n<ul>\n<li>/ - पूरे फ़ाइल सिस्टम व्यवस्था का मूल निर्देशिका, सब कुछ इस निर्देशिका के नीचे छिपा है।</li>\n<li>/bin - आवश्यक तैयार-चलने योग्य कार्यक्रम (बाइनरी), ls और cp जैसे सबसे मूल कमांड शामिल हैं।</li>\n<li>/boot - कर्नेल बूट लोडर फ़ाइलें शामिल हैं।</li>\n<li>/dev - डिवाइस फ़ाइलें।</li>\n<li>/etc - मूल सिस्टम कॉन्फ़िगरेशन निर्देशिका, केवल कॉन्फ़िगरेशन फ़ाइलें और कोई बाइनरी नहीं होना चाहिए।</li>\n<li>/home - उपयोगकर्ताओं के व्यक्तिगत निर्देशिकाएँ, आपके दस्तावेज़, फ़ाइलें, सेटिंग्स, आदि रखता है। </li>\n<li>/lib - बाइनरीज़ उपयोग कर सकती हैं पुस्तकालय फ़ाइलें रखता है।</li>\n<li>/media - USB ड्राइव्स जैसे हटाने योग्य मीडिया के लिए एक अटैचमेंट प्वाइंट के रूप में उपयोग किया जाता है।</li>\n<li>/mnt - अस्थायी रूप से माउंट किए गए फ़ाइल सिस्टम।</li>\n<li>/opt - वैकल्पिक एप्लिकेशन सॉफ़्टवेयर पैकेज।</li>\n<li>/proc - वर्तमान में चल रहे प्रक्रियाओं के बारे में जानकारी।</li>\n<li>/root - रूट उपयोगकर्ता का होम निर्देशिका।</li>\n<li>/run - पिछले बूट के बाद से चल रहे सिस्टम के बारे में जानकारी।</li>\n<li>/sbin - आवश्यक सिस्टम बाइनरीज़ शामिल हैं, आम तौर पर केवल रूट द्वारा चलाया जा सकता है।</li>\n<li>/srv - सिस्टम द्वारा सेवा प्रदान की जाने वाली साइट-विशिष्ट डेटा।</li>\n<li>/tmp - अस्थायी फ़ाइलों के लिए स्टोरेज</li>\n<li>/usr - यह दुर्भाग्यपूर्ण नाम है, अक्सर यह उपयोगकर्ता फ़ाइलें नहीं शामिल करता है एक होम फ़ोल्डर के रूप में। यह उपयोगकर्ता इंस्टॉल किए गए सॉफ़्टवेयर और उपयोगिताएँ के लिए है, हालांकि यह यह नहीं कहने के लिए है कि आप उसमें व्यक्तिगत निर्देशिकाएँ नहीं जोड़ सकते। इस निर्देशिका के अंदर /usr/bin, /usr/local, आदि के लिए उप-निर्देशिकाएँ हैं।</li>\n<li>/var - बदलते रहने वाले निर्देशिका, इसे सिस्टम लॉगिंग, उपयोगकर्ता ट्रैकिंग, कैशेस, आदि के लिए उपयोग किया जाता है। बुनियादी रूप से हर समय परिवर्तित होने वाला कुछ भी।</li>\n</ul>",
  "exercise": "अपने /usr निर्देशिका में देखें, वहाँ किस प्रकार की जानकारी स्थित है?",
  "quizQuestion": "लॉग रखने के लिए कौन सा निर्देशिका उपयोग किया जाता है?",
  "quizAnswer": "/var",
  "slug": "filesystemhierarchy"
}