{
  "id": 2,
  "title": "फ़ाइलसिस्टम प्रकार",
  "lessonContent": "कई विभिन्न फ़ाइलसिस्टम कार्यान्वयन उपलब्ध हैं। कुछ अन्य से तेज हैं, कुछ बड़ी क्षमता स्टोरेज का समर्थन करते हैं और अन्य केवल छोटी क्षमता स्टोरेज पर काम करते हैं। विभिन्न फ़ाइलसिस्टम के विभिन्न तरीके होते हैं अपने डेटा को संगठित करने के लिए और हम विस्तार से जानेंगे कि किस प्रकार के फ़ाइलसिस्टम होते हैं। क्योंकि इतने सारे विभिन्न कार्यान्वयन उपलब्ध हैं, ऐप्लिकेशन को विभिन्न ऑपरेशनों का सामना करने का एक तरीका चाहिए। इसलिए कुछ ऐसा है जिसे वर्चुअल फ़ाइल सिस्टम (VFS) अवस्थान परत कहा जाता है। यह ऐप्लिकेशन और विभिन्न फ़ाइलसिस्टम प्रकारों के बीच एक परत है, इसलिए चाहे आपके पास कौन सा भी फ़ाइलसिस्टम हो, आपकी ऐप्लिकेशन उसके साथ काम कर सकेंगी।\n\nआपके डिस्क पर कई फ़ाइलसिस्टम हो सकते हैं, यह उनके विभाजन के आधार पर है और हम आने वाले पाठ में इस पर जाएंगे।\n\n<b>जर्नलिंग</b>\n\nजर्नलिंग अधिकांश फ़ाइलसिस्टम प्रकार पर डिफ़ॉल्ट रूप से आता है, लेकिन यदि ऐसा नहीं है, तो आपको यह जानना चाहिए कि यह क्या करता है। मान लीजिए आप एक बड़ी फ़ाइल कॉपी कर रहे हैं और अचानक आपका पावर चला जाता है। अगर आप एक गैर-जर्नलिंग फ़ाइलसिस्टम पर हैं, तो फ़ाइल क्षतिग्रस्त हो जाएगी और आपका फ़ाइलसिस्टम असंगत हो जाएगा और फिर जब आप बूट करेंगे, तो आपका सिस्टम फ़ाइलसिस्टम जांच करेगा कि सब कुछ ठीक है। हालांकि, मरम्मत कितनी देर लेगी यह आपके फ़ाइलसिस्टम की विशालता पर निर्भर करेगी।\n\nअब अगर आप एक जर्नलिंग सिस्टम पर होते, तो जब भी आपकी मशीन फ़ाइल कॉपी करने लगती है, तो यह आपको कहानी फ़ाइल (जर्नल) में लिख देगी कि आप क्या करने वाले हैं। अब जब आप वास्तव में फ़ाइल कॉपी करते हैं, तो जब यह पूरा होता है, तो जर्नल उस कार्य को पूरा करने के रूप में चिह्नित करता है। इसके कारण फ़ाइलसिस्टम हमेशा एक संगत स्थिति में होता है, इसलिए यह यह जानेगा कि आपने अचानक अपनी मशीन बंद कर दी है तो आप कहाँ छोड़ गए थे। यह बूट समय को भी कम करता है क्योंकि पूरे फ़ाइलसिस्टम की जगह आपके जर्नल पर नजर डालता है।\n\n<b>सामान्य डेस्कटॉप फ़ाइलसिस्टम प्रकार</b>\n\n<ul>\n<li>ext4 - यह नेटिव लिनक्स फ़ाइलसिस्टम का सबसे वर्तमान संस्करण है। यह पुराने ext2 और ext3 संस्करणों के साथ संगत है। यह 1 एक्साबाइट तक डिस्क वॉल्यूम और 16 टेराबाइट तक फ़ाइल आकार का समर्थन करता है और बहुत कुछ। यह लिनक्स फ़ाइलसिस्टम के लिए मानक चयन है।</li>\n<li>Btrfs - \"बेटर या बटर एफएस\" यह लिनक्स के लिए एक नया फ़ाइलसिस्टम है जिसमें स्नैपशॉट, अतिरिक्त बैकअप, प्रदर्शन वृद्धि और बहुत कुछ शामिल है। यह व्यापक रूप से उपलब्ध है, लेकिन अभी तक स्थिर और संगत नहीं है।</li>\n<li>XFS - उच्च प्रदर्शन जर्नलिंग फ़ाइल सिस्टम, मीडिया सर्वर जैसे बड़ी फ़ाइलों के साथ एक सिस्टम के लिए बड़ा है।</li>\n<li>NTFS और FAT - विंडोज फ़ाइलसिस्टम</li>\n<li>HFS+ - मैकिंटॉश फ़ाइलसिस्टम</li>\n</ul>\n\nजांचें कि आपकी मशीन पर कौन से फ़ाइलसिस्टम हैं: \n\n<pre>\npete@icebox:~$ df -T\nFilesystem     Type     1K-blocks    Used Available Use% Mounted on\n/dev/sda1      ext4       6461592 2402708   3707604  40% /\nudev           devtmpfs    501356       4    501352   1% /dev\ntmpfs          tmpfs       102544    1068    101476   2% /run\n/dev/sda6      xfs       13752320  460112  13292208   4% /home\n</pre>\n\n<b>df</b> कमांड फ़ाइल सिस्टम डिस्क स्थान का उपयोग और अपने डिस्क के बारे में अन्य विवरण रिपोर्ट करता है, हम इस उपकरण के बारे में और भी बात करेंगे।",
  "exercise": "अन्य फ़ाइलसिस्टम प्रकारों पर ऑनलाइन थोड़ी सी अनुसंधान करें: राइज़रएफएस, जेडएफएस, जेएफएस और आपको मिल सकते हैं।",
  "quizQuestion": "सामान्य लिनक्स फ़ाइलसिस्टम प्रकार क्या है?",
  "quizAnswer": "ext4",
  "slug": "filesystemtypes"
}