{
  "id": 6,
  "title": "माउंट और अनमाउंट",
  "lessonContent": "अपने फ़ाइल सिस्टम की सामग्री देखने से पहले, आपको इसे माउंट करना होगा। उसके लिए मुझे डिवाइस स्थान, फ़ाइल सिस्टम प्रकार और माउंट प्वाइंट की आवश्यकता है, माउंट प्वाइंट सिस्टम पर एक निर्देशिका है जहां फ़ाइल सिस्टम जुड़ा जाएगा। तो हम बुनियादी रूप से अपनी डिवाइस को एक माउंट प्वाइंट पर माउंट करना चाहते हैं।\n\nसबसे पहले माउंट प्वाइंट बनाएं, हमारे मामले में <b>mkdir /mydrive</b>\n\n<pre>$ sudo mount -t ext4 /dev/sdb2 /mydrive</pre>\n\nइतना ही! अब जब हम /mydrive पर जाते हैं, हम अपनी फ़ाइल सिस्टम की सामग्री देख सकते हैं, <b>-t</b> फ़ाइल सिस्टम का प्रकार निर्दिष्ट करता है, फिर हमारे पास डिवाइस स्थान है, फिर माउंट प्वाइंट है।\n\nएक डिवाइस को माउंट प्वाइंट से अनमाउंट करने के लिए:\n\n<pre>$ sudo umount /mydrive \nया \n$ sudo umount /dev/sdb2</pre>\n\nध्यान रखें कि कर्नेल उन्हें उसी क्रम में डिवाइसों के नाम देता है जिसे वह पाता है। अगर किसी कारण से हमारे डिवाइस का नाम बदल जाता है उसके बाद हम इसे माउंट करते हैं? अच्छा भाग्य से, आप एक डिवाइस का यूनिवर्सल यूनिक आईडी (UUID) उपयोग कर सकते हैं।\n\nब्लॉक डिवाइस के लिए अपने सिस्टम पर UUID देखने के लिए:\n\n<pre>\npete@icebox:~$ sudo blkid\n/dev/sda1: UUID=\"130b882f-7d79-436d-a096-1e594c92bb76\" TYPE=\"ext4\" \n/dev/sda5: UUID=\"22c3d34b-467e-467c-b44d-f03803c2c526\" TYPE=\"swap\" \n/dev/sda6: UUID=\"78d203a0-7c18-49bd-9e07-54f44cdb5726\" TYPE=\"xfs\" \n</pre>\n\nहम अपने डिवाइसों के नाम, उनके संबंधित फ़ाइल सिस्टम प्रकार और उनके UUID देख सकते हैं। अब जब हम कुछ माउंट करना चाहते हैं, हम इस्तेमाल कर सकते हैं:\n\n<pre>$ sudo mount UUID=130b882f-7d79-436d-a096-1e594c92bb76 /mydrive</pre>\n\nअधिकांश समय आपको डिवाइसों को उनके UUID के माध्यम से माउंट करने की आवश्यकता नहीं होगी, डिवाइस नाम का उपयोग करना बहुत आसान है और अक्सर ऑपरेटिंग सिस्टम सामान्य डिवाइसों जैसे USB ड्राइव को माउंट करने के लिए जानता है। यदि आप स्टार्टअप पर ऑटोमैटिक रूप से किसी फ़ाइल सिस्टम को माउंट करना चाहते हैं जैसे अगर आपने एक द्वितीय हार्ड ड्राइव जोड़ा है, तो आपको UUID का उपयोग करना चाहिए और हम अगले सबक में इस पर चर्चा करेंगे।",
  "exercise": "माउंट और अनमाउंट के मैनपेज देखें और देखें कि आप कौन से अन्य विकल्प उपयोग कर सकते हैं।",
  "quizQuestion": "फ़ाइल सिस्टम को जोड़ने के लिए कौन सा कमांड उपयोग किया जाता है?",
  "quizAnswer": "माउंट",
  "slug": "फ़ाइल सिस्टम को माउंट और अनमाउंट करना"
}