{
  "id": 12,
  "title": "सिमलिंक्स",
  "lessonContent": "हम इनोड सूचना के पिछले उदाहरण का उपयोग करेंगे:\n\n<pre>\npete@icebox:~$ ls -li\n140 drwxr-xr-x 2 pete pete 6 जनवरी 20 20:13 डेस्कटॉप\n141 drwxr-xr-x 2 pete pete 6 जनवरी 20 20:01 दस्तावेज़\n</pre>\n\nआपने शायद नोट किया होगा कि हमने ls कमांड में तीसरे फील्ड को छोड़ दिया है, वह फ़ील्ड लिंक गणना है। लिंक गणना एक फ़ाइल के कठिन लिंकों की कुल संख्या है, जो अभी आपके लिए कुछ नहीं मतलब रखता है। तो चलिए पहले लिंक पर चर्चा करें।\n\n<b>सिम्बॉलिक लिंक्स</b>\n\nWindows ऑपरेटिंग सिस्टम में, चीज़ों को शॉर्टकट के रूप में जाना जाता है, शॉर्टकट्स बस अन्य फ़ाइलों के लिए उपनाम होते हैं। यदि आप मूल फ़ाइल पर कुछ करते हैं, तो आपको शॉर्टकट टूट सकता है। Linux में, शॉर्टकट का समकक्ष सिम्बॉलिक लिंक्स (या सॉफ्ट लिंक्स या सिमलिंक्स) हैं। सिम्बॉलिक लिंक्स हमें फ़ाइल को उसके फ़ाइलनाम से लिंक करने की अनुमति देते हैं। Linux में पाए जाने वाले अन्य प्रकार के लिंक्स हार्डलिंक्स हैं, ये वास्तव में एक इनोड को लिंक करने वाली एक और फ़ाइल हैं। चलिए देखते हैं कि मैं क्या मतलब है प्रैक्टिस करते हैं सिम्बॉलिक लिंक्स के साथ।\n\n<pre>\npete@icebox:~/Desktop$ echo 'myfile' > myfile\npete@icebox:~/Desktop$ echo 'myfile2' > myfile2\npete@icebox:~/Desktop$ echo 'myfile3' > myfile3\n\npete@icebox:~/Desktop$ ln -s myfile myfilelink\npete@icebox:~/Desktop$ ls -li\ntotal 12\n  151 -rw-rw-r-- 1 pete pete 7 जनवरी 21 21:36 myfile\n93401 -rw-rw-r-- 1 pete pete 8 जनवरी 21 21:36 myfile2\n93402 -rw-rw-r-- 1 pete pete 8 जनवरी 21 21:36 myfile3\n93403 lrwxrwxrwx 1 pete pete 6 जनवरी 21 21:39 myfilelink -> myfile\n</pre>\n\nआप देख सकते हैं कि मैंने myfile को निशानिका लिंक नामित किया है जो myfile को निशानित करता है। सिम्बॉलिक लिंक्स -> द्वारा दर्शाए जाते हैं। ध्यान दें कि मुझे एक नया इनोड नंबर मिल गया है, सिम्बॉलिक लिंक्स बस फ़ाइलें हैं जो फ़ाइलनामों को निशानित करती हैं। जब आप एक सिम्बॉलिक लिंक को संशोधित करते हैं, तो फ़ाइल भी संशोधित हो जाती है। इनोड नंबर फ़ाइलसिस्टम के लिए अद्वितीय होते हैं, आप एक सिंगल फ़ाइलसिस्टम में दो एक ही इनोड नंबर नहीं रख सकते, अर्थात आप एक फ़ाइल को एक अलग फ़ाइलसिस्टम में इनोड नंबर के द्वारा संदर्भित नहीं कर सकते। हालांकि, यदि आप सिम्बॉलिक लिंक्स का उपयोग करते हैं तो वे इनोड नंबर का उपयोग नहीं करते हैं, वे फ़ाइलनामों का उपयोग करते हैं, इसलिए वे विभिन्न फ़ाइलसिस्टमों में संदर्भित किए जा सकते हैं।\n\n<b>हार्डलिंक्स</b>\n\nएक हार्डलिंक का उदाहरण देखें:\n\n<pre>\npete@icebox:~/Desktop$ ln myfile2 myhardlink\npete@icebox:~/Desktop$ ls -li\ntotal 16\n  151 -rw-rw-r-- 1 pete pete 7 जनवरी 21 21:36 myfile\n93401 -rw-rw-r-- 2 pete pete 8 जनवरी 21 21:36 myfile2\n93402 -rw-rw-r-- 1 pete pete 8 जनवरी 21 21:36 myfile3\n93403 lrwxrwxrwx 1 pete pete 6 जनवरी 21 21:39 myfilelink -> myfile\n93401 -rw-rw-r-- 2 pete pete 8 जनवरी 21 21:36 myhardlink\n</pre>\n\nएक हार्डलिंक बस एक और इनोड के लिए एक लिंक बनाता है। तो अगर मैं myfile2 या myhardlink की सामग्री को संशोधित करता हूं, तो परिवर्तन दोनों पर दिखाई देगा, लेकिन अगर मैं myfile2 को हटा देता हूं, तो फ़ाइल अभी भी myhardlink के माध्यम से पहुंची जा सकती है। यहाँ हमारे ls कमांड में लिंक गणना का खेल आता है। लिंक गणना एक इनोड की हार्डलिंक्स की संख्या है, जब आप एक फ़ाइल को हटाते हैं, तो वह लिंक गणना कम हो जाएगी। इनोड केवल तब हटाया जाता है जब इनोड के सभी हार्डलिंक्स हटा दिए गए होते हैं। जब आप एक फ़ाइल बनाते हैं, तो उसकी लिंक गणना 1 होती है क्योंकि यह वह एकमात्र फ़ाइल है जो उस इनोड को निशानित कर रही है। सिम्बॉलिक लिंक्स की तरह, हार्डलिंक्स फ़ाइलसिस्टम के लिए अद्वितीय होते हैं क्योंकि इनोड फ़ाइलसिस्टम के लिए अद्वितीय होते हैं।\n\n<b>सिम्बॉलिक लिंक बनाना</b>\n\n<pre>\n$ ln -s myfile mylink</pre>\n\nएक सिम्बॉलिक लिंक बनाने के लिए, आप -s के साथ ln कमांड का उपयोग करते हैं और फिर एक लक्ष्य फ़ाइल और फिर एक लिंक नाम निर्दिष्ट करते हैं।\n\n<b>हार्डलिंक बनाना</b>\n\n<pre>\n$ ln somefile somelink</pre>\n\nसिम्बॉलिक लिंक निर्माण के लिए समान, केवल इस बार आप -s को छोड़ देते हैं।",
  "exercise": "सिम्लिंक्स और हार्डलिंक्स बनाने के साथ खेलें, कुछ हटाएं और देखें कि क्या होता है।",
  "quizQuestion": "सिम्बॉलिक लिंक बनाने के लिए कौन सा कमांड प्रयोग किया जाता है?",
  "quizAnswer": "ln -s",
  "slug": "symlinks"
}