{
  "id": 2,
  "title": "Contrôle du terminal",
  "lessonContent": "Nous avons discuté de la présence d'un champ TTY dans la sortie ps. Le TTY est le terminal qui a exécuté la commande.\n\nIl existe deux types de terminaux, les <b>périphériques de terminal</b> réguliers et les <b>périphériques de pseudo-terminal</b>. Un périphérique de terminal régulier est un périphérique terminal natif dans lequel vous pouvez saisir du texte et envoyer des sorties à votre système, cela ressemble à l'application de terminal que vous avez lancée pour accéder à votre shell, mais ce n'est pas la même chose. \n\nNous allons passer à l'action pour que vous puissiez voir cela, tapez Ctrl-Alt-F1 pour accéder à TTY1 (la première console virtuelle), vous remarquerez que vous n'avez rien d'autre que le terminal, pas de graphiques, etc. Cela est considéré comme un périphérique de terminal régulier, vous pouvez en sortir avec Ctrl-Alt-F7. \n\nUn pseudo-terminal est ce dans quoi vous avez l'habitude de travailler, ils émulent des terminaux avec la fenêtre de terminal shell et sont indiqués par PTS. Si vous regardez à nouveau ps, vous verrez votre processus shell sous pts/*. \n\nBon, revenons maintenant au contrôle du terminal, les processus sont généralement liés à un terminal de contrôle. Par exemple, si vous exécutez un programme dans votre fenêtre de shell comme find et que vous fermez la fenêtre, votre processus disparaîtra également. \n\nIl existe des processus tels que les processus démon, qui sont des processus spéciaux essentiels au bon fonctionnement du système. Ils démarrent souvent au démarrage du système et sont généralement arrêtés lorsque le système est éteint. Ils s'exécutent en arrière-plan et comme nous ne voulons pas que ces processus spéciaux soient arrêtés, ils ne sont pas liés à un terminal de contrôle. Dans la sortie ps, le TTY est indiqué par un <b>?</b> ce qui signifie qu'il n'a pas de terminal de contrôle.",
  "exercise": "Regardez votre sortie ps et listez toutes les valeurs TTY uniques.",
  "quizQuestion": "Quelle valeur est donnée pour un processus qui n'a pas de terminal de contrôle?",
  "quizAnswer": "?",
  "slug": "controllingterminal"
}