{
  "id": 11,
  "title": "Contrôle des tâches",
  "lessonContent": "Imaginons que vous travaillez sur une seule fenêtre de terminal et que vous exécutez une commande qui prend une éternité. Vous ne pouvez pas interagir avec le shell tant qu'elle n'est pas terminée, cependant nous voulons continuer à travailler sur nos machines, donc nous avons besoin de garder ce shell ouvert. Heureusement, nous pouvons contrôler la façon dont nos processus s'exécutent avec les tâches : \n\n<b>Envoyer une tâche en arrière-plan</b>\n\nAjouter un esperluette (&) à la commande l'exécutera en arrière-plan afin que vous puissiez toujours utiliser votre shell. Voyons un exemple :\n\n<pre>$ sleep 1000 &\n$ sleep 1001 &\n$ sleep 1002 &\n</pre>\n\n<b>Afficher toutes les tâches en arrière-plan</b>\n\nMaintenant vous pouvez voir les tâches que vous venez d'envoyer en arrière-plan.\n\n<pre>$ jobs\n\n[1]    En cours     sleep 1000 &\n[2]-   En cours     sleep 1001 &\n[3]+   En cours     sleep 1002 &\n\n</pre>\n\nCela vous montrera l'identifiant de la tâche dans la première colonne, puis le statut et la commande qui a été exécutée. Le <b>+</b> à côté de l'identifiant de la tâche signifie que c'est la tâche en arrière-plan la plus récente qui a démarré. La tâche avec le <b>-</b> est la deuxième commande la plus récente.\n\n<b>Envoyer une tâche en arrière-plan sur une tâche existante</b>\n\nSi vous avez déjà lancé une tâche et que vous voulez l'envoyer en arrière-plan, vous n'avez pas besoin de la terminer et de la redémarrer. Suspendez d'abord la tâche avec Ctrl-Z, puis exécutez la commande <b>bg</b> pour l'envoyer en arrière-plan.\n\n<pre>\npete@icebox ~ $ sleep 1003\n^Z\n[4]+    Arrêté     sleep 1003\n\npete@icebox ~ $ bg\n[4]+    sleep 1003 &\n\npete@icebox ~ $ jobs\n\n[1]    En cours     sleep 1000 &\n[2]    En cours     sleep 1001 &\n[3]-   En cours     sleep 1002 &\n[4]+   En cours     sleep 1003 &\n</pre>\n\n<b>Déplacer une tâche de l'arrière-plan au premier plan</b>\n\nPour ramener une tâche de l'arrière-plan, spécifiez simplement l'identifiant de la tâche que vous voulez. Si vous exécutez fg sans options, cela ramènera la tâche en arrière-plan la plus récente (la tâche avec le signe + à côté d'elle)\n\n<pre>$ fg %1</pre>\n\n<b>Arrêter les tâches en arrière-plan</b>\n\nTout comme pour déplacer des tâches de l'arrière-plan, vous pouvez utiliser la même forme pour arrêter les processus en utilisant leur identifiant de tâche.\n\n<pre>kill %1</pre>",
  "exercise": "Déplacez quelques tâches entre l'arrière-plan et le premier plan",
  "quizQuestion": "Quelle commande est utilisée pour lister les tâches en arrière-plan ?",
  "quizAnswer": "jobs",
  "slug": "controledestaches"
}