{
  "id": 1,
  "title": "ps (Processus)",
  "lessonContent": "Les processus sont les programmes qui s'exécutent sur votre machine. Ils sont gérés par le noyau et chaque processus a un identifiant associé appelé <b>identifiant de processus (PID).</b> Ce PID est attribué dans l'ordre de création des processus. \n\nAllez-y et exécutez la commande ps pour voir la liste des processus en cours d'exécution :\n\n<pre>$ ps\n\nPID        TTY     STAT   TIME          CMD\n41230    pts/4    Ss        00:00:00     bash\n51224    pts/4    R+        00:00:00     ps\n</pre>\n\nCela vous montre un aperçu rapide des processus actuels :\n\n<ul>\n<li>PID: Identifiant de processus</li>\n<li>TTY: Terminal de contrôle associé au processus (nous en parlerons en détail plus tard)</li>\n<li>STAT: Code d'état du processus</li>\n<li>TIME: Temps total d'utilisation du processeur</li>\n<li>CMD: Nom de l'exécutable/commande</li>\n</ul>\n\nSi vous regardez la page de manuel de ps, vous verrez qu'il existe de nombreuses options de commande que vous pouvez passer, elles varieront en fonction des options que vous souhaitez utiliser - BSD, GNU ou Unix. À mon avis, le style BSD est plus populaire à utiliser, donc nous allons opter pour celui-ci. Si vous êtes curieux de connaître la différence entre les styles, il s'agit du nombre de tirets que vous utilisez et des indicateurs.\n\n<pre>$ ps aux</pre>\n\nLe <b>a</b> affiche tous les processus en cours d'exécution, y compris ceux exécutés par d'autres utilisateurs. Le <b>u</b> affiche plus de détails sur les processus. Enfin, le <b>x</b> répertorie tous les processus qui n'ont pas de terminal associé, ces programmes afficheront un ? dans le champ TTY, ils sont les plus courants dans les processus de démon qui se lancent lors du démarrage du système.\n\nVous remarquerez que vous voyez maintenant beaucoup plus de champs, pas besoin de tous les mémoriser, dans un cours ultérieur sur les processus avancés, nous passerons en revue certains d'entre eux à nouveau :\n\n<ul>\n<li>USER: L'utilisateur effectif (celui dont nous utilisons l'accès)</li>\n<li>PID: Identifiant de processus</li>\n<li>%CPU: Temps CPU utilisé divisé par le temps d'exécution du processus</li>\n<li>%MEM: Ratio de la taille de l'ensemble résident du processus par rapport à la mémoire physique de la machine</li>\n<li>VSZ: Utilisation de la mémoire virtuelle de l'ensemble du processus</li>\n<li>RSS: Taille de l'ensemble résident, la mémoire physique non échangée qu'une tâche a utilisée</li>\n<li>TTY: Terminal de contrôle associé au processus</li>\n<li>STAT: Code d'état du processus</li>\n<li>START: Heure de démarrage du processus</li>\n<li>TIME: Temps total d'utilisation du processeur</li>\n<li>COMMAND: Nom de l'exécutable/commande</li>\n</ul>\n\nLa commande ps peut être un peu difficile à lire, pour l'instant les champs sur lesquels nous nous concentrerons le plus sont PID, STAT et COMMAND. \n\nUne autre commande très utile est la commande <b>top</b>, top vous donne des informations en temps réel sur les processus en cours d'exécution sur votre système au lieu d'un instantané. Par défaut, vous obtiendrez un rafraîchissement toutes les 10 secondes. Top est un outil extrêmement utile pour voir quels processus consomment beaucoup de vos ressources. \n\n<pre>$ top</pre>",
  "exercise": "Utilisez la commande ps avec différents indicateurs et voyez comment la sortie change.",
  "quizQuestion": "Quel indicateur ps est utilisé pour afficher des informations détaillées sur les processus?",
  "quizAnswer": "u",
  "slug": "surveiller-processus-commande-ps"
}