{
  "id": 5,
  "title": "Terminaison de processus",
  "lessonContent": "Maintenant que nous savons ce qui se passe lorsqu'un processus est créé, que se passe-t-il lorsque nous n'en avons plus besoin ? Soyez prévenus, parfois Linux peut devenir un peu sombre...\n\nUn processus peut se terminer en utilisant l'appel système _exit, ce qui libérera les ressources que le processus utilisait pour une réaffectation réelle. Ainsi, lorsqu'un processus est prêt à se terminer, il informe le noyau de la raison de sa terminaison avec quelque chose appelé un statut de terminaison. Le plus souvent, un statut de 0 signifie que le processus a réussi. Cependant, ce n'est pas suffisant pour terminer complètement un processus. Le processus parent doit reconnaître la terminaison du processus enfant en utilisant l'appel système wait et ce que cela fait, c'est qu'il vérifie le statut de terminaison du processus enfant. Je sais que c'est macabre d'y penser, mais l'appel wait est une nécessité, après tout, quel parent ne voudrait pas savoir comment son enfant est mort ?\n\nIl y a une autre façon de terminer un processus et cela implique l'utilisation de signaux, que nous discuterons bientôt.\n\n<b>Processus Orphelins</b>\n\nLorsqu'un processus parent meurt avant un processus enfant, le noyau sait qu'il ne recevra pas d'appel wait, il transforme donc ces processus en \"orphelins\" et les place sous la responsabilité de init (rappelez-vous la mère de tous les processus). Init effectuera finalement l'appel système wait pour ces orphelins afin qu'ils puissent mourir. \n\n<b>Processus Zombie</b>\n\nQue se passe-t-il lorsqu'un enfant se termine et que le processus parent n'a pas encore appelé wait ? Nous voulons quand même pouvoir voir comment un processus enfant s'est terminé, donc même si le processus enfant est terminé, le noyau transforme le processus enfant en un processus zombie. Les ressources utilisées par le processus enfant sont toujours libérées pour d'autres processus, cependant il y a toujours une entrée dans la table des processus pour ce zombie. Les processus zombies ne peuvent pas non plus être tués, car ils sont techniquement \"morts\", donc vous ne pouvez pas utiliser de signaux pour les tuer. Finalement, si le processus parent appelle l'appel système wait, le zombie disparaîtra, c'est ce qu'on appelle \"reaping\". Si le parent ne fait pas d'appel wait, init adoptera le zombie et effectuera automatiquement un wait et supprimera le zombie. Avoir trop de processus zombies peut être préjudiciable, car ils occupent de l'espace dans la table des processus, s'il est plein, cela empêchera d'autres processus de s'exécuter.",
  "exercise": "Aucun exercice pour cette leçon.",
  "quizQuestion": "Quel est le statut de terminaison le plus courant pour un processus réussi ?",
  "quizAnswer": "0",
  "slug": "terminaisonprocessus"
}