{
  "id": 6,
  "title": "Signaux",
  "lessonContent": "Un signal est une notification à un processus qu'il s'est passé quelque chose.\n\n<b>Pourquoi avons-nous des signaux</b>\n\nCe sont des interruptions logicielles et ils ont de nombreuses utilisations :\n\n<ul>\n<li>Un utilisateur peut taper l'un des caractères spéciaux du terminal (Ctrl-C) ou (Ctrl-Z) pour tuer, interrompre ou suspendre des processus</li>\n<li>Des problèmes matériels peuvent survenir et le noyau veut en informer le processus</li>\n<li>Des problèmes logiciels peuvent survenir et le noyau veut en informer le processus</li>\n<li>Ils sont essentiellement des moyens par lesquels les processus peuvent communiquer</li>\n</ul>\n\n<b>Processus de signal</b>\n\nLorsqu'un signal est généré par un événement, il est ensuite livré à un processus, il est considéré dans un état en attente jusqu'à ce qu'il soit livré. Lorsque le processus est exécuté, le signal sera livré. Cependant, les processus ont des masques de signaux et ils peuvent définir la livraison du signal pour être bloquée si spécifié. Lorsqu'un signal est livré, un processus peut faire une multitude de choses : \n\n<ul>\n<li>Ignorer le signal</li>\n<li>\"Attraper\" le signal et exécuter une routine de gestion spécifique</li>\n<li>Le processus peut être terminé, contrairement à l'appel système de sortie normal</li>\n<li>Bloquer le signal, en fonction du masque de signal</li>\n</ul>\n\n<b>Signaux courants</b>\n\nChaque signal est défini par des entiers avec des noms symboliques qui sont sous la forme de SIGxxx. Certains des signaux les plus courants sont : \n\n<ul>\n<li>SIGHUP ou HUP ou 1 : Raccrochage</li>\n<li>SIGINT ou INT ou 2 : Interruption</li>\n<li>SIGKILL ou KILL ou 9 : Tuer</li>\n<li>SIGSEGV ou SEGV ou 11 : Violation de segmentation</li>\n<li>SIGTERM ou TERM ou 15 : Terminaison logicielle</li>\n<li>SIGSTOP ou STOP : Arrêt</li>\n</ul>\n\nLes nombres peuvent varier avec les signaux, donc ils sont généralement désignés par leurs noms.\n\nCertains signaux sont inbloquables, un exemple est le signal SIGKILL. Le signal KILL détruit le processus.",
  "exercise": "Aucun exercice pour cette leçon.",
  "quizQuestion": "Quel signal est inbloquable?",
  "quizAnswer": "SIGKILL",
  "slug": "signauxprocessus"
}