{
  "id": 8,
  "title": "gentillesse",
  "lessonContent": "Lorsque vous exécutez plusieurs tâches sur votre ordinateur, comme Chrome, Microsoft Word ou Photoshop en même temps, il peut sembler que ces processus s'exécutent simultanément, mais ce n'est pas tout à fait vrai. \n\nLes processus utilisent le CPU pendant une petite période de temps appelée tranche de temps. Ensuite, ils font une pause pendant quelques millisecondes et un autre processus obtient une petite tranche de temps. Par défaut, la planification des processus se fait de manière circulaire. Chaque processus obtient suffisamment de tranches de temps jusqu'à ce qu'il ait terminé son traitement. Le noyau gère tous ces changements de processus et le fait plutôt bien la plupart du temps.\n\nLes processus ne sont pas en mesure de décider quand et combien de temps ils obtiennent du temps CPU, si tous les processus se comportaient normalement, ils obtiendraient chacun (à peu près) une quantité égale de temps CPU. Cependant, il existe un moyen d'influencer l'algorithme de planification des processus du noyau avec une valeur de gentillesse. La gentillesse est un nom assez étrange, mais ce qu'elle signifie, c'est que les processus ont un nombre pour déterminer leur priorité pour le CPU. Un nombre élevé signifie que le processus est gentil et a une priorité plus basse pour le CPU, et un nombre bas ou négatif signifie que le processus n'est pas très gentil et veut obtenir autant de CPU que possible. \n\n<pre>$ top</pre>\n\nVous pouvez voir une colonne pour NI en ce moment, c'est le niveau de gentillesse d'un processus.\n\nPour changer le niveau de gentillesse, vous pouvez utiliser les commandes nice et renice:\n\n<pre>$ nice -n 5 apt upgrade</pre>\n\nLa commande nice est utilisée pour définir la priorité pour un nouveau processus. La commande renice est utilisée pour définir la priorité sur un processus existant. \n\n<pre>$ renice 10 -p 3245</pre>",
  "exercise": "Quels processus ne sont pas très gentils et pourquoi?",
  "quizQuestion": "Si je veux qu'un processus obtienne plus de priorité CPU, dois-je utiliser un nombre nice plus bas ou plus élevé?",
  "quizAnswer": "plus bas",
  "slug": "gentillesseprocessus"
}