{
  "id": 7,
  "title": "dd",
  "lessonContent": "Das dd-Tool ist super nützlich zum Konvertieren und Kopieren von Daten. Es liest Eingaben aus einer Datei oder einem Datenstrom und schreibt sie in eine Datei oder einen Datenstrom. \n\nBetrachten Sie den folgenden Befehl: \n\n<pre>$ dd if=/home/pete/backup.img of=/dev/sdb bs=1024 </pre>\n\nDieser Befehl kopiert die Inhalte von backup.img nach /dev/sdb. Es kopiert die Daten in Blöcken von 1024 Bytes, bis keine Daten mehr kopiert werden müssen. \n\n<ul>\n<li>if=Datei - Eingabedatei, liest aus einer Datei anstelle von der Standardeingabe</li>\n<li>of=Datei - Ausgabedatei, schreibt in eine Datei anstelle von der Standardausgabe</li>\n<li>bs=Bytes - Blockgröße, liest und schreibt diese Anzahl von Bytes Daten auf einmal. Sie können verschiedene Größenmetriken verwenden, indem Sie die Größe mit k für Kilobyte, m für Megabyte usw. kennzeichnen, also sind 1024 Bytes 1k</li>\n<li>count=Anzahl - Anzahl der zu kopierenden Blöcke.</li>\n</ul>\n\nSie werden einige dd-Befehle sehen, die die Option count verwenden, normalerweise mit dd if, wenn Sie eine Datei kopieren möchten, die 1 Megabyte groß ist, möchten Sie normalerweise sehen, dass die Datei als 1 Megabyte fertig kopiert ist. Angenommen, Sie führen den folgenden Befehl aus: \n\n<pre>$ dd if=/home/pete/backup.img of=/dev/sdb bs=1M count=2</pre>\n\nUnsere backup.img-Datei ist 10M groß, jedoch kopieren wir in diesem Befehl nur 1M 2-mal, sodass nur 2M kopiert werden und unsere kopierten Daten unvollständig sind. Count kann in vielen Situationen nützlich sein, aber wenn Sie nur Daten kopieren, können Sie count und sogar bs weitgehend weglassen. Wenn Sie Ihre Datenübertragungen wirklich optimieren möchten, sollten Sie diese Optionen verwenden.\n\ndd ist äußerst leistungsfähig, Sie können es verwenden, um Backups von allem zu erstellen, einschließlich ganzer Festplatten, Wiederherstellen von Festplattenabbildern und mehr. Seien Sie vorsichtig, dieses leistungsstarke Tool kann teuer werden, wenn Sie nicht sicher sind, was Sie tun.",
  "exercise": "Verwenden Sie den dd-Befehl, um ein Backup Ihres Laufwerks zu erstellen und die Ausgabe in eine .img-Datei zu setzen.",
  "quizQuestion": "Was ist die dd-Option für die Blockgröße?",
  "quizAnswer": "bs",
  "slug": "ddcommand"
}