{
  "id": 1,
  "title": "/dev Verzeichnis",
  "lessonContent": "Wenn Sie ein Gerät an Ihren Computer anschließen, benötigt es in der Regel einen Gerätetreiber, um ordnungsgemäß zu funktionieren. Sie können mit Gerätetreibern über Gerätedateien oder Geräteknoten interagieren, dies sind spezielle Dateien, die wie normale Dateien aussehen. Da diese Gerätedateien genauso wie normale Dateien sind, können Sie Programme wie ls, cat usw. verwenden, um mit ihnen zu interagieren. Diese Gerätedateien werden in der Regel im /dev Verzeichnis gespeichert. Gehen Sie voran und ls das /dev Verzeichnis auf Ihrem System, Sie werden eine große Anzahl von Gerätedateien sehen, die auf Ihrem System vorhanden sind. \n\n<pre>$ ls /dev </pre>\n\nEinige dieser Geräte haben Sie bereits verwendet und mit ihnen interagiert, wie z.B. /dev/null. Erinnern Sie sich, wenn wir Ausgaben nach /dev/null senden, weiß der Kernel, dass dieses Gerät alle unsere Eingaben annimmt und einfach verwirft, sodass nichts zurückgegeben wird.\n\nFrüher mussten Sie, wenn Sie ein Gerät zu Ihrem System hinzufügen wollten, die Gerätedatei in /dev hinzufügen und dann wahrscheinlich vergessen. Wiederholen Sie das ein paar Mal und Sie können sehen, wo das Problem lag. Das /dev Verzeichnis würde mit statischen Gerätedateien von Geräten überfüllt werden, die Sie längst aufgerüstet, nicht mehr verwendet usw. haben. Geräten werden auch Gerätedateien in der Reihenfolge zugewiesen, in der der Kernel sie findet. Wenn Sie also jedes Mal Ihr System neu starten, könnten die Geräte je nach Entdeckungszeitpunkt unterschiedliche Gerätedateien haben.\n\nZum Glück verwenden wir diese Methode nicht mehr, jetzt haben wir etwas, das wir verwenden, um Geräte dynamisch hinzuzufügen und zu entfernen, die derzeit auf dem System verwendet werden, und wir werden dies in den kommenden Lektionen besprechen.",
  "exercise": "Schauen Sie sich den Inhalt des /dev Verzeichnisses an, erkennen Sie bekannte Geräte?",
  "quizQuestion": "Wo werden Gerätedateien auf dem System gespeichert?",
  "quizAnswer": "/dev",
  "slug": "devdirectory"
}