{
  "id": 2,
  "title": "Gerätetypen",
  "lessonContent": "Bevor wir darüber sprechen, wie Geräte verwaltet werden, werfen wir tatsächlich einen Blick auf einige Geräte.\n\n<pre>$ ls -l /dev\nbrw-rw----   1 root disk      8,   0 Dec 20 20:13 sda\ncrw-rw-rw-   1 root root      1,   3 Dec 20 20:13 null\nsrw-rw-rw-   1 root root           0 Dec 20 20:13 log\nprw-r--r--   1 root root           0 Dec 20 20:13 fdata\n</pre>\n\nDie Spalten sind von links nach rechts wie folgt:\n\n<ul>\n<li>Berechtigungen</li>\n<li>Besitzer</li>\n<li>Gruppe</li>\n<li>Major Device Nummer</li>\n<li>Minor Device Nummer</li>\n<li>Zeitstempel</li>\n<li>Gerätename</li>\n</ul>\n\nDenken Sie daran, dass Sie im ls-Befehl den Dateityp mit dem ersten Bit in jeder Zeile sehen können. Gerätedateien werden wie folgt gekennzeichnet: \n\n<ul>\n<li>c - Zeichen</li>\n<li>b - Block</li>\n<li>p - Pipe</li>\n<li>s - Socket</li>\n</ul>\n\n<b>Zeichengerät</b>\n\nDiese Geräte übertragen Daten, aber nur ein Zeichen auf einmal. Sie werden viele Pseudogeräte (/dev/null) als Zeichengeräte sehen, diese Geräte sind nicht wirklich physisch mit dem Gerät verbunden, ermöglichen dem Betriebssystem jedoch eine größere Funktionalität. \n\n<b>Blockgerät</b>\n\nDiese Geräte übertragen Daten in großen festen Blockgrößen. Sie sehen häufig Geräte, die Datenblöcke verwenden, als Blockgeräte, wie z. B. Festplatten, Dateisysteme usw. \n\n<b>Rohrgerät</b>\n\nBenannte Rohre ermöglichen es zwei oder mehr Prozessen, miteinander zu kommunizieren. Sie ähneln Zeichengeräten, aber anstatt die Ausgabe an ein Gerät zu senden, wird sie an einen anderen Prozess gesendet. \n\n<b>Socket-Gerät</b>\n\nSocket-Geräte erleichtern die Kommunikation zwischen Prozessen, ähnlich wie Rohrgeräte, können aber mit vielen Prozessen gleichzeitig kommunizieren. \n\n<b>Gerätecharakterisierung</b>\n\nGeräte werden mit zwei Zahlen charakterisiert, <b>Major Device Nummer</b> und <b>Minor Device Nummer</b>. Sie können diese Zahlen im obigen ls-Beispiel sehen, sie sind durch ein Komma getrennt. Angenommen, ein Gerät hätte die Gerätenummern: <b>8, 0</b>:\n\nDie Major Device Nummer repräsentiert den Gerätetreiber, der verwendet wird, in diesem Fall 8, was oft die Hauptnummer für sd-Blockgeräte ist. Die Minor-Nummer gibt dem Kernel an, um welches eindeutige Gerät es sich in dieser Treiberklasse handelt, in diesem Fall wird 0 verwendet, um das erste Gerät (a) zu repräsentieren.",
  "exercise": "Schauen Sie sich Ihr /dev-Verzeichnis an und finden Sie heraus, welche Arten von Geräten Sie sehen können.",
  "quizQuestion": "Was ist das Symbol für Zeichengeräte im ls -l Befehl?",
  "quizAnswer": "c",
  "slug": "devicetypes"
}