{
  "id": 2,
  "title": "типы устройств",
  "lessonContent": "Прежде чем мы поговорим о том, как управляются устройства, давайте посмотрим на некоторые устройства.\n\n<pre>$ ls -l /dev\nbrw-rw----   1 root disk      8,   0 Dec 20 20:13 sda\ncrw-rw-rw-   1 root root      1,   3 Dec 20 20:13 null\nsrw-rw-rw-   1 root root           0 Dec 20 20:13 log\nprw-r--r--   1 root root           0 Dec 20 20:13 fdata\n</pre>\n\nСтолбцы следуют слева направо:\n\n<ul>\n<li>Разрешения</li>\n<li>Владелец</li>\n<li>Группа</li>\n<li>Основной номер устройства</li>\n<li>Дополнительный номер устройства</li>\n<li>Отметка времени</li>\n<li>Имя устройства</li>\n</ul>\n\nПомните, что в команде ls вы можете увидеть тип файла с первым битом в каждой строке. Файлы устройств обозначаются следующим образом: \n\n<ul>\n<li>c - символьное устройство</li>\n<li>b - блочное устройство</li>\n<li>p - канал</li>\n<li>s - сокет</li>\n</ul>\n\n<b>Символьное устройство</b>\n\nЭти устройства передают данные, но по одному символу за раз. Вы увидите много псевдоустройств (/dev/null) как символьные устройства, эти устройства фактически не физически подключены к машине, но позволяют операционной системе больше функциональности. \n\n<b>Блочное устройство</b>\n\nЭти устройства передают данные блоками фиксированного размера. Вы чаще всего увидите устройства, которые используют блоки данных как блочные устройства, такие как жесткие диски, файловые системы и т. д. \n\n<b>Канальное устройство</b>\n\nИменованные каналы позволяют двум или более процессам общаться друг с другом, они похожи на символьные устройства, но вместо вывода на устройство данные отправляются другому процессу. \n\n<b>Сокетное устройство</b>\n\nСокетные устройства облегчают общение между процессами, аналогично канальным устройствам, но они могут общаться сразу с несколькими процессами. \n\n<b>Характеристика устройства</b>\n\nУстройства характеризуются двумя числами, <b>основным номером устройства</b> и <b>дополнительным номером устройства</b>. Вы можете увидеть эти числа в приведенном выше примере ls, они разделены запятой. Например, предположим, что у устройства номера: <b>8, 0</b>:\n\nОсновной номер устройства представляет собой драйвер устройства, который используется, в данном случае 8, который часто является основным номером для блочных устройств sd. Дополнительный номер сообщает ядру, какое уникальное устройство в этом классе драйверов, в данном случае 0 используется для представления первого устройства (a).",
  "exercise": "Посмотрите на ваш каталог /dev и определите, какие типы устройств вы видите.",
  "quizQuestion": "Какой символ обозначает символьные устройства в команде ls -l?",
  "quizAnswer": "c",
  "slug": "типыустройств"
}