{
  "id": 3,
  "title": "Pfad eines Pakets",
  "lessonContent": "<b>Lassen Sie uns betrachten, wie ein Paket innerhalb seines lokalen Netzwerks reist</b>\n\n<ol>\n<li>Zuerst vergleicht die lokale Maschine die Ziel-IP-Adresse, um zu sehen, ob sie sich im selben Subnetz befindet, indem sie ihre Subnetzmaske betrachtet.</li>\n<li>Wenn Pakete gesendet werden, müssen sie eine Quell-MAC-Adresse, eine Ziel-MAC-Adresse, eine Quell-IP-Adresse und eine Ziel-IP-Adresse haben, zu diesem Zeitpunkt kennen wir jedoch nicht die Ziel-MAC-Adresse.</li>\n<li>Um zum Zielrechner zu gelangen, verwenden wir ARP, um eine Anfrage im lokalen Netzwerk zu senden und die MAC-Adresse des Zielrechners zu finden.</li>\n<li>Jetzt kann das Paket erfolgreich gesendet werden!</li>\n</ol>\n\n<b>Lassen Sie uns betrachten, wie ein Paket außerhalb seines Netzwerks reist</b>\n\n<ol>\n<li>Zuerst vergleicht die lokale Maschine die Ziel-IP-Adresse, da sie außerhalb unseres Netzwerks liegt, sieht sie nicht die MAC-Adresse des Zielrechners. Und wir können ARP nicht verwenden, da die ARP-Anfrage an lokal verbundene Hosts gesendet wird.</li>\n<li>Also schaut unser Paket nun in die Routingtabelle, es kennt die Adresse der Ziel-IP nicht, also sendet es sie an das Standardgateway (einen anderen Router). Jetzt enthält unser Paket unsere Quell-IP, Ziel-IP und Quell-MAC, jedoch haben wir keine Ziel-MAC. Denken Sie daran, MAC-Adressen sind nur im selben Netzwerk erreichbar. Was tut es also? Es sendet eine ARP-Anfrage, um die MAC-Adresse des Standardgateways zu erhalten.</li>\n<li>Der Router betrachtet das Paket und bestätigt die Ziel-MAC-Adresse, aber es ist nicht die endgültige Ziel-IP-Adresse, also schaut er weiter in die Routingtabelle, um das Paket an eine andere IP-Adresse weiterzuleiten, die dem Paket hilft, zu seinem Ziel zu gelangen. Jedes Mal, wenn das Paket weitergeleitet wird, entfernt es die alten Quell- und Ziel-MAC-Adressen und aktualisiert das Paket mit den neuen Quell- und Ziel-MAC-Adressen.</li>\n<li>Sobald das Paket im selben Netzwerk weitergeleitet wird, verwenden wir ARP, um die endgültige Ziel-MAC-Adresse zu finden</li>\n<li>Während dieses Prozesses ändert unser Paket weder die Quell- noch die Ziel-IP-Adresse.</li>\n</ol>",
  "exercise": "Keine Übungen für diese Lektion.",
  "quizQuestion": "Wie finden wir die MAC-Adresse einer IP-Adresse?",
  "quizAnswer": "ARP",
  "slug": "pfadeinespakets"
}