{
  "id": 1,
  "title": "Was ist ein Router?",
  "lessonContent": "Wir haben den Begriff Router bereits verwendet, hoffentlich wissen Sie, was das ist, da Sie wahrscheinlich einen zu Hause haben. Ein Router ermöglicht es Maschinen in einem Netzwerk, miteinander sowie mit anderen Netzwerken zu kommunizieren. Auf einem typischen Router finden Sie LAN-Ports, die es Ihren Maschinen ermöglichen, sich mit demselben lokalen Netzwerk zu verbinden, und Sie werden auch einen Internet-Uplink-Port haben, der Sie mit dem Internet verbindet. Manchmal sehen Sie diesen Port als WAN bezeichnet, weil er Sie im Grunde mit einem breiteren Netzwerk verbindet. Wenn wir irgendwelche Arten von Netzwerkaktivitäten durchführen, müssen sie durch den Router gehen. Der Router entscheidet, wohin unsere Netzwerkpakete gehen und welche hereinkommen. Er routet unsere Pakete zwischen mehreren Netzwerken, um vom Quellhost zum Zielhost zu gelangen. \n\n<b>Wie funktioniert ein Router?</b>\n\nDenken Sie beim Routing an die Postzustellung: Wir haben eine Adresse, an die wir einen Brief senden möchten. Wenn wir ihn zur Post bringen, sehen sie, oh, dieser geht nach Kalifornien, ich werde ihn auf den LKW nach Kalifornien legen (ich habe ehrlich gesagt keine Ahnung, wie das Postsystem funktioniert). Der Brief wird dann nach San Francisco geschickt, in San Francisco gibt es verschiedene Postleitzahlen, und in diesen Postleitzahlen gibt es kleinere Adresscodes, bis schließlich jemand in der Lage ist, Ihren Brief an die gewünschte Adresse zuzustellen. Andererseits, wenn Sie bereits in San Francisco und in derselben Postleitzahl wohnen, wird der Briefträger wahrscheinlich genau wissen, wohin der Brief gehen muss, ohne ihn an jemand anderen weitergeben zu müssen. \n\nWenn wir Pakete routen, verwenden sie ähnliche Adress-\"Routen\", z. B. um zu Netzwerk A zu gelangen, senden Sie diese Pakete an Netzwerk B. Wenn wir keine Route dafür festgelegt haben, haben wir eine Standardroute, die unsere Pakete nutzen. Diese Routen sind in einer Routingtabelle festgelegt, die unser System verwendet, um uns über Netzwerke zu navigieren.\n\n<b>Hops</b>\n\nWenn Pakete über Netzwerke bewegt werden, bewegen sie sich in Hops, ein Hop ist, wie wir grob die Entfernung messen, die das Paket zurücklegen muss, um vom Ursprung zum Ziel zu gelangen. Angenommen, ich habe zwei Router, die Host A mit Host B verbinden, dann sagen wir, dass es zwei Hops zwischen Host A und Host B gibt. Jeder Hop ist ein Zwischengerät wie die Router, die wir passieren müssen.\n\n<b>Grundlegender Unterschied zwischen Switching, Routing & Flooding verstehen</b>\nPacket SWITCHING bedeutet im Grunde, Daten zu empfangen, zu verarbeiten und an das Zielgerät weiterzuleiten.\nROUTING ist ein Prozess zur Erstellung der Routingtabelle, damit wir das SWITCHING besser durchführen können.\nVor dem Routing wurde FLOODING verwendet. Wenn ein Router nicht weiß, wohin er ein Paket senden soll, wird jedes eingehende Paket durch jede ausgehende Verbindung gesendet, außer der, über die es angekommen ist.",
  "exercise": "Keine Übungen für diese Lektion.",
  "quizQuestion": "Wie messen Pakete die Entfernung?",
  "quizAnswer": "Hops",
  "slug": "wasisteinrouter"
}