{
  "id": 3,
  "title": "Chemin d'un paquet",
  "lessonContent": "<b>Regardons comment un paquet voyage au sein de son réseau local</b>\n\n<ol>\n<li>Tout d'abord, la machine locale comparera l'adresse IP de destination pour voir si elle se trouve dans le même sous-réseau en regardant son masque de sous-réseau.</li>\n<li>Lorsque les paquets sont envoyés, ils doivent avoir une adresse MAC source, une adresse MAC de destination, une adresse IP source et une adresse IP de destination, à ce stade, nous ne connaissons pas encore l'adresse MAC de destination.</li>\n<li>Pour atteindre l'hôte de destination, nous utilisons ARP pour diffuser une demande sur le réseau local afin de trouver l'adresse MAC de l'hôte de destination.</li>\n<li>Maintenant, le paquet peut être envoyé avec succès !</li>\n</ol>\n\n<b>Voyons comment un paquet voyage en dehors de son réseau</b>\n\n<ol>\n<li>Tout d'abord, la machine locale comparera l'adresse IP de destination, puisqu'elle est en dehors de notre réseau, elle ne voit pas l'adresse MAC de l'hôte de destination. Et nous ne pouvons pas utiliser ARP car la demande ARP est une diffusion aux hôtes connectés localement.</li>\n<li>Donc notre paquet regarde maintenant la table de routage, il ne connaît pas l'adresse de l'IP de destination, donc il l'envoie vers la passerelle par défaut (un autre routeur). Maintenant notre paquet contient notre IP source, l'IP de destination et l'adresse MAC source, cependant nous n'avons pas d'adresse MAC de destination. Rappelez-vous que les adresses MAC ne sont accessibles que via le même réseau. Que fait-il alors ? Il envoie une demande ARP pour obtenir l'adresse MAC de la passerelle par défaut.</li>\n<li>Le routeur examine le paquet et confirme l'adresse MAC de destination, mais ce n'est pas l'adresse IP de destination finale, donc il continue de regarder la table de routage pour transférer le paquet vers une autre adresse IP qui peut aider le paquet à avancer vers sa destination. À chaque déplacement du paquet, il supprime les anciennes adresses MAC source et de destination et met à jour le paquet avec les nouvelles adresses MAC source et de destination.</li>\n<li>Une fois que le paquet est transféré vers le même réseau, nous utilisons ARP pour trouver l'adresse MAC de destination finale.</li>\n<li>Pendant ce processus, notre paquet ne modifie pas l'adresse IP source ou de destination.</li>\n</ol>",
  "exercise": "Pas d'exercices pour cette leçon.",
  "quizQuestion": "Comment trouvons-nous l'adresse MAC d'une adresse IP ?",
  "quizAnswer": "ARP",
  "slug": "chemindunpaquet"
}