{
  "id": 1,
  "title": "Qu'est-ce qu'un routeur?",
  "lessonContent": "Nous avons déjà utilisé ce terme routeur auparavant, j'espère que vous savez ce que c'est, car vous en avez probablement un chez vous. Un routeur permet aux machines d'un réseau de communiquer entre elles ainsi qu'avec d'autres réseaux. Sur un routeur typique, vous aurez des ports LAN, qui permettent à vos machines de se connecter au même réseau local, et vous aurez également un port de liaison Internet qui vous connecte à Internet, parfois vous verrez ce port étiqueté comme WAN, car il vous connecte essentiellement à un réseau plus large. Lorsque nous effectuons une quelconque activité de mise en réseau, cela doit passer par le routeur. Le routeur décide où vont nos paquets réseau et lesquels entrent. Il route nos paquets entre plusieurs réseaux pour passer de l'hôte source à l'hôte de destination. \n\n<b>Comment fonctionne un routeur?</b>\n\nPensez au routage de la même manière que la livraison de courrier, nous avons une adresse à laquelle nous voulons envoyer une lettre, lorsque nous l'envoyons au bureau de poste, ils reçoivent la lettre et voient, oh, cela va en Californie, je vais la mettre dans le camion qui va en Californie (je n'ai honnêtement aucune idée de comment fonctionne le système postal). La lettre est ensuite envoyée à San Francisco, à l'intérieur de San Francisco, il y a différents codes postaux, et ensuite dans ces codes postaux, il y a de plus petits codes d'adresse, jusqu'à ce que quelqu'un puisse enfin livrer votre lettre à l'adresse souhaitée. En revanche, si vous habitiez déjà à San Francisco et dans le même code postal, le facteur saura probablement exactement où la lettre doit aller sans la remettre à quelqu'un d'autre. \n\nLorsque nous routons des paquets, ils utilisent des \"routes\" d'adresse similaires, par exemple pour accéder au réseau A, envoyer ces paquets au réseau B. Lorsque nous n'avons pas de route définie pour cela, nous avons une route par défaut que nos paquets utiliseront. Ces routes sont définies sur une table de routage que notre système utilise pour nous guider à travers les réseaux.\n\n<b>Sauts</b>\n\nÀ mesure que les paquets se déplacent à travers les réseaux, ils voyagent par sauts, un saut est la manière dont nous mesurons approximativement la distance que le paquet doit parcourir pour passer de la source à la destination. Disons que j'ai deux routeurs connectant l'hôte A à l'hôte B, donc nous disons qu'il y a deux sauts entre l'hôte A et l'hôte B. Chaque saut est un dispositif intermédiaire comme les routeurs que nous devons traverser.\n\n<b>Comprendre la différence fondamentale entre la commutation, le routage et le floodage?</b>\nLa COMMUTATION de paquets consiste essentiellement à recevoir, traiter et transmettre des données à l'appareil de destination.\nLe ROUTAGE est un processus de création de la table de routage, afin que nous puissions effectuer la COMMUTATION de manière plus efficace.\nAvant le routage, le FLOODAGE était utilisé. Si un routeur ne sait pas dans quelle direction envoyer un paquet, alors chaque paquet entrant est envoyé par chaque lien sortant sauf celui par lequel il est arrivé.",
  "exercise": "Aucun exercice pour cette leçon.",
  "quizQuestion": "Comment les paquets mesurent-ils la distance?",
  "quizAnswer": "sauts",
  "slug": "qu-est-ce-qu-un-routeur"
}