{
  "id": 4,
  "title": "netstat",
  "lessonContent": "<b>Portas Bem Conhecidas</b>\n\nNós discutimos a transmissão de dados através de portas em nossa máquina, vamos olhar algumas portas bem conhecidas.\n\nVocê pode obter uma lista de portas bem conhecidas olhando o arquivo <b>/etc/services</b>: \n\n<pre>\nftp             21/tcp\nssh             22/tcp\nsmtp            25/tcp \ndomain          53/tcp  # DNS\nhttp            80/tcp\nhttps           443/tcp\n..etc..\n</pre>\n\nA primeira coluna é o nome do serviço, em seguida, o número da porta e o protocolo da camada de transporte que ele usa.\n\n<b>netstat</b>\n\nUma ferramenta extremamente útil para obter informações detalhadas sobre sua rede é o <b>netstat</b>. Netstat exibe várias informações relacionadas à rede, como conexões de rede, tabelas de roteamento, informações sobre interfaces de rede e muito mais, é a ferramenta canivete suíço das ferramentas de rede. Vamos nos concentrar principalmente em uma funcionalidade que o netstat possui e é o status das conexões de rede. Antes de vermos um exemplo, vamos falar sobre sockets e portas primeiro. Um socket é uma interface que permite que programas enviem e recebam dados, enquanto uma porta é usada para identificar qual aplicativo deve enviar ou receber dados. O endereço do socket é a combinação do endereço IP e da porta. Cada conexão entre um host e um destino requer um socket único. Por exemplo, o HTTP é um serviço que roda na porta 80, no entanto, podemos ter muitas conexões HTTP e para manter cada conexão, um socket é criado por conexão.\n\n<pre>\npete@icebox:~$ netstat -at\nConexões ativas na Internet (servidores e estabelecidas)\nProto Recv-Q Send-Q Endereço Local           Endereço Remoto         Estado      \ntcp        0      0 icebox:domain           *:*                     LISTEN     \ntcp        0      0 localhost:ipp           *:*                     LISTEN     \ntcp        0      0 icebox.lan:44468        124.28.28.50:http       TIME_WAIT  \ntcp        0      0 icebox.lan:34751        124.28.29.50:http       TIME_WAIT  \ntcp        0      0 icebox.lan:34604        economy.canonical.:http TIME_WAIT  \ntcp6       0      0 ip6-localhost:ipp       [::]:*                  LISTEN     \ntcp6       1      0 ip6-localhost:35094     ip6-localhost:ipp       CLOSE_WAIT \ntcp6       0      0 ip6-localhost:ipp       ip6-localhost:35094     FIN_WAIT2\n</pre>\n\nO comando netstat -a mostra os sockets ouvintes e não ouvintes para conexões de rede, a flag -t mostra apenas conexões tcp. \n\nAs colunas são as seguintes da esquerda para a direita:\n\n<ul>\n<li>Proto: Protocolo utilizado, TCP ou UDP.</li>\n<li>Recv-Q: Dados enfileirados para serem recebidos</li>\n<li>Send-Q: Dados enfileirados para serem enviados</li>\n<li>Endereço Local: Host conectado localmente</li>\n<li>Endereço Remoto: Host conectado remotamente</li>\n<li>Estado: O estado do socket</li>\n</ul>\n\nConsulte a página do manual para uma lista de estados de socket, mas aqui estão alguns:\n\n<ul>\n<li>LISTENING: O socket está ouvindo conexões de entrada, lembre-se que quando fazemos uma conexão TCP, nosso destino tem que estar ouvindo para que possamos nos conectar.</li>\n<li>SYN_SENT: O socket está tentando ativamente estabelecer uma conexão.</li>\n<li>ESTABLISHED: O socket tem uma conexão estabelecida</li>\n<li>CLOSE_WAIT: O host remoto encerrou e estamos aguardando o fechamento do socket</li>\n<li>TIME_WAIT: O socket está aguardando após o fechamento para lidar com pacotes ainda na rede</li>\n </ul>",
  "exercise": "Consulte a página do manual para o netstat e aprenda todas as funcionalidades que ele tem a oferecer.",
  "quizQuestion": "Qual porta é usada para HTTPS?",
  "quizAnswer": "443",
  "slug": "netstat"
}