{
  "id": 5,
  "title": "Análise de Pacotes",
  "lessonContent": "O assunto da análise de pacotes poderia preencher um curso inteiro e existem muitos livros escritos apenas sobre análise de pacotes. No entanto, hoje aprenderemos apenas o básico. Existem dois analisadores de pacotes extremamente populares, Wireshark e tcpdump. Essas ferramentas escaneiam suas interfaces de rede, capturam a atividade dos pacotes, analisam os pacotes e nos mostram as informações. Elas nos permitem entrar nos detalhes da análise de rede e nos aprofundar nas questões de baixo nível. Vamos usar o tcpdump, já que ele tem uma interface mais simples, no entanto, se você quiser adotar a análise de pacotes em suas ferramentas, eu recomendaria dar uma olhada no Wireshark.\n\n<b>Instalar o tcpdump</b>\n\n<pre>\n$ sudo apt install tcpdump\n</pre>\n\n<b>Capturar dados do pacote em uma interface</b>\n\n<pre>\npete@icebox:~$ sudo tcpdump -i wlan0\ntcpdump: saída detalhada suprimida, use -v ou -vv para decodificação completa do protocolo\nescutando em wlan0, tipo de link EN10MB (Ethernet), tamanho de captura 65535 bytes\n11:28:23.958840 IP icebox.lan > nuq04s29-in-f4.1e100.net: solicitação de eco ICMP, id 1901, seq 2, comprimento 64\n11:28:23.970928 IP nuq04s29-in-f4.1e100.net > icebox.lan: resposta de eco ICMP, id 1901, seq 2, comprimento 64\n11:28:24.960464 IP icebox.lan > nuq04s29-in-f4.1e100.net: solicitação de eco ICMP, id 1901, seq 3, comprimento 64\n11:28:24.979299 IP nuq04s29-in-f4.1e100.net > icebox.lan: resposta de eco ICMP, id 1901, seq 3, comprimento 64\n11:28:25.961869 IP icebox.lan > nuq04s29-in-f4.1e100.net: solicitação de eco ICMP, id 1901, seq 4, comprimento 64\n11:28:25.976176 IP nuq04s29-in-f4.1e100.net > icebox.lan: resposta de eco ICMP, id 1901, seq 4, comprimento 64\n11:28:26.963667 IP icebox.lan > nuq04s29-in-f4.1e100.net: solicitação de eco ICMP, id 1901, seq 5, comprimento 64\n11:28:26.976137 IP nuq04s29-in-f4.1e100.net > icebox.lan: resposta de eco ICMP, id 1901, seq 5, comprimento 64\n11:28:30.674953 ARP, Solicitação quem-tem 172.254.1.0 informar ThePickleParty.lan, comprimento 28\n11:28:31.190665 IP ThePickleParty.lan.51056 > 192.168.86.255.rfe: UDP, comprimento 306\n</pre>\n\nVocê notará muitas coisas acontecendo quando executar uma captura de pacotes, bem, isso é de se esperar, há muita atividade de rede acontecendo em segundo plano. No meu exemplo acima, peguei apenas um trecho da minha captura, especificamente o momento em que decidi fazer ping em www.google.com. \n\n<b>Entendendo a saída</b>\n\n<pre>\n11:28:23.958840 IP icebox.lan > nuq04s29-in-f4.1e100.net: solicitação de eco ICMP, id 1901, seq 2, comprimento 64\n11:28:23.970928 IP nuq04s29-in-f4.1e100.net > icebox.lan: resposta de eco ICMP, id 1901, seq 2, comprimento 64\n</pre>\n\n<ul>\n<li>O primeiro campo é um carimbo de data/hora da atividade de rede</li>\n<li>IP, isso contém as informações do protocolo</li>\n<li>Em seguida, você verá o endereço de origem e destino: icebox.lan > nuq04s29-in-f4.1e100.net</li>\n<li>seq, este é o número de sequência inicial e final dos pacotes TCP</li>\n<li>comprimento, comprimento em bytes</li>\n</ul>\n\nComo você pode ver em nossa saída do tcpdump, estamos enviando um pacote de solicitação de eco ICMP para www.google.com e recebendo um pacote de resposta de eco ICMP em retorno! Também observe que diferentes pacotes fornecerão informações diferentes, consulte o manual para ver quais são essas informações.\n\n<b>Escrevendo a saída do tcpdump em um arquivo</b>\n\n<pre>\n$ sudo tcpdump -w /algum/arquivo\n</pre>\n\n\nAlguns pensamentos finais: apenas arranhamos a superfície do assunto da análise de pacotes. Há muito para se explorar e nem mesmo tocamos em ir ainda mais fundo com a saída Hex e ASCII. Existem muitos recursos online para ajudá-lo a aprender mais sobre analisadores de pacotes e eu o encorajo a encontrá-los!",
  "exercise": "Baixe e instale a ferramenta Wireshark e explore a interface.",
  "quizQuestion": "Qual é a flag para capturar uma interface específica com o tcpdump?",
  "quizAnswer": "-i",
  "slug": "analise-de-pacotes"
}