{
  "id": 2,
  "title": "ping",
  "lessonContent": "Um dos mais simples ferramentas de rede <b>ping</b>, é usado para testar se um pacote pode alcançar um host. Funciona enviando pacotes de solicitação de eco ICMP (Tipo 8) para o host de destino e aguardando uma resposta de eco ICMP (Tipo 0). O ping é bem-sucedido quando um host envia o pacote de solicitação e recebe uma resposta do destino. Vamos ver um exemplo: \n\n<pre>\npete@icebox:~$ ping -c 3 www.google.com\nPING www.google.com (74.125.239.112) 56(84) bytes of data.\n64 bytes from nuq05s01-in-f16.1e100.net (74.125.239.112): icmp_seq=1 ttl=128 time=29.0 ms\n64 bytes from nuq05s01-in-f16.1e100.net (74.125.239.112): icmp_seq=2 ttl=128 time=23.7 ms\n64 bytes from nuq05s01-in-f16.1e100.net (74.125.239.112): icmp_seq=3 ttl=128 time=15.1 ms\n</pre>\n\nNeste exemplo, estamos usando o ping para verificar se conseguimos chegar ao www.google.com. A bandeira -c (contagem) é usada para parar de enviar pacotes de solicitação de eco após a contagem ter sido atingida. \n\nA primeira parte diz que estamos enviando pacotes de 64 bytes para 74.125.239.112 (google.com) e o restante nos mostra os detalhes da viagem. Por padrão, ele envia um pacote por segundo.\n\n<b>icmp_seq</b>\n\nO campo icmp_seq é usado para mostrar o número de sequência dos pacotes enviados, então neste caso, enviei 3 pacotes e podemos ver que 3 pacotes retornaram. Se você fizer um ping e alguns números de sequência estiverem faltando, isso significa que algum problema de conectividade está ocorrendo e nem todos os seus pacotes estão passando. Se o número de sequência estiver fora de ordem, sua conexão provavelmente está muito lenta, pois seus pacotes estão excedendo o padrão de um segundo. \n\n<b>ttl</b>\n\nO campo Time To Live (ttl) é usado como um contador de saltos, à medida que você faz saltos, ele decrementa o contador em um e, uma vez que o contador de saltos atinge 0, nosso pacote morre. Isso é para dar ao pacote uma vida útil, não queremos que nossos pacotes viajem para sempre.\n\n<b>time</b>\n\nO tempo de ida e volta desde o envio do pacote de solicitação de eco até receber uma resposta de eco.",
  "exercise": "Faça um ping em um site e veja a saída que você recebe.",
  "quizQuestion": "Qual é a unidade de medida do tempo de ida e volta?",
  "quizAnswer": "ms",
  "slug": "ping"
}