{
  "id": 6,
  "title": "Módulos del Kernel",
  "lessonContent": "Imaginemos que tengo un coche genial, invierto mucho tiempo y dinero en él. Añado un alerón, un enganche, un portabicicletas y otras cosas aleatorias. Estos componentes en realidad no cambian la funcionalidad principal del coche y puedo quitarlos y añadirlos muy fácilmente. El kernel utiliza el mismo concepto con los módulos del kernel.\n\nEl kernel en sí mismo es una pieza de software monolítica, cuando queremos añadir soporte para un nuevo tipo de teclado, no escribimos este código directamente en el código del kernel. Así como no fusionaríamos un portabicicletas a nuestro coche (bueno, tal vez algunas personas lo harían). Los módulos del kernel son piezas de código que pueden cargarse y descargarse en el kernel según la demanda. Nos permiten extender la funcionalidad del kernel sin añadir realmente al código principal del kernel. También podemos añadir módulos y no tener que reiniciar el sistema (en la mayoría de los casos).\n\n<b>Ver una lista de módulos cargados actualmente</b>\n\n<pre>$ lsmod</pre>\n\n<b>Cargar un módulo</b>\n\n<pre>$ sudo modprobe bluetooth</pre>\n\nModprobe intenta cargar el módulo desde <b>/lib/modules/(versión del kernel)/kernel/drivers</b>. Los módulos del kernel también pueden tener dependencias, modprobe carga nuestras dependencias de módulos si estas aún no están cargadas. \n\n<b>Eliminar un módulo</b>\n\n<pre>$ sudo modprobe -r bluetooth</pre>\n\n<b>Cargar en el arranque</b>\n\nTambién puedes cargar módulos durante el arranque del sistema, en lugar de cargarlos temporalmente con modprobe (que se descargará cuando reinicies). Simplemente modifica el directorio <b>/etc/modprobe.d</b> y añade un archivo de configuración en él de la siguiente manera:\n\n<pre>pete@icebox:~$ /etc/modprobe.d/peanutbutter.conf\n\noptions peanut_butter type=almond\n</pre>\n\nUn ejemplo un poco extravagante, pero si tuvieras un módulo llamado peanut_butter y quisieras añadir un parámetro del kernel para type=almond, puedes hacer que se cargue al iniciar usando este archivo de configuración. También ten en cuenta que los módulos del kernel tienen sus propios parámetros del kernel, así que querrás leer sobre el módulo específicamente para obtener más información.\n\n<b>No cargar en el arranque</b>\n\nTambién puedes asegurarte de que un módulo no se cargue en el arranque añadiendo un archivo de configuración de la siguiente manera:\n\n<pre>pete@icebox:~$ /etc/modprobe.d/peanutbutter.conf\n\nblacklist peanut_butter\n</pre>",
  "exercise": "Descarga tu módulo de bluetooth con modprobe y observa qué sucede. ¿Cómo lo arreglarás?",
  "quizQuestion": "¿Qué comando se utiliza para descargar un módulo?",
  "quizAnswer": "modprobe -r",
  "slug": "kernelmodules"
}