{
  "id": 3,
  "title": "Upstart Overview",
  "lessonContent": "Upstart was developed by Canonical, so it was the init implementation on Ubuntu for a while, however on modern Ubuntu installations systemd is now used. Upstart was created to improve upon the issues with Sys V, such as the strict startup processes, blocking of tasks, etc. Upstart's event and job driven model allow it to respond to events as they happen. \n\nTo find out if you are using Upstart, if you have a /usr/share/upstart directory that's a pretty good indicator. \n\nJobs are the actions that Upstart performs and events are messages that are received from other processes to trigger jobs. To see a list of jobs and their configuration:\n\n<pre>\npete@icebox:~$ ls /etc/init\nacpid.conf                   mountnfs.sh.conf\nalsa-restore.conf            mtab.sh.conf\nalsa-state.conf              networking.conf\nalsa-store.conf              network-interface.conf\nanacron.conf                 network-interface-container.conf\n</pre>\n\nInside these job configurations, it'll include information on how to start jobs and when to start jobs.\n\nFor example, in the networking.conf file, it could say something as simple as:\n<pre>\nstart on runlevel [235]\nstop on runlevel [0]\n</pre>\n\nThis means that it will start setting up networking on runlevel 2, 3 or 5 and will stop networking on runlevel 0. There are many ways to write the configuration file and you'll discover that when you look at the different job configurations available. \n\nThe way that Upstart works is that: \n\n<ol>\n<li>First, it loads up the job configurations from /etc/init</li>\n<li>Once a startup event occurs, it will run jobs triggered by that event.</li>\n<li>These jobs will make new events and then those events will trigger more jobs</li>\n<li>Upstart continues to do this until it completes all the necessary jobs</li>\n</ol>",
  "exercise": "If you are running Upstart, see if you can make sense of the job configurations in /etc/init.",
  "quizQuestion": "What is the init implementation that is used by Ubuntu?",
  "quizAnswer": "upstart",
  "slug": "upstartoverview"
}
