{
  "id": 2,
  "title": "Zuerst einige Standard-Logdateien. Protokollierung nach Einrichtung.",
  "lessonContent": "Der Syslog-Dienst verwaltet und sendet Protokolle an den Systemlogger. Rsyslog ist eine weiterentwickelte Version von Syslog, die von den meisten Linux-Distributionen verwendet werden sollte. Die Ausgabe aller Protokolle, die der Syslog-Dienst sammelt, befindet sich unter /var/log/syslog (jede Nachricht außer Auth-Nachrichten).\n\nUm herauszufinden, welche Dateien von unserem Systemlogger verwaltet werden, schauen Sie sich die Konfigurationsdateien in /etc/rsyslog.d an:\n\n<pre>\npete@icebox:~$ less /etc/rsyslog.d/50-default.conf \n#\nauth,authpriv.*                 /var/log/auth.log\n*.*;auth,authpriv.none          -/var/log/syslog\n#cron.*                         /var/log/cron.log\n#daemon.*                       -/var/log/daemon.log\nkern.*                          -/var/log/kern.log\n#lpr.*                          -/var/log/lpr.log\nmail.*                          -/var/log/mail.log\n#user.*                         -/var/log/user.log\n</pre>\n\nDiese Regeln zur Protokollierung von Dateien werden durch den Selektor in der linken Spalte und die Aktion in der rechten Spalte gekennzeichnet. Die Aktion gibt an, wohin die Protokollinformationen gesendet werden sollen, in eine Datei, Konsole usw. Denken Sie daran, dass nicht jede Anwendung und Dienst rsyslog verwendet, um ihre Protokolle zu verwalten. Wenn Sie also speziell wissen möchten, was protokolliert wird, müssen Sie in dieses Verzeichnis schauen.\n\nLassen Sie uns die Protokollierung tatsächlich in Aktion sehen. Sie können manuell ein Protokoll mit dem Befehl logger senden:\n\n<pre>\nlogger -s Hallo\n</pre>\n\nSchauen Sie nun in Ihre /var/log/syslog und Sie sollten diesen Eintrag in Ihren Protokollen sehen!",
  "exercise": "Schauen Sie sich Ihre /etc/rsyslog.d-Konfigurationsdatei an und sehen Sie, was sonst noch über den Systemlogger protokolliert wird.",
  "quizQuestion": "Welchen Befehl können Sie verwenden, um manuell eine Nachricht zu protokollieren?",
  "quizAnswer": "logger",
  "slug": "syslog"
}