{
  "id": 1,
  "title": "Systemprotokollierung",
  "lessonContent": "Die Dienste, der Kernel, die Daemons usw. auf Ihrem System tun ständig etwas, diese Daten werden tatsächlich zur Speicherung auf Ihrem System in Form von Protokollen gesendet. Dies ermöglicht es uns, ein für Menschen lesbares Journal der Ereignisse zu haben, die auf unserem System stattfinden. Diese Daten werden normalerweise im /var-Verzeichnis aufbewahrt, das /var-Verzeichnis ist der Ort, an dem wir unsere variablen Daten wie Protokolle aufbewahren!\n\nWie werden diese Nachrichten überhaupt auf Ihrem System empfangen? Es gibt einen Dienst namens syslog, der diese Informationen an den Systemprotokollierer sendet.\n\nSyslog enthält tatsächlich viele Komponenten, eine der wichtigen ist ein laufender Daemon namens syslogd (neuere Linux-Distributionen verwenden rsyslogd), der auf Ereignisnachrichten wartet und diejenigen filtert, über die er informiert werden möchte, und je nachdem, was er mit dieser Nachricht tun soll, sendet er sie an eine Datei, Ihre Konsole oder tut nichts damit.\n\nMan würde denken, dass dieser Systemprotokollierer der zentrale Ort zur Verwaltung von Protokollen ist, aber leider ist er das nicht. Sie werden viele Anwendungen sehen, die ihre eigenen Protokollregeln schreiben und verschiedene Protokolldateien generieren, aber im Allgemeinen sollte das Format von Protokollen einen Zeitstempel und die Ereignisdetails enthalten.\n\nHier ist ein Beispiel für eine Zeile aus syslog:\n\n<pre>\npete@icebox:~$ less /var/log/syslog\nJan 27 07:41:32 icebox anacron[4650]: Job `cron.weekly' started\n</pre>\n\nHier sehen wir, dass am 27. Januar um 07:41:32 Uhr unser Cron-Dienst den cron.weekly-Job ausgeführt hat. Sie können alle Ereignisnachrichten anzeigen, die syslog in der Datei /var/log/syslog sammelt.",
  "exercise": "Schauen Sie sich Ihre /var/log/syslog-Datei an und sehen Sie, was sonst noch auf Ihrem Computer passiert.",
  "quizQuestion": "Welcher Daemon verwaltet Protokolle auf neueren Linux-Systemen?",
  "quizAnswer": "rsyslogd",
  "slug": "systemlogging"
}