{
  "id": 2,
  "title": "Процесс загрузки: BIOS",
  "lessonContent": "<b>BIOS</b>\n\nПервый этап процесса загрузки Linux - это BIOS, который выполняет проверку целостности системы. BIOS - это прошивка, которая наиболее распространена в совместимых с IBM PC компьютерах, доминирующем типе компьютеров на сегодняшний день. Вероятно, вы использовали прошивку BIOS для изменения порядка загрузки ваших жестких дисков, проверки системного времени, MAC-адреса вашего устройства и т. д. Основная цель BIOS - найти загрузчик системы.\n\nИтак, когда BIOS загружает жесткий диск, он ищет загрузочный блок, чтобы определить, как загрузить систему. В зависимости от того, как вы разбили свой диск, он будет искать загрузочную запись мастер-загрузчика (MBR) или GPT. MBR находится в первом секторе жесткого диска, первые 512 байт. MBR содержит код для загрузки другой программы где-то на диске, которая, в свою очередь, фактически загружает наш загрузчик.\n\nТеперь, если вы разбили свой диск с использованием GPT, местоположение загрузчика немного изменится.\n\n<b>UEFI</b>\n\nСуществует еще один способ загрузки вашей системы, помимо использования BIOS, и это UEFI (расшифровывается как \"Унифицированный расширяемый интерфейс прошивки\"). UEFI был разработан как преемник BIOS, большинство современного оборудования поставляется с встроенной прошивкой UEFI. Компьютеры Macintosh уже много лет используют загрузку через EFI, а Windows в основном перешли на загрузку через UEFI. Формат GPT предназначен для использования с EFI. Вам не обязательно нужен EFI, если вы загружаете диск GPT. Первый сектор диска GPT зарезервирован для \"защитного MBR\", чтобы можно было загрузить машину на основе BIOS.\n\nUEFI хранит всю информацию о запуске в файле .efi. Этот файл хранится на специальном разделе, называемом разделом системы EFI на оборудовании. Внутри этого раздела он будет содержать загрузчик. UEFI поставляется с множеством улучшений по сравнению с традиционной прошивкой BIOS. Однако, поскольку мы используем Linux, большинство из нас используют BIOS. Поэтому все эти уроки будут продолжаться с этим предположением.",
  "exercise": "Зайдите в меню BIOS и проверьте, включена ли загрузка через UEFI.",
  "quizQuestion": "Что загружает BIOS?",
  "quizAnswer": "загрузчик",
  "slug": "bootprocessbios"
}