{
  "id": 2,
  "title": "Subredes",
  "lessonContent": "¿Cómo puedo saber si estoy en la misma red que Patty? Bueno, simplemente podemos mirar la subred. Una subred es un grupo de hosts con direcciones IP que son similares de cierta manera. Estos hosts suelen estar en una ubicación cercana entre sí y puedes enviar datos fácilmente hacia y desde los hosts en la misma subred. Piénsalo como enviar correo en el mismo código postal, es mucho más fácil que enviar correo a un estado diferente. \n\nPor ejemplo, todos los hosts con una dirección IP que comienza con 123.45.67 estarían en la misma subred. Mi host tiene una IP de 123.45.67.8 y la de Patty es 123.45.67.9. Los números comunes son mi prefijo de red y el 8 y el 9 son nuestros hosts, por lo tanto mi red es la misma que la de Patty. Una subred se divide en un prefijo de red, como 123.45.67.0 y una máscara de subred.\n\n<b>Máscaras de Subred</b>\n\nLas máscaras de subred determinan qué parte de tu dirección IP es la porción de red y qué parte es la porción de host. \n\nUna máscara de subred típica puede verse algo así:\n\n<pre>255.255.255.0</pre>\n\nLa parte 255 es en realidad nuestra máscara. Para hacer esto un poco más fácil de entender, recuerda cómo nos referimos a cada octeto como 8 bits. En informática, un bit se denota con un 0 o un 1 en forma binaria. Cuando se usan números binarios, 1 significa encendido y 0 apagado. Entonces, ¿qué equivale a 8 0's o 1's?\n\nIntroduce en Google \"calculadora de binario a decimal\" y convierte 11111111 a forma decimal. ¿Qué obtienes? ¡255! Entonces un octeto va de 0 a 255. Entonces, si tuviéramos una máscara de subred de 255.255.255.0 y una dirección IP de 192.168.1.0, ¿cuántos hosts hay en esa subred? Descubriremos la respuesta en nuestra lección de matemáticas de subred.\n\nTambién cuando hablamos de nuestra subred, comúnmente la denotamos por el prefijo de red seguido de la máscara de subred:\n\n<pre>123.234.0.0/255.255.0.0</pre>\n\n<b>¿Por qué?</b>\n\n¿Por qué diablos creamos subredes? La segmentación de redes se utiliza para segmentar redes y controlar el flujo de tráfico dentro de esa red. Por lo tanto, un host en una subred no puede interactuar con otro host en una subred diferente. \n\nPero espera un minuto, ¿qué pasa si quiero conectarme con otros hosts como yahoo.com? Entonces necesitas conectar subredes juntas. Para conectar subredes solo necesitas encontrar los hosts que están conectados a más de una subred. Por ejemplo, si mi host en 192.168.1.129 está conectado a una red local de 192.168.1.129/24 puede alcanzar cualquier host en esa red. Para alcanzar hosts en el resto de Internet, necesita comunicarse a través del enrutador. Tradicionalmente, en la mayoría de las redes con una máscara de subred de 255.255.255.0, el enrutador suele estar en la dirección 1 de la subred, por lo tanto 192.168.1.1. Ahora ese enrutador tendrá un puerto que lo conecta a otra subred (más en el curso de enrutamiento). Ciertas direcciones IP (redes privadas) no son visibles para Internet, y tenemos cosas como NAT en su lugar (más sobre esto más adelante).",
  "exercise": "Utiliza ifconfig para ver tu máscara de subred.",
  "quizQuestion": "Verdadero o falso, una subred consiste en una máscara de subred y un prefijo de red.",
  "quizAnswer": "Verdadero",
  "slug": "subredes"
}