{
  "id": 5,
  "title": "Setuid",
  "lessonContent": "Существует много случаев, когда обычным пользователям требуется повышенный доступ для выполнения определенных действий. Администратор системы не всегда может быть рядом, чтобы вводить пароль суперпользователя каждый раз, когда пользователю требуется доступ к защищенному файлу, поэтому существуют специальные биты разрешений файлов, позволяющие такое поведение. Установка идентификатора пользователя (SUID) позволяет пользователю запускать программу от имени владельца файла программы, а не от себя.\n\nДавайте рассмотрим пример: \n\nПредположим, я хочу изменить свой пароль, просто, верно? Я просто использую команду passwd:\n\n<pre>$ passwd</pre>\n\nЧто делает команда passwd? Она изменяет несколько файлов, но, что самое важное, она изменяет файл /etc/shadow. Давайте посмотрим на этот файл на секунду: \n\n<pre>$ ls -l /etc/shadow\n\n-rw-r----- 1 root shadow 1134 Dec 1 11:45 /etc/shadow\n</pre>\n\nОй, подождите минутку, этот файл принадлежит root? Как мы можем изменять файл, принадлежащий root? \n\nДавайте посмотрим на другой набор разрешений, на этот раз команды, которую мы выполнили: \n\n<pre>$ ls -l /usr/bin/passwd\n\n-rwsr-xr-x 1 root root 47032 Dec 1 11:45 /usr/bin/passwd\n</pre>\n\nВы заметите новый бит разрешений здесь <b>s</b>. Этот бит разрешений - SUID, когда у файла установлено это разрешение, пользователи, запустившие программу, получают разрешение владельца файла, а также разрешение на выполнение, в данном случае root. По сути, когда пользователь запускает команду passwd, он работает от имени root.\n\nВот почему мы можем получить доступ к защищенному файлу, такому как /etc/shadow, когда мы запускаем команду passwd. Теперь, если бы вы удалили этот бит, вы бы увидели, что не сможете изменить /etc/shadow и, следовательно, изменить свой пароль. \n\n<b>Изменение SUID</b>\n\nКак и обычные разрешения, существуют два способа изменения разрешений SUID. \n\n<i>Символьный способ:</i>\n<pre>$ sudo chmod u+s myfile</pre>\n\n<i>Числовой способ:</i>\n<pre> sudo chmod 4755 myfile</pre>\n\nКак видите, SUID обозначается цифрой 4 и добавляется к набору разрешений. Вы можете видеть, что SUID обозначается как заглавная <b>S</b>, это означает, что оно по-прежнему делает то же самое, но не имеет разрешений на выполнение.",
  "exercise": "Внимательно изучите разрешения для /etc/passwd, замечаете что-то еще? Файлы с включенным SUID также легко отличимы.",
  "quizQuestion": "Какое число представляет собой SUID?",
  "quizAnswer": "4",
  "slug": "setuidsetuserid"
}