{
  "id": 6,
  "title": "Systemd Ziele",
  "lessonContent": "Wir werden nicht auf die Details des Schreibens von systemd-Unit-Dateien eingehen. Wir werden jedoch eine kurze Übersicht über eine Unit-Datei geben und wie man Units manuell steuert. \n\nHier ist eine einfache Service-Unit-Datei: foobar.service\n\n<pre>\n[Unit]\nDescription=Mein Foobar\nBefore=bar.target\n\n[Service]\nExecStart=/usr/bin/foobar\n\n[Install]\nWantedBy=multi-user.target\n</pre>\n\nDies ist ein einfaches Service-Ziel. Am Anfang der Datei sehen wir einen Abschnitt für [Unit], der es uns ermöglicht, unserer Unit-Datei eine Beschreibung zu geben und die Reihenfolge der Aktivierung der Unit zu steuern. Der nächste Teil ist der Abschnitt [Service], hier können wir einen Service starten, stoppen oder neu laden. Und der Abschnitt [Install] wird für Abhängigkeiten verwendet. Dies ist nur die Spitze des Eisbergs beim Schreiben von systemd-Dateien, also empfehle ich Ihnen, sich mit dem Thema zu beschäftigen, wenn Sie mehr wissen möchten. \n\nNun, lassen Sie uns einige Befehle betrachten, die Sie mit systemd-Units verwenden können: \n\n<b>Units auflisten</b>\n\n<pre>$ systemctl list-units</pre>\n\n<b>Status einer Unit anzeigen</b>\n\n<pre>$ systemctl status networking.service</pre>\n\n<b>Einen Service starten</b>\n\n<pre>$ sudo systemctl start networking.service</pre>\n\n<b>Einen Service stoppen</b>\n\n<pre>$ sudo systemctl stop networking.service</pre>\n\n<b>Einen Service neu starten</b>\n\n<pre>$ sudo systemctl restart networking.service</pre>\n\n<b>Eine Unit aktivieren</b>\n\n<pre>$ sudo systemctl enable networking.service</pre>\n\n<b>Eine Unit deaktivieren</b>\n\n<pre>$ sudo systemctl disable networking.service</pre>\n\nSie haben noch nicht gesehen, wie tief systemd geht, also lesen Sie mehr darüber, wenn Sie mehr erfahren möchten.",
  "exercise": "Überprüfen Sie die Status der Units und starten und stoppen Sie einige Services. Was beobachten Sie?",
  "quizQuestion": "Was ist der Befehl, um einen Service mit dem Namen peanut.service zu starten?",
  "quizAnswer": "sudo systemctl start peanut.service",
  "slug": "systemdgoals"
}