{
  "id": 5,
  "title": "Systemd-Übersicht",
  "lessonContent": "Systemd wird langsam zum aufstrebenden Standard für Init. Wenn Sie ein /usr/lib/systemd-Verzeichnis haben, verwenden Sie höchstwahrscheinlich systemd.\n\nSystemd verwendet Ziele, um Ihr System hochzufahren. Grundsätzlich haben Sie ein Ziel, das Sie erreichen möchten, und dieses Ziel hat auch Abhängigkeiten, die wir erreichen müssen. Systemd ist äußerst flexibel und robust, es folgt keiner strengen Sequenz, um Prozesse zu starten. Hier ist, was während des typischen systemd-Startvorgangs passiert:\n\n<ol>\n<li>Zunächst lädt systemd seine Konfigurationsdateien, die sich normalerweise in /etc/systemd/system oder /usr/lib/systemd/system befinden</li>\n<li>Dann bestimmt es sein Startziel, das normalerweise default.target ist</li>\n<li>Systemd ermittelt die Abhängigkeiten des Startziels und aktiviert sie</l>\n</ol>\n\nÄhnlich wie bei den Sys V-Runleveln startet systemd in verschiedene Ziele:\n\n<ul>\n<li>poweroff.target - System herunterfahren</li>\n<li>rescue.target - Einzelbenutzermodus</li>\n<li>multi-user.target - Mehrbenutzermodus mit Netzwerk</li>\n<li>graphical.target - Mehrbenutzermodus mit Netzwerk und GUI</li>\n<li>reboot.target - Neustart</li>\n</ul>\n\nDas Standardstartziel default.target zeigt normalerweise auf graphical.target. \n\nDas Hauptobjekt, mit dem systemd arbeitet, sind sogenannte Units. Systemd startet und stoppt nicht nur Dienste, es kann Dateisysteme einhängen, Ihre Netzwerk-Sockets überwachen usw. und aufgrund dieser Robustheit arbeitet es mit verschiedenen Arten von Units. Die häufigsten Units sind:\n\n<ul>\n<li>Service-Units - dies sind die Dienste, die wir starten und stoppen, diese Unit-Dateien enden auf .service</li>\n<li>Mount-Units - Diese hängen Dateisysteme ein, diese Unit-Dateien enden auf .mount</li>\n<li>Target-Units - Diese gruppieren andere Units, die Dateien enden auf .target</li>\n</ul>\n\nAngenommen, wir starten in unser default.target, nun gruppiert dieses Ziel die networking.service-Unit, crond.service-Unit usw., sodass, sobald wir eine einzelne Unit aktivieren, alles unterhalb dieser Unit ebenfalls aktiviert wird.",
  "exercise": "Für diese Lektion sind keine Übungen verfügbar.",
  "quizQuestion": "Welche Unit wird verwendet, um andere Units zu gruppieren?",
  "quizAnswer": "target",
  "slug": "systemdoverview"
}