{
  "id": 1,
  "title": "System V Übersicht",
  "lessonContent": "Der Hauptzweck von init besteht darin, wichtige Prozesse auf dem System zu starten und zu stoppen. Es gibt drei Hauptimplementierungen von init in Linux: System V, Upstart und systemd. In dieser Lektion werden wir die traditionellste Version von init durchgehen, System V init oder Sys V (ausgesprochen als 'System Five'). \n\nUm herauszufinden, ob Sie die Sys V init-Implementierung verwenden, prüfen Sie, ob Sie eine /etc/inittab-Datei haben. Dann verwenden Sie höchstwahrscheinlich Sys V. \n\nSys V startet und stoppt Prozesse sequenziell. Wenn Sie beispielsweise einen Dienst namens foo-a starten möchten, muss foo-a bereits ausgeführt werden, bevor foo-b funktionieren kann. Sys V verwendet Skripte, um dies zu erreichen. Diese Skripte starten und stoppen Dienste für uns. Wir können eigene Skripte schreiben oder meistens die bereits im Betriebssystem integrierten Skripte verwenden, die zum Laden wichtiger Dienste verwendet werden. \n\nDie Vorteile der Verwendung dieser Implementierung von init liegen darin, dass Abhängigkeiten relativ einfach gelöst werden können, da Sie wissen, dass foo-a vor foo-b ausgeführt wird. Die Leistung ist jedoch nicht optimal, da normalerweise jeweils eine Sache gestartet oder gestoppt wird. \n\nWenn Sie Sys V verwenden, wird der Zustand der Maschine durch Runlevel definiert, die von 0 bis 6 festgelegt sind. Diese verschiedenen Modi variieren je nach Distribution, sehen aber meistens wie folgt aus: \n\n<ul>\n<li>0: Herunterfahren</li>\n<li>1: Einzelbenutzermodus</li>\n<li>2: Mehrbenutzermodus ohne Netzwerk</li>\n<li>3: Mehrbenutzermodus mit Netzwerk</li>\n<li>4: Nicht verwendet</li>\n<li>5: Mehrbenutzermodus mit Netzwerk und GUI</li>\n<li>6: Neustart</li>\n</ul>\n\nBeim Start des Systems wird überprüft, in welchem Runlevel Sie sich befinden, und Skripte innerhalb dieser Runlevel-Konfiguration werden ausgeführt. Die Skripte befinden sich in <b>/etc/rc.d/rc[Runlevel-Nummer].d/</b> oder <b>/etc/init.d</b>. Skripte, die mit S (Start) oder K (Beenden) beginnen, werden beim Start und beim Herunterfahren ausgeführt. Die Zahlen neben diesen Zeichen geben die Reihenfolge an, in der sie ausgeführt werden. \n\nZum Beispiel:\n\n<pre>\npete@icebox:/etc/rc.d/rc0.d$ ls\nK10updates  K80openvpn        \n</pre>\n\nWir sehen, dass beim Wechsel in den Runlevel 0 oder den Herunterfahren-Modus unser System versucht, ein Skript auszuführen, um die Update-Dienste zu beenden und dann openvpn zu starten. Um herauszufinden, in welchen Runlevel Ihr System bootet, können Sie den Standard-Runlevel in der Datei /etc/inittab sehen. Sie können auch Ihren Standard-Runlevel in dieser Datei ändern. \n\nEine Sache ist zu beachten: System V wird langsam ersetzt, vielleicht nicht heute oder auch in Jahren. Möglicherweise sehen Sie jedoch Runlevel in anderen Init-Implementierungen auftauchen, dies dient hauptsächlich zur Unterstützung von Diensten, die nur mit System V init-Skripten gestartet oder gestoppt werden.",
  "exercise": "Wenn Sie System V ausführen, ändern Sie den Standard-Runlevel Ihrer Maschine auf etwas anderes und sehen Sie, was passiert.",
  "quizQuestion": "Welcher Runlevel wird normalerweise für das Herunterfahren verwendet?",
  "quizAnswer": "0",
  "slug": "sysvoverview"
}