{
  "id": 4,
  "title": "Upstart-Jobs",
  "lessonContent": "Upstart kann viele Ereignisse und Jobs auslösen, leider gibt es keinen einfachen Weg zu sehen, wo ein Ereignis oder Job seinen Ursprung hat, also müssen Sie sich in den Jobkonfigurationen in /etc/init umsehen. Die meiste Zeit werden Sie nie die Upstart-Jobkonfigurationsdateien ansehen müssen, aber Sie möchten einige bestimmte Jobs leichter steuern. Es gibt viele nützliche Befehle, die Sie in einem Upstart-System verwenden können. \n\n<b>Jobs anzeigen</b>\n\n<pre>initctl list\n\nshutdown stop/waiting\nconsole stop/waiting\n...\n</pre>\n\nSie sehen eine Liste von Upstart-Jobs mit verschiedenen Statuswerten. In jeder Zeile ist der Jobname der erste Wert und das zweite Feld (vor dem /) ist tatsächlich das Ziel des Jobs, der dritte Wert (nach dem /) ist der aktuelle Status. Wir sehen also, dass unser Shutdown-Job letztendlich gestoppt werden soll, aber er befindet sich derzeit im Zustand des Wartens. Der Jobstatus und die Ziele ändern sich, wenn Sie Jobs starten oder stoppen. \n\n<b>Bestimmten Job anzeigen</b>\n\n<pre>initctl status networking\nnetworking start/running\n</pre>\n\nWir werden nicht auf die Details eingehen, wie man eine Upstart-Jobkonfiguration schreibt, aber wir wissen bereits, dass Jobs in diesen Konfigurationen gestoppt, gestartet und neu gestartet werden. Diese Jobs senden auch Ereignisse aus, um andere Jobs zu starten. Wir werden die manuellen Befehle des Upstart-Betriebs durchgehen, aber wenn Sie neugierig sind, sollten Sie sich tiefer in die .conf-Dateien eingraben.\n\n<b>Manuell einen Job starten</b>\n\n<pre>$ sudo initctl start networking</pre>\n\n<b>Manuell einen Job stoppen</b>\n\n<pre>$ sudo initctl stop networking</pre>\n\n<b>Manuell einen Job neu starten</b>\n\n<pre>$ sudo initctl restart networking</pre>\n\n<b>Manuell ein Ereignis auslösen</b>\n\n<pre>$ sudo initctl emit some_event</pre>",
  "exercise": "Beobachten Sie Ihre Liste der Upstart-Jobs, ändern Sie jetzt den Jobzustand mit einem der heute gelernten Befehle. Was fällt Ihnen danach auf?",
  "quizQuestion": "Wie würde ich manuell einen Upstart-Job namens peanuts neu starten?",
  "quizAnswer": "sudo initctl restart peanuts",
  "slug": "upstartjobs"
}