{
  "id": 3,
  "title": "Upstart-Übersicht",
  "lessonContent": "Upstart wurde von Canonical entwickelt, daher war es eine Zeit lang die Init-Implementierung auf Ubuntu, jedoch wird auf modernen Ubuntu-Installationen jetzt systemd verwendet. Upstart wurde erstellt, um die Probleme mit Sys V zu verbessern, wie z. B. die strengen Startvorgänge, Blockieren von Aufgaben usw. Das ereignis- und aufgabenorientierte Modell von Upstart ermöglicht es ihm, auf Ereignisse zu reagieren, wenn sie auftreten. \n\nUm herauszufinden, ob Sie Upstart verwenden, ist ein /usr/share/upstart-Verzeichnis ein ziemlich guter Indikator. \n\nAufgaben sind die Aktionen, die Upstart ausführt, und Ereignisse sind Nachrichten, die von anderen Prozessen empfangen werden, um Aufgaben auszulösen. Um eine Liste von Aufgaben und ihrer Konfiguration zu sehen:\n\n<pre>\npete@icebox:~$ ls /etc/init\nacpid.conf                   mountnfs.sh.conf\nalsa-restore.conf            mtab.sh.conf\nalsa-state.conf              networking.conf\nalsa-store.conf              network-interface.conf\nanacron.conf                 network-interface-container.conf\n</pre>\n\nIn diesen Aufgabenkonfigurationen finden Sie Informationen dazu, wie Aufgaben gestartet werden und wann sie gestartet werden sollen.\n\nZum Beispiel könnte in der networking.conf-Datei etwas so Einfaches stehen wie:\n<pre>\nstart on runlevel [235]\nstop on runlevel [0]\n</pre>\n\nDas bedeutet, dass das Einrichten des Netzwerks auf Runlevel 2, 3 oder 5 gestartet wird und das Netzwerk auf Runlevel 0 gestoppt wird. Es gibt viele Möglichkeiten, die Konfigurationsdatei zu schreiben, und Sie werden feststellen, dass, wenn Sie sich die verschiedenen verfügbaren Aufgabenkonfigurationen ansehen. \n\nDie Art und Weise, wie Upstart funktioniert, ist folgende: \n\n<ol>\n<li>Zuerst lädt es die Aufgabenkonfigurationen von /etc/init</li>\n<li>Sobald ein Startereignis eintritt, werden Aufgaben ausgeführt, die durch dieses Ereignis ausgelöst wurden.</li>\n<li>Diese Aufgaben erzeugen neue Ereignisse, und diese Ereignisse lösen weitere Aufgaben aus</li>\n<li>Upstart macht so weiter, bis alle notwendigen Aufgaben abgeschlossen sind</li>\n</ol>",
  "exercise": "Wenn Sie Upstart verwenden, versuchen Sie, die Aufgabenkonfigurationen in /etc/init zu verstehen.",
  "quizQuestion": "Welche Init-Implementierung wird von Ubuntu verwendet?",
  "quizAnswer": "upstart",
  "slug": "upstartoverview"
}