{
  "id": 2,
  "title": "Sub-redes",
  "lessonContent": "Como posso saber se estou na mesma rede que a Patty? Bem, podemos simplesmente olhar para a sub-rede, abreviação de sub-rede. Uma sub-rede é um grupo de hosts com endereços IP que são semelhantes de certa forma. Esses hosts geralmente estão em uma localização próxima uns dos outros e você pode facilmente enviar dados de e para hosts na mesma sub-rede. Pense nisso como enviar correio no mesmo código postal, é muito mais fácil do que enviar correio para um estado diferente. \n\nPor exemplo, todos os hosts com um endereço IP que começa com 123.45.67 estariam na mesma sub-rede. Meu host tem um IP de 123.45.67.8 e o da Patty tem um IP de 123.45.67.9. Os números comuns são meu prefixo de rede e o 8 e 9 são nossos hosts, portanto minha rede é a mesma que a da Patty. Uma sub-rede é dividida em um prefixo de rede, como 123.45.67.0 e uma máscara de sub-rede.\n\n<b>Máscaras de Sub-rede</b>\n\nAs máscaras de sub-rede determinam qual parte do seu endereço IP é a parte de rede e qual parte é a parte do host. \n\nUma máscara de sub-rede típica pode se parecer com isso:\n\n<pre>255.255.255.0</pre>\n\nA parte 255 é na verdade nossa máscara. Para facilitar um pouco o entendimento, lembre-se de como nos referimos a cada octeto como 8 bits? Em ciência da computação, um bit é representado por um 0 ou um 1 na forma binária. Quando números binários são usados, 1 significa ligado e 0 significa desligado. Então o que 8 0's ou 1's equivalem?\n\nDigite no Google \"calculadora de binário para decimal\" e converta 11111111 em forma decimal. O que você obtém? 255! Então um octeto varia de 0 a 255. Então se tivéssemos uma máscara de sub-rede de 255.255.255.0 e um endereço IP de 192.168.1.0, quantos hosts estão nessa sub-rede? Descobriremos a resposta para isso em nossa lição de matemática de sub-rede.\n\nAlém disso, quando falamos sobre nossa sub-rede, comumente a denotamos pelo prefixo de rede seguido pela máscara de sub-rede:\n\n<pre>123.234.0.0/255.255.0.0</pre>\n\n<b>Por quê?</b>\n\nPor que diabos fazemos sub-redes? O particionamento de sub-redes é usado para segmentar redes e controlar o fluxo de tráfego dentro dessa rede. Portanto, um host em uma sub-rede não pode interagir com outro host em uma sub-rede diferente. \n\nMas espere um minuto, e se eu quiser me conectar a outros hosts como yahoo.com? Então você precisa conectar sub-redes juntas. Para conectar sub-redes, você só precisa encontrar os hosts que estão conectados a mais de uma sub-rede. Por exemplo, se meu host em 192.168.1.129 está conectado a uma rede local de 192.168.1.129/24, ele pode alcançar qualquer host nessa rede. Para alcançar hosts no restante da Internet, ele precisa se comunicar através do roteador. Tradicionalmente, na maioria das redes com uma máscara de sub-rede de 255.255.255.0, o roteador geralmente está no endereço 1 da sub-rede, então 192.168.1.1. Agora, esse roteador terá uma porta que o conecta a outra sub-rede (mais no curso de Roteamento). Certos endereços IP (redes privadas) não são visíveis para a internet, e temos coisas como NAT em vigor (mais sobre isso depois).",
  "exercise": "Use ifconfig para visualizar sua máscara de sub-rede.",
  "quizQuestion": "Verdadeiro ou falso, uma sub-rede consiste em uma máscara de sub-rede e prefixo de rede.",
  "quizAnswer": "Verdadeiro",
  "slug": "sub-redes"
}