{
  "id": 3,
  "title": "Путь пакета",
  "lessonContent": "<b>Давайте посмотрим, как пакет передвигается в пределах своей локальной сети</b>\n\n<ol>\n<li>Сначала локальная машина сравнивает IP-адрес назначения, чтобы узнать, находится ли он в той же подсети, посмотрев на маску подсети.</li>\n<li>Когда пакеты отправляются, они должны иметь исходный MAC-адрес, MAC-адрес назначения, исходный IP-адрес и IP-адрес назначения, на данном этапе мы не знаем MAC-адрес назначения.</li>\n<li>Чтобы достичь целевого хоста, мы используем ARP для широковещательного запроса в локальной сети для поиска MAC-адреса целевого хоста.</li>\n<li>Теперь пакет может быть успешно отправлен!</li>\n</ol>\n\n<b>Давайте посмотрим, как пакет передвигается за пределы своей сети</b>\n\n<ol>\n<li>Сначала локальная машина сравнивает IP-адрес назначения, поскольку он находится за пределами нашей сети, она не видит MAC-адрес целевого хоста. И мы не можем использовать ARP, потому что запрос ARP является широковещательным для локально подключенных хостов.</li>\n<li>Таким образом, наш пакет теперь обращается к таблице маршрутизации, он не знает адреса IP назначения, поэтому отправляет его на шлюз по умолчанию (другой маршрутизатор). Теперь наш пакет содержит наш исходный IP, IP назначения и исходный MAC, однако у нас нет MAC-адреса назначения. Помните, что MAC-адреса доступны только в пределах одной сети. Что же делает пакет? Он отправляет запрос ARP, чтобы получить MAC-адрес шлюза по умолчанию.</li>\n<li>Маршрутизатор смотрит на пакет и подтверждает MAC-адрес назначения, но это не конечный IP-адрес назначения, поэтому он продолжает просматривать таблицу маршрутизации, чтобы переслать пакет на другой IP-адрес, который может помочь пакету продвинуться к своему назначению. Каждый раз, когда пакет перемещается, он удаляет старые исходный и целевой MAC-адреса и обновляет пакет новыми исходными и целевыми MAC-адресами.</li>\n<li>Как только пакет пересылается в ту же сеть, мы используем ARP, чтобы найти конечный MAC-адрес назначения</li>\n<li>Во время этого процесса наш пакет не меняет исходный или целевой IP-адрес.</li>\n</ol>",
  "exercise": "Нет упражнений для этого урока.",
  "quizQuestion": "Как мы находим MAC-адрес IP-адреса?",
  "quizAnswer": "ARP",
  "slug": "pathofapacket"
}