{
  "id": 1,
  "title": "Что такое маршрутизатор?",
  "lessonContent": "Мы уже использовали термин 'маршрутизатор' ранее, надеюсь, вы знаете, что это такое, так как, вероятно, у вас есть один дома. Маршрутизатор позволяет машинам в сети обмениваться данными между собой, а также с другими сетями. На типичном маршрутизаторе есть порты LAN, которые позволяют вашим машинам подключаться к одной локальной сети, а также порт для подключения к Интернету, иногда этот порт могут обозначать как WAN, потому что он фактически соединяет вас с более широкой сетью. Когда мы выполняем какие-либо сетевые действия, они проходят через маршрутизатор. Маршрутизатор определяет, куда направлять наши сетевые пакеты и какие принимать. Он маршрутизирует наши пакеты между несколькими сетями, чтобы они достигли своего исходного и конечного хоста. \n\n<b>Как работает маршрутизатор?</b>\n\nПредставьте себе маршрутизацию так же, как доставку почты: у нас есть адрес, на который мы хотим отправить письмо. Когда мы отправляем его в почтовое отделение, они видят, что это идет в Калифорнию, и отправляют его на грузовик, идущий в Калифорнию (я действительно не знаю, как работает почтовая система). Письмо затем попадает в Сан-Франциско, внутри которого есть разные почтовые индексы, и в этих индексах есть более мелкие адреса, пока, наконец, кто-то не доставит ваше письмо по нужному адресу. С другой стороны, если вы уже живете в Сан-Франциско и в том же почтовом индексе, почтальон, скорее всего, знает, куда точно должно попасть письмо, не передавая его кому-либо еще. \n\nПри маршрутизации пакеты используют аналогичные адресные 'маршруты', например, чтобы попасть в сеть A, отправьте эти пакеты в сеть B. Когда у нас нет установленного маршрута, наши пакеты используют 'маршрут по умолчанию'. Эти маршруты устанавливаются в таблице маршрутизации, которую наша система использует для перемещения по сетям.\n\n<b>Хопы</b>\n\nПо мере передвижения пакетов по сетям они проходят через хопы, хоп - это примерное измерение расстояния, которое должен пройти пакет от источника к месту назначения. Допустим, у меня два маршрутизатора, соединяющих хост A с хостом B, следовательно, мы говорим, что между хостом A и хостом B два хопа. Каждый хоп - это промежуточное устройство, такое как маршрутизаторы, через которые мы должны пройти.\n\n<b>Основные различия между коммутацией, маршрутизацией и затоплением</b>\nКоммутация пакетов - это в основном получение, обработка и пересылка данных на устройство назначения.\nМаршрутизация - это процесс создания таблицы маршрутизации, чтобы мы могли выполнять коммутацию лучше.\nДо внедрения маршрутизации использовалось затопление. Если маршрутизатор не знает, куда отправить пакет, то каждый входящий пакет отправляется через все исходящие соединения, за исключением того, через которое он пришел.",
  "exercise": "Урок не содержит упражнений.",
  "quizQuestion": "Как измеряют расстояние пакеты?",
  "quizAnswer": "хопы",
  "slug": "chto-takoe-marshrutizator"
}