{
  "id": 8,
  "title": "लिंक परत",
  "lessonContent": "TCP/IP मॉडल के नीचे लिंक परत होती है। यह परत हार्डवेयर विशिष्ट परत है।\n\nलिंक परत में, हमारे पैकेट को एक बार और कुछ नामक फ्रेम में बंधा जाता है। फ्रेम हेडर हमारे होस्टों के स्रोत और गंतव्य MAC पते, चेकसम और पैकेट विभाजक जोड़ता है ताकि प्राप्तकर्ता जान सके कि पैकेट कब समाप्त होता है।\n\nभाग्यवश हम एक ही नेटवर्क पर हैं, इसलिए हमारे पैकेट को बहुत दूर जाने की आवश्यकता नहीं है। पहले, लिंक परत मेरा स्रोत MAC पता फ्रेम हेडर में जोड़ती है, लेकिन यह जानने की जरूरत है कि पैटी का MAC पता कैसे पता चलेगा और मैं उसे कैसे खोजूं क्योंकि यह इंटरनेट पर नहीं है? हम ARP का उपयोग करते हैं!\n\n<b>ARP (पता संक्षेपण प्रोटोकॉल)</b>\n\nARP एक IP पते से संबंधित MAC पता खोजता है। ARP एक ही नेटवर्क के भीतर प्रयोग किया जाता है। अगर पैटी एक ही नेटवर्क पर नहीं थी, तो हम एक रूटिंग सिस्टम का उपयोग करेंगे जिससे पैकेट को प्राप्त करने वाला अगला राउटर निर्धारित होगा और एक बार हम एक ही नेटवर्क पर होंगे, हम ARP का उपयोग कर सकेंगे।\n\nजब हम एक ही नेटवर्क पर होते हैं, सिस्टम पहले ARP लुकअप तालिका का उपयोग करता है जो जानकारी संग्रहित करता है कि कौन से IP पते से कौन सा MAC पता संबंधित है। यदि मान्यता वहाँ नहीं है, तो ARP का उपयोग किया जाता है। फिर सिस्टम नेटवर्क पर ARP प्रोटोकॉल का उपयोग करते हुए नेटवर्क को एक ब्रॉडकास्ट संदेश भेजेगा ताकि पता चले कि कौन सा होस्ट IP 10.10.1.4 रखता है। एक ब्रॉडकास्ट संदेश एक विशेष संदेश है जो नेटवर्क पर सभी होस्टों को भेजा जाता है (जिसे ब्रॉडकास्ट भेजने के लिए उपयुक्त नाम दिया गया है)। अनुरोधित IP पते वाली किसी भी मशीन द्वारा एक ARP पैकेट के साथ जवाब दिया जाएगा जिसमें IP पता और MAC पता होता है।\n\nअब हमारे पास सभी आवश्यक डेटा है, हमें आवश्यक डेटा चाहिए, IP पता और MAC पते, हमारी लिंक परत इस फ्रेम को हमारे नेटवर्क इंटरफेस कार्ड के माध्यम से आगे भेजती है, अगली उपकरण तक और पैटी के नेटवर्क तक पहुंचती है। यह कदम मैंने जितना अभी व्याख्या किया है, उससे थोड़ा अधिक जटिल है, लेकिन हम रूटिंग पाठ्यक्रम में अधिक विवरण पर चर्चा करेंगे।\n\nऔर यह एक सरल (या इतना सरल नहीं) पैकेट ट्रावर्सल नीचे TCP/IP परत में। ध्यान रखें कि पैकेट इस प्रकार के एकमार्गी रूप से नहीं चलते हैं। हमने अभी तक पैटी के नेटवर्क तक पहुंचने का भी उल्लेख नहीं किया है! नेटवर्कों के माध्यम से यात्रा करते समय, किसी भी डेटा को भेजने या प्राप्त करने से पहले कम से कम दो बार TCP/IP मॉडल के माध्यम से जाना जरूरी है। वास्तव में, इस पैकेट की दिखने की तरह कुछ ऐसा होगा:\n\n<b>पैकेट ट्रावर्सल</b>\n\n<ol>\n<li>पीट पैटी को एक ईमेल भेजता है: यह डेटा परिवहन परत में भेजा जाता है।</li>\n<li>परिवहन परत डेटा को एक TCP या UDP हेडर में बंधने के लिए एक सेगमेंट में बंधती है, सेगमेंट गंतव्य और स्रोत TCP या UDP पोर्ट जोड़ता है, फिर सेगमेंट को नेटवर्क परत में भेज दिया जाता है।</li>\n<li>नेटवर्क परत एक आईपी पैकेट के भीतर TCP सेगमेंट को बंधती है, यह स्रोत और गंतव्य आईपी पता जोड़ती है। फिर पैकेट को लिंक परत में भेज दिया जाता है।</li>\n<li>पैकेट फिर पीट के भौतिक हार्डवेयर तक पहुंचता है और एक फ्रेम में बंध जाता है। स्रोत और गंतव्य MAC पता फ्रेम में जोड़ दिया जाता है।</li>\n<li>पैटी के भौतिक परत द्वारा यह डेटा फ्रेम को प्राप्त करती है और प्रत्येक फ्रेम की डेटा सत्यापन के लिए जांच करती है, फिर फ्रेम की सामग्री को अनबंधित करती है और आईपी पैकेट को नेटवर्क परत में भेजती है।</li>\n<li>नेटवर्क परत पैकेट को पढ़ती है ताकि पहले जोड़ा गया स्रोत और गंतव्य आईपी पता पाए जा सके। यह जांचती है कि उसका आईपी पता गंतव्य आईपी पते के समान है या नहीं, जो है! यह पैकेट को अनबंधित करती है और सेगमेंट को परिवहन परत में भेजती है।</li>\n<li>परिवहन परत सेगमेंट को अनबंधित करती है, TCP या UDP पोर्ट नंबर की जांच करती है और उन पोर्ट नंबरों के आधार पर एप्लिकेशन परत में एक कनेक्शन बनाती है।</li>\n<li>एप्लिकेशन परत परिवहन परत से डेटा प्राप्त करती है जो निर्धारित किए गए पोर्ट पर और इसे पैटी को अंतिम ईमेल संदेश के रूप में प्रस्तुत करती है।</li>\n</ol>",
  "exercise": "इस सबक के लिए कोई व्यायाम नहीं।",
  "quizQuestion": "एक ही नेटवर्क पर MAC पता खोजने के लिए क्या उपयोग किया जाता है?",
  "quizAnswer": "ARP",
  "slug": "linklayer"
}