{
  "id": 3,
  "title": "TCP/IP मॉडल",
  "lessonContent": "OSI मॉडल ने उसे जन्म दिया जिससे आखिरकार TCP/IP मॉडल बना और यह मॉडल वास्तव में इंटरनेट पर आधारित है। यह नेटवर्किंग का वास्तविक कार्यान्वयन है। TCP/IP मॉडल TCP/IP प्रोटोकॉल सुइट का उपयोग करता है, जिसे हम सामान्य रूप से TCP/IP के रूप में संदर्भित करते हैं। ये प्रोटोकॉल एक साथ काम करके निर्दिष्ट करते हैं कि डेटा को कैसे इकट्ठा किया जाना चाहिए, पता लगाया जाना चाहिए, प्रेषित किया जाना चाहिए और नेटवर्क के माध्यम से कैसे मार्गित किया जाना चाहिए। TCP/IP मॉडल का उपयोग करके, हम देख सकते हैं कि ये प्रोटोकॉल कैसे उपयोग किए जाते हैं ताकि नेटवर्क के माध्यम से एक पैकेट का सफर दिखाया जा सके।\n\n<b>एप्लिकेशन परत</b>\n\nTCP/IP मॉडल की ऊपरी परत। यह निर्धारित करती है कि आपके कंप्यूटर के कार्यक्रम (जैसे आपका वेब ब्राउज़र) कैसे परिवहन परत से डेटा देखते हैं जो भेजा जाता है या प्राप्त होता है।\n\nइस परत में उपयोग होता है:\n<ul>\n<li>HTTP (हाइपरटेक्स्ट स्थानांतरण प्रोटोकॉल) - इंटरनेट पर वेबपेज के लिए उपयोग किया जाता है।</li>\n<li>SMTP (सिम्पल मेल स्थानांतरण प्रोटोकॉल) - इलेक्ट्रॉनिक मेल (ईमेल) स्थानांतरण</li>\n</ul>\n\n<b>परिवहन परत</b>\n\nडेटा कैसे प्रेषित किया जाएगा, सही पोर्ट्स की जांच करता है, डेटा की अखंडता की जांच करता है, और मौलिक रूप से हमारे पैकेट्स को पहुंचाता है।\n\nइस परत में उपयोग होता है:\n<ul>\n<li>TCP (ट्रांसमिशन नियंत्रण प्रोटोकॉल) - विश्वसनीय डेटा प्रेषण</li>\n<li>UDP (उपयोगकर्ता डेटाग्राम प्रोटोकॉल) - अविश्वसनीय डेटा प्रेषण</li>\n</ul>\n\n<b>नेटवर्क परत</b>\n\nयह परत यह निर्धारित करती है कि होस्ट्स और नेटवर्क के बीच पैकेट कैसे ले जाएं।\n\nइस परत में उपयोग होता है:\n<ul>\n<li>IP (इंटरनेट प्रोटोकॉल) - एक मशीन से दूसरे मशीन तक पैकेट का मार्ग निर्धारित करने में मदद करता है।</li>\n<li>ICMP (इंटरनेट नियंत्रण संदेश प्रोटोकॉल) - हमें बताने में मदद करता है कि क्या हो रहा है, जैसे त्रुटि संदेश और डीबगिंग सूचना।</li>\n</ul>\n\n<b>लिंक परत</b>\n\nयह परत निर्धारित करती है कि डेटा को एक भौतिक हार्डवेयर टुकड़े के माध्यम से कैसे भेजा जाए। जैसे डेटा ईथरनेट, फाइबर, आदि के माध्यम से यात्रा करता है।\n\nऊपर दिए गए प्रोटोकॉलों की सूचियाँ हर परत का उपयोग करती है, यह सूची सम्पूर्ण नहीं है और आपको बहुत सारे अन्य प्रोटोकॉलों का सामना करना पड़ेगा।\n\nआगामी पाठों में, हम हर परत के माध्यम से इस पैकेट का नेटवर्क में सफर कैसे करता है उस पर विचार करेंगे और चर्चा करेंगे TCP/IP मॉडल की दृष्टि से (नेटवर्क के माध्यम से पैकेट कैसे सफर करता है के कई परिप्रेक्ष्य हैं, हम उन सभी को नहीं देखेंगे, लेकिन यह जानकारी रखें कि वे मौजूद हैं)।",
  "exercise": "इस पाठ के लिए कोई अभ्यास नहीं।",
  "quizQuestion": "TCP/IP मॉडल की ऊपरी परत क्या है?",
  "quizAnswer": "एप्लिकेशन",
  "slug": "tcpipmodel"
}