{
  "id": 6,
  "title": "परिवहन परत",
  "lessonContent": "परिवहन परत हमें हमारे डेटा को एक ऐसे तरीके से स्थानांतरित करने में मदद करती है जिसे नेटवर्क पढ़ सकता है। यह हमारे डेटा को टुकड़ों में विभाजित करता है जो परिवहन किए जाएंगे और सही क्रम में पुनः एक साथ रखे जाएंगे। इन टुकड़ों को सेगमेंट के रूप में जाना जाता है। सेगमेंट नेटवर्क के ऊपर डेटा को परिवहन करने को आसान बनाते हैं।\n\n<b>पोर्ट्स</b>\n\nहालांकि हम जानते हैं कि हम अपने डेटा को किस प्रक्रिया या सेवाओं को भेज रहे हैं आईपी पतों के माध्यम से, वे इतने विशिष्ट नहीं हैं कि हमारे डेटा को किसी निश्चित प्रक्रिया या सेवाओं को भेजने के लिए। HTTP जैसी सेवाएं पोर्ट के माध्यम से संचार साधन का उपयोग करती हैं। यदि हम वेबपेज डेटा भेजना चाहते हैं, तो हमें इसे HTTP पोर्ट (पोर्ट 80) के माध्यम से भेजना होगा। सेगमेंट बनाने के अतिरिक्त, परिवहन परत सेगमेंट के साथ मूल स्रोत और गंतव्य पोर्ट को भी जोड़ देगी, ताकि जब प्राप्तकर्ता अंतिम पैकेट प्राप्त करता है, तो उसे पता चल जाए कि कौन सा पोर्ट उपयोग करना है।\n\n<b>UDP</b>\n\nUDP और TCP दो प्रसिद्ध परिवहन प्रोटोकॉल हैं। हम UDP पर संक्षेप में चर्चा करेंगे और अधिकांश समय TCP पर व्यतीत करेंगे, क्योंकि यह सबसे अधिक प्रयोग किया जाने वाला है।\n\nUDP डेटा परिवहन का एक अविश्वसनीय तरीका प्रदान करता है, वास्तव में यह इसे परिवहन करते समय वास्तव में ध्यान नहीं देता। यह भयानक सुन सकता है, लेकिन इसके उपयोग हैं, जैसे कि मीडिया स्ट्रीमिंग के लिए, अगर आप कुछ फ्रेम खो देते हैं तो यह ठीक है, वापस आप अपने डेटा को थोड़ी देर में प्राप्त करते हैं।\n\n<b>TCP</b>\n\nTCP एक विश्वसनीय कनेक्शन-अनुसारी डेटा स्ट्रीम प्रदान करता है। TCP पोर्ट का उपयोग होस्ट से डेटा भेजने और प्राप्त करने के लिए करता है। एक एप्लिकेशन अपने होस्ट पर एक पोर्ट से दूसरे होस्ट पर एक और पोर्ट के साथ एक कनेक्शन खोलता है। कनेक्शन स्थापित करने के लिए, हम TCP हैंडशेक का उपयोग करते हैं।\n\n<ul>\n<li>ग्राहक (कनेक्टिंग प्रक्रिया) सर्वर को एक कनेक्शन का अनुरोध करने के लिए एक SYN सेगमेंट भेजता है</li>\n<li>सर्वर ग्राहक को उसके कनेक्शन अनुरोध को स्वीकृति देने के लिए एक SYN-ACK सेगमेंट भेजता है</li>\n<li>ग्राहक सर्वर को सर्वर के कनेक्शन अनुरोध को स्वीकृति देने के लिए एक ACK भेजता है</li>\n</ul>\n\nएक बार जब यह कनेक्शन स्थापित हो जाता है, तो डेटा एक TCP कनेक्शन के माध्यम से आदान-प्रदान किया जा सकता है। डेटा विभिन्न सेगमेंट्स में भेजा जाता है और उन्हें TCP क्रमांकों के साथ ट्रैक किया जाता है ताकि जब वे पहुंचाए जाएं, तो उन्हें सही क्रम में व्यवस्थित किया जा सके। हमारे ईमेल उदाहरण में, परिवहन परत उत्पादन होस्ट के स्रोत पोर्ट (25) को गंतव्य पोर्ट के साथ जोड़ती है।",
  "exercise": "इस पाठ के लिए कोई अभ्यास नहीं।",
  "quizQuestion": "एक विश्वसनीय परिवहन प्रोटोकॉल क्या है?",
  "quizAnswer": "TCP",
  "slug": "परिवहनपरत"
}