{
  "id": 6,
  "title": "Objetivos do Systemd",
  "lessonContent": "Não vamos entrar em detalhes sobre a escrita de arquivos de unidade do systemd. No entanto, vamos dar uma breve visão geral de um arquivo de unidade e como controlar unidades manualmente. \n\nAqui está um arquivo de unidade de serviço básico: foobar.service\n\n<pre>\n[Unit]\nDescription=Meu Foobar\nBefore=bar.target\n\n[Service]\nExecStart=/usr/bin/foobar\n\n[Install]\nWantedBy=multi-user.target\n</pre>\n\nEste é um alvo de serviço simples, no início do arquivo vemos uma seção para [Unit], isso nos permite dar uma descrição ao nosso arquivo de unidade, bem como controlar a ordem de quando ativar a unidade. A próxima parte é a seção [Service], aqui podemos iniciar, parar ou recarregar um serviço. E a seção [Install] é usada para dependência. Isso é apenas a ponta do iceberg para escrever arquivos systemd, então eu te imploro a ler mais sobre o assunto se quiser saber mais. \n\nAgora, vamos ver alguns comandos que você pode usar com unidades systemd: \n\n<b>Listar unidades</b>\n\n<pre>$ systemctl list-units</pre>\n\n<b>Verificar status da unidade</b>\n\n<pre>$ systemctl status networking.service</pre>\n\n<b>Iniciar um serviço</b>\n\n<pre>$ sudo systemctl start networking.service</pre>\n\n<b>Parar um serviço</b>\n\n<pre>$ sudo systemctl stop networking.service</pre>\n\n<b>Reiniciar um serviço</b>\n\n<pre>$ sudo systemctl restart networking.service</pre>\n\n<b>Ativar uma unidade</b>\n\n<pre>$ sudo systemctl enable networking.service</pre>\n\n<b>Desativar uma unidade</b>\n\n<pre>$ sudo systemctl disable networking.service</pre>\n\nNovamente, você ainda não viu o quanto o systemd pode ser profundo, então leia mais sobre ele se quiser aprender mais.",
  "exercise": "Verifique os status das unidades e inicie e pare alguns serviços. O que você observa?",
  "quizQuestion": "Qual é o comando para iniciar um serviço chamado peanut.service?",
  "quizAnswer": "sudo systemctl start peanut.service",
  "slug": "systemdgoals"
}