{
  "id": 5,
  "title": "Visão Geral do Systemd",
  "lessonContent": "Systemd está lentamente se tornando o padrão emergente para init. Se você tem um diretório /usr/lib/systemd, provavelmente está usando systemd.\n\nSystemd usa metas para iniciar e executar o sistema. Basicamente, você tem um alvo que deseja alcançar e esse alvo também tem dependências que precisamos alcançar. Systemd é extremamente flexível e robusto, não segue uma sequência rígida para iniciar processos. Aqui está o que acontece durante a inicialização típica do systemd:\n\n<ol>\n<li>Primeiro, o systemd carrega seus arquivos de configuração, geralmente localizados em /etc/systemd/system ou /usr/lib/systemd/system</li>\n<li>Em seguida, determina sua meta de inicialização, que geralmente é default.target</li>\n<li>O systemd descobre as dependências da meta de inicialização e as ativa</l>\n</ol>\n\nSemelhante aos runlevels do Sys V, o systemd inicializa em diferentes alvos:\n\n<ul>\n<li>poweroff.target - desligar o sistema</li>\n<li>rescue.target - modo de usuário único</li>\n<li>multi-user.target - multiusuário com rede</li>\n<li>graphical.target - multiusuário com rede e GUI</li>\n<li>reboot.target - reiniciar</li>\n</ul>\n\nA meta de inicialização padrão default.target geralmente aponta para graphical.target. \n\nO principal objeto com o qual o systemd trabalha são conhecidos como unidades. Systemd não apenas para e inicia serviços, ele pode montar sistemas de arquivos, monitorar seus soquetes de rede, etc e devido a essa robustez, ele opera com diferentes tipos de unidades. As unidades mais comuns são:\n\n<ul>\n<li>Unidades de serviço - são os serviços que temos iniciado e parado, esses arquivos de unidade terminam em .service</li>\n<li>Unidades de montagem - montam sistemas de arquivos, esses arquivos de unidade terminam em .mount</li>\n<li>Unidades de alvo - agrupam outras unidades, os arquivos terminam em .target</li>\n</ul>\n\nPor exemplo, digamos que inicializamos em nosso default.target, bem, esse alvo agrupa a unidade networking.service, a unidade crond.service, etc, então uma vez que ativamos uma única unidade, tudo abaixo dessa unidade também é ativado.",
  "exercise": "Não há exercícios para esta lição.",
  "quizQuestion": "Que unidade é usada para agrupar outras unidades?",
  "quizAnswer": "alvo",
  "slug": "visao-geral-do-systemd"
}