{
  "id": 1,
  "title": "Visão Geral do System V",
  "lessonContent": "O principal objetivo do init é iniciar e parar processos essenciais no sistema. Existem três implementações principais do init no Linux, System V, Upstart e systemd. Nesta lição, vamos revisar a versão mais tradicional do init, System V init ou Sys V (pronunciado como 'System Five'). \n\nPara descobrir se você está usando a implementação Sys V init, se você tiver um arquivo /etc/inittab, é muito provável que esteja executando o Sys V. \n\nO Sys V inicia e para processos sequencialmente, então, digamos que você queira iniciar um serviço chamado foo-a, bem antes que foo-b possa funcionar, você precisa garantir que foo-a já esteja em execução. O Sys V faz isso com scripts, esses scripts iniciam e param serviços para nós, podemos escrever nossos próprios scripts ou na maioria das vezes usar os que já estão incorporados no sistema operacional e são usados para carregar serviços essenciais. \n\nAs vantagens de usar essa implementação do init é que é relativamente fácil resolver dependências, já que você sabe que foo-a vem antes de foo-b, no entanto, o desempenho não é ótimo porque geralmente uma coisa está iniciando ou parando de cada vez. \n\nAo usar o Sys V, o estado da máquina é definido por runlevels que são configurados de 0 a 6. Esses modos diferentes variam dependendo da distribuição, mas na maioria das vezes parecerão o seguinte: \n\n<ul>\n<li>0: Desligamento</li>\n<li>1: Modo de Usuário Único</li>\n<li>2: Modo multiusuário sem rede</li>\n<li>3: Modo multiusuário com rede</li>\n<li>4: Não utilizado</li>\n<li>5: Modo multiusuário com rede e GUI</li>\n<li>6: Reinicialização</li>\n</ul>\n\nQuando seu sistema é iniciado, ele verifica em qual runlevel você está e executa scripts localizados dentro da configuração desse runlevel. Os scripts estão localizados em <b>/etc/rc.d/rc[número do runlevel].d/</b> ou <b>/etc/init.d</b>. Scripts que começam com S (start) ou K (kill) serão executados na inicialização e no desligamento, respectivamente. Os números ao lado desses caracteres são a sequência em que são executados. \n\nPor exemplo:\n\n<pre>\npete@icebox:/etc/rc.d/rc0.d$ ls\nK10updates  K80openvpn        \n</pre>\n\nVemos que ao mudarmos para o runlevel 0 ou modo de desligamento, nossa máquina tentará executar um script para encerrar os serviços de atualização e depois openvpn. Para descobrir em qual runlevel sua máquina está inicializando, você pode ver o runlevel padrão no arquivo /etc/inittab. Você também pode alterar seu runlevel padrão neste arquivo também. \n\nUma coisa a se notar, o System V está lentamente sendo substituído, talvez não hoje, ou mesmo daqui a anos. No entanto, você pode ver runlevels surgindo em outras implementações de init, principalmente para suportar os serviços que são apenas iniciados ou interrompidos usando scripts de init do System V.",
  "exercise": "Se você estiver executando o System V, altere o runlevel padrão de sua máquina para algo diferente e veja o que acontece.",
  "quizQuestion": "Qual runlevel é geralmente usado para desligamento?",
  "quizAnswer": "0",
  "slug": "sysvoverview"
}