{
  "id": 3,
  "title": "Visão Geral do Upstart",
  "lessonContent": "O Upstart foi desenvolvido pela Canonical, então foi a implementação init no Ubuntu por um tempo, no entanto, nas instalações modernas do Ubuntu, o systemd é agora utilizado. O Upstart foi criado para melhorar os problemas com o Sys V, como os processos de inicialização rigorosos, bloqueio de tarefas, etc. O modelo orientado a eventos e tarefas do Upstart permite que ele responda aos eventos conforme eles ocorrem. \n\nPara descobrir se está a usar o Upstart, se tiver um diretório /usr/share/upstart, isso é um indicador bastante bom. \n\nAs tarefas são as ações que o Upstart executa e os eventos são mensagens recebidas de outros processos para acionar tarefas. Para ver uma lista de tarefas e suas configurações:\n\n<pre>\npete@icebox:~$ ls /etc/init\nacpid.conf                   mountnfs.sh.conf\nalsa-restore.conf            mtab.sh.conf\nalsa-state.conf              networking.conf\nalsa-store.conf              network-interface.conf\nanacron.conf                 network-interface-container.conf\n</pre>\n\nDentro destas configurações de tarefas, incluirá informações sobre como iniciar tarefas e quando iniciar tarefas.\n\nPor exemplo, no arquivo networking.conf, poderia dizer algo tão simples como:\n<pre>\nstart on runlevel [235]\nstop on runlevel [0]\n</pre>\n\nIsso significa que iniciará a configuração de rede no runlevel 2, 3 ou 5 e interromperá a rede no runlevel 0. Existem muitas maneiras de escrever o arquivo de configuração e descobrirá isso ao analisar as diferentes configurações de tarefas disponíveis. \n\nA forma como o Upstart funciona é a seguinte: \n\n<ol>\n<li>Primeiro, carrega as configurações de tarefas de /etc/init</li>\n<li>Uma vez que ocorre um evento de inicialização, executará as tarefas acionadas por esse evento.</li>\n<li>Essas tarefas criarão novos eventos e então esses eventos acionarão mais tarefas</li>\n<li>O Upstart continua a fazer isso até concluir todas as tarefas necessárias</li>\n</ol>",
  "exercise": "Se estiver a executar o Upstart, veja se consegue compreender as configurações de tarefas em /etc/init.",
  "quizQuestion": "Qual é a implementação init utilizada pelo Ubuntu?",
  "quizAnswer": "upstart",
  "slug": "upstartoverview"
}