{
  "id": 4,
  "title": "Trabalhos do Upstart",
  "lessonContent": "O Upstart pode desencadear muitos eventos e trabalhos para serem executados, infelizmente não há uma maneira fácil de ver de onde um evento ou trabalho se originou, então você terá que investigar as configurações de trabalho em /etc/init. Na maioria das vezes, você nunca precisará olhar os arquivos de configuração de trabalho do Upstart, mas você vai querer controlar alguns trabalhos específicos de forma mais fácil. Existem muitos comandos úteis que você pode usar em um sistema Upstart. \n\n<b>Ver trabalhos</b>\n\n<pre>initctl list\n\nshutdown stop/waiting\nconsole stop/waiting\n...\n</pre>\n\nVocê verá uma lista de trabalhos do Upstart com diferentes status aplicados a eles. Em cada linha, o nome do trabalho é o primeiro valor e o segundo campo (antes da /) é na verdade o objetivo do trabalho, o terceiro valor (após a /) é o status atual. Então vemos que nosso trabalho de desligamento eventualmente quer parar, mas atualmente está em um estado de espera. O status e os objetivos do trabalho mudarão conforme você inicia ou interrompe trabalhos. \n\n<b>Ver trabalho específico</b>\n\n<pre>initctl status networking\nnetworking start/running\n</pre>\n\nNão entraremos em detalhes sobre como escrever uma configuração de trabalho do Upstart, no entanto, já sabemos que os trabalhos são parados, iniciados e reiniciados nessas configurações. Esses trabalhos também emitem eventos, então podem iniciar outros trabalhos. Vamos passar pelos comandos manuais da operação do Upstart, mas se você estiver curioso, deve investigar os arquivos .conf com mais profundidade.\n\n<b>Iniciar manualmente um trabalho</b>\n\n<pre>$ sudo initctl start networking</pre>\n\n<b>Parar manualmente um trabalho</b>\n\n<pre>$ sudo initctl stop networking</pre>\n\n<b>Reiniciar manualmente um trabalho</b>\n\n<pre>$ sudo initctl restart networking</pre>\n\n<b>Emitir manualmente um evento</b>\n\n<pre>$ sudo initctl emit some_event</pre>",
  "exercise": "Observe sua lista de trabalhos do Upstart, agora altere o estado do trabalho com um dos comandos que aprendemos hoje. O que você percebe depois?",
  "quizQuestion": "Como eu reiniciaria manualmente um trabalho do Upstart chamado peanuts?",
  "quizAnswer": "sudo initctl restart peanuts",
  "slug": "trabalhos-do-upstart"
}