{
  "id": 3,
  "title": "Anatomie einer Festplatte",
  "lessonContent": "Festplatten können in Partitionen unterteilt werden, wodurch im Wesentlichen mehrere Blockgeräte entstehen. Denken Sie an Beispiele wie /dev/sda1 und /dev/sda2, /dev/sda ist die gesamte Festplatte, aber /dev/sda1 ist die erste Partition auf dieser Festplatte. Partitionen sind äußerst nützlich, um Daten zu trennen. Wenn Sie ein bestimmtes Dateisystem benötigen, können Sie einfach eine Partition erstellen, anstatt die gesamte Festplatte zu einem Dateisystemtyp zu machen.\n\n<b>Partitionstabelle</b>\n\nJede Festplatte hat eine Partitionstabelle, die dem System mitteilt, wie die Festplatte partitioniert ist. Diese Tabelle zeigt an, wo Partitionen beginnen und enden, welche Partitionen bootfähig sind, welche Sektoren der Festplatte welcher Partition zugeordnet sind usw. Es gibt zwei Hauptpartitionstabellenschemata, die verwendet werden: Master Boot Record (MBR) und GUID Partition Table (GPT).\n\n<b>Partition</b>\n\nFestplatten bestehen aus Partitionen, die uns helfen, unsere Daten zu organisieren. Sie können mehrere Partitionen auf einer Festplatte haben, die sich nicht überschneiden können. Wenn Platz nicht einer Partition zugeordnet ist, wird er als Freiraum bezeichnet. Die Arten von Partitionen hängen von Ihrer Partitionstabelle ab. Innerhalb einer Partition können Sie ein Dateisystem haben oder eine Partition anderen Dingen wie Swap widmen.\n\n<i>MBR</i>\n\n<ul>\n<li>Traditionelle Partitionstabelle, wurde als Standard verwendet</li>\n<li>Kann primäre, erweiterte und logische Partitionen haben</li>\n<li>MBR hat eine Grenze von vier primären Partitionen</li>\n<li>Zusätzliche Partitionen können erstellt werden, indem eine primäre Partition in eine erweiterte Partition umgewandelt wird (es kann nur eine erweiterte Partition auf einer Festplatte geben). Dann fügen Sie innerhalb der erweiterten Partition logische Partitionen hinzu. Die logischen Partitionen werden genauso wie jede andere Partition verwendet. Verrückt, ich weiß.</li>\n<li>Unterstützt Festplatten bis zu 2 Terabyte</li>\n</ul>\n\n<i>GPT</i>\n\n<ul>\n<li>GUID Partition Table (GPT) wird zum neuen Standard für die Festplattenpartitionierung</li>\n<li>Hat nur eine Art von Partition und Sie können viele davon erstellen</li>\n<li>Jede Partition hat eine global eindeutige ID (GUID)</li>\n<li>Wird hauptsächlich in Verbindung mit dem UEFI-basierten Booten verwendet (darauf werden wir in einem anderen Kurs eingehen)</li>\n</ul>\n\n<b>Dateisystemstruktur</b>\n\nWir wissen aus unserer vorherigen Lektion, dass ein Dateisystem eine organisierte Sammlung von Dateien und Verzeichnissen ist. In seiner einfachsten Form besteht es aus einer Datenbank zur Verwaltung von Dateien und den eigentlichen Dateien selbst, aber wir werden etwas genauer darauf eingehen. \n\n<ul>\n<li>Bootblock - Dies befindet sich in den ersten Sektoren des Dateisystems und wird vom Dateisystem nicht wirklich verwendet. Es enthält Informationen, die zum Booten des Betriebssystems verwendet werden. Das Betriebssystem benötigt nur einen Bootblock. Wenn Sie mehrere Partitionen haben, haben sie Bootblöcke, aber viele davon werden nicht verwendet.</li>\n<li>Superblock - Dies ist ein einzelner Block, der nach dem Bootblock kommt, und enthält Informationen über das Dateisystem, wie die Größe der Inodetabelle, die Größe der logischen Blöcke und die Größe des Dateisystems.</li>\n<li>Inodetabelle - Denken Sie an dies als die Datenbank, die unsere Dateien verwaltet (wir haben eine ganze Lektion über Inodes, also keine Sorge). Jede Datei oder jedes Verzeichnis hat einen eindeutigen Eintrag in der Inodetabelle und enthält verschiedene Informationen über die Datei.</li>\n<li>Datenblöcke - Dies sind die tatsächlichen Daten für die Dateien und Verzeichnisse.</li>\n</ul>\n\nSchauen wir uns die verschiedenen Partitionstabellen an. Im Folgenden finden Sie ein Beispiel für eine Partition unter Verwendung der MBR-Partitionierungstabelle (msdos). Sie können die primären, erweiterten und logischen Partitionen auf dem Gerät sehen.\n\n<pre>\npete@icebox:~$ sudo parted -l\nModel: Seagate (scsi)\nDisk /dev/sda: 21.5GB\nSektorgröße (logisch/physikalisch): 512B/512B\nPartitionstabelle: msdos\n\nNummer  Start   Ende     Größe    Typ      Dateisystem     Flags\n 1      1049kB  6860MB  6859MB  primär   ext4            boot\n 2      6861MB  21.5GB  14.6GB  erweitert\n 5      6861MB  7380MB  519MB   logisch   linux-swap(v1)\n 6      7381MB  21.5GB  14.1GB  logisch   xfs\n</pre>\n\n\nDieses Beispiel ist GPT und verwendet nur eine eindeutige ID für die Partitionen.\n\n<pre>\nModell: Thumb Drive (scsi)\nDisk /dev/sdb: 4041MB\nSektorgröße (logisch/physikalisch): 512B/512B\nPartitionstabelle: gpt\n\nNummer  Start   Ende     Größe     Dateisystem  Name        Flags\n 1      17.4kB  1000MB  1000MB                first\n 2      1000MB  4040MB  3040MB                second\n</pre>",
  "exercise": "Führen Sie <b>parted -l</b> auf Ihrem Gerät aus und bewerten Sie Ihre Ergebnisse.",
  "quizQuestion": "Welcher Partitionstyp wird verwendet, um mehr als 4 Partitionen im MBR-Partitionierungsschema zu erstellen?",
  "quizAnswer": "erweitert",
  "slug": "anatomieeinerfestplatte"
}