{
  "id": 4,
  "title": "Festplattenpartitionierung",
  "lessonContent": "Lassen Sie uns praktische Dinge mit Dateisystemen machen, indem wir den Prozess an einem USB-Laufwerk durchgehen. Wenn Sie keines haben, keine Sorge, Sie können trotzdem an den nächsten Lektionen teilnehmen. \n\nZuerst müssen wir unsere Festplatte partitionieren. Es gibt viele Tools, um dies zu tun: \n\n<ul>\n<li>fdisk - grundlegendes partitionierungstool für die Befehlszeile, unterstützt kein GPT</li>\n<li>parted - dies ist ein Befehlszeilentool, das sowohl MBR- als auch GPT-Partitionierung unterstützt</li>\n<li>gparted - dies ist die GUI-Version von parted</li>\n<li>gdisk - fdisk, unterstützt jedoch nur GPT, nicht MBR</li>\n</ul>\n\nLassen Sie uns parted verwenden, um unsere Partitionierung durchzuführen. Angenommen, ich schließe das USB-Gerät an und wir sehen, dass der Gerätename /dev/sdb2 ist. \n\n<b>Starten Sie parted</b>\n\n<pre>$ sudo parted</pre>\n\nSie werden in das parted-Tool eingeben, hier können Sie Befehle ausführen, um Ihr Gerät zu partitionieren. \n\n<b>Wählen Sie das Gerät aus</b>\n\n<pre>select /dev/sdb2</pre>\n\nUm das Gerät auszuwählen, mit dem Sie arbeiten werden, wählen Sie es anhand seines Gerätenamens aus.\n\n<b>Aktuelle Partitionstabelle anzeigen</b>\n\n<pre>\n(parted) print                                                            \nModell: Seagate (scsi)\nDisk /dev/sda: 21,5GB\nSektorgröße (logisch/physikalisch): 512B/512B\nPartitionstabelle: msdos\n\nNummer  Start   Ende     Größe    Typ      Dateisystem     Flags\n 1      1049kB  6860MB  6859MB  primär   ext4            boot\n 2      6861MB  21,5GB  14,6GB  erweitert\n 5      6861MB  7380MB  519MB   logisch   linux-swap(v1)\n 6      7381MB  21,5GB  14,1GB  logisch   xfs\n</pre>\n\nHier sehen Sie die verfügbaren Partitionen auf dem Gerät. Die <b>Start</b>- und <b>End</b>-Punkte sind die Stellen, an denen die Partitionen auf der Festplatte Platz einnehmen. Sie sollten einen guten Start- und Endpunkt für Ihre Partitionen finden. \n\n<b>Partitionieren Sie das Gerät</b>\n\n<pre>mkpart primär 123 4567</pre>\n\nWählen Sie einfach einen Start- und Endpunkt aus und erstellen Sie die Partition. Sie müssen den Partitionstyp angeben, abhängig von der verwendeten Tabelle. \n\n<b>Ändern Sie die Größe einer Partition</b>\n\nSie können auch die Größe einer Partition ändern, wenn kein Platz mehr vorhanden ist. \n\n<pre>resize 2 1245 3456</pre>\n\nWählen Sie die Partitionsnummer und dann die Start- und Endpunkte aus, an denen Sie sie ändern möchten. \n\nParted ist ein sehr leistungsfähiges Tool, und Sie sollten vorsichtig sein, wenn Sie Ihre Festplatten partitionieren.",
  "exercise": "Partitionieren Sie ein USB-Laufwerk, wobei die Hälfte des Laufwerks als ext4 und die andere Hälfte als freier Speicherplatz verwendet wird.",
  "quizQuestion": "Was ist der parted-Befehl, um eine Partition zu erstellen?",
  "quizAnswer": "mkpart",
  "slug": "festplattenpartitionierung"
}