{
  "id": 1,
  "title": "Dateisystem-Hierarchie",
  "lessonContent": "An diesem Punkt sind Sie wahrscheinlich mit der Verzeichnisstruktur Ihres Systems gut vertraut, falls nicht, werden Sie es bald sein. Dateisysteme können in ihrer Struktur variieren, aber größtenteils sollten sie dem Dateisystem-Hierarchie-Standard entsprechen. \n\nFühren Sie <b>ls -l /</b> aus, um die unter dem Stammverzeichnis aufgeführten Verzeichnisse zu sehen. Ihre Verzeichnisse können anders aussehen als meine, aber sie sollten größtenteils wie folgt aussehen:\n\n<ul>\n<li>/ - Das Stammverzeichnis der gesamten Dateisystem-Hierarchie, alles ist unter diesem Verzeichnis eingebettet.</li>\n<li>/bin - Wesentliche sofort ausführbare Programme (Binärdateien), enthält die grundlegendsten Befehle wie ls und cp.</li>\n<li>/boot - Enthält Kernel-Bootloader-Dateien.</li>\n<li>/dev - Gerätedateien.</li>\n<li>/etc - Kernsystemkonfigurationsverzeichnis, sollte nur Konfigurationsdateien enthalten und keine Binärdateien.</li>\n<li>/home - Persönliche Verzeichnisse für Benutzer, enthält Ihre Dokumente, Dateien, Einstellungen usw.</li>\n<li>/lib - Enthält Bibliotheksdateien, die von Binärdateien verwendet werden können.</li>\n<li>/media - Wird als Anknüpfungspunkt für Wechselmedien wie USB-Laufwerke verwendet.</li>\n<li>/mnt - Temporär eingehängte Dateisysteme.</li>\n<li>/opt - Optionale Anwendungssoftwarepakete.</li>\n<li>/proc - Informationen über aktuell laufende Prozesse.</li>\n<li>/root - Das Stammverzeichnis des Root-Benutzers.</li>\n<li>/run - Informationen über das laufende System seit dem letzten Start.</li>\n<li>/sbin - Enthält wesentliche Systembinärdateien, die normalerweise nur vom Root-Benutzer ausgeführt werden können.</li>\n<li>/srv - Standortspezifische Daten, die vom System bereitgestellt werden.</li>\n<li>/tmp - Speicherort für temporäre Dateien.</li>\n<li>/usr - Dies ist leider benannt, enthält in den meisten Fällen keine Benutzerdateien im Sinne eines Benutzerverzeichnisses. Dies ist für benutzerinstallierte Software und Dienstprogramme gedacht, jedoch bedeutet das nicht, dass Sie keine persönlichen Verzeichnisse hinzufügen können. In diesem Verzeichnis befinden sich Unterverzeichnisse für /usr/bin, /usr/local usw.</li>\n<li>/var - Verzeichnis für Variablen, wird für Systemprotokollierung, Benutzerverfolgung, Zwischenspeicher usw. verwendet. Grundsätzlich alles, was sich ständig ändert.</li>\n</ul>",
  "exercise": "Schauen Sie in Ihr /usr-Verzeichnis, welche Art von Informationen befinden sich dort?",
  "quizQuestion": "In welchem Verzeichnis werden Protokolle gespeichert?",
  "quizAnswer": "/var",
  "slug": "dateisystemhierarchie"
}