{
  "id": 2,
  "title": "Dateisystemtypen",
  "lessonContent": "Es gibt viele verschiedene Dateisystemimplementierungen. Einige sind schneller als andere, einige unterstützen größere Speicherkapazitäten und andere funktionieren nur auf kleineren Speicherkapazitäten. Unterschiedliche Dateisysteme organisieren ihre Daten auf unterschiedliche Weise, und wir werden im Detail darauf eingehen, welche Arten von Dateisystemen es gibt. Da es so viele verschiedene Implementierungen gibt, benötigen Anwendungen eine Möglichkeit, mit den verschiedenen Operationen umzugehen. Daher gibt es etwas, das als Virtual File System (VFS) Abstraktionsschicht bezeichnet wird. Es handelt sich um eine Schicht zwischen Anwendungen und den verschiedenen Dateisystemtypen, sodass Ihre Anwendungen unabhängig vom Dateisystem damit arbeiten können. \n\nSie können viele Dateisysteme auf Ihren Festplatten haben, abhängig davon, wie sie partitioniert sind, und wir werden das in einer kommenden Lektion durchgehen.\n\n<b>Journaling</b>\n\nJournaling ist standardmäßig bei den meisten Dateisystemtypen aktiviert, aber für den Fall, dass es nicht der Fall ist, sollten Sie wissen, was es bewirkt. Angenommen, Sie kopieren eine große Datei und plötzlich geht der Strom aus. Nun, wenn Sie sich auf einem nicht-journalisierten Dateisystem befinden, würde die Datei beschädigt werden und Ihr Dateisystem wäre inkonsistent, und dann würde Ihr System beim nächsten Start eine Dateisystemüberprüfung durchführen, um sicherzustellen, dass alles in Ordnung ist. Die Reparaturen könnten jedoch je nach Größe Ihres Dateisystems eine Weile dauern. \n\nWenn Sie jedoch auf einem journalisierten System wären, würde Ihr Rechner noch bevor er mit dem Kopieren der Datei beginnt, in einer Protokolldatei (Journal) festhalten, was Sie tun werden. Wenn Sie die Datei dann tatsächlich kopieren, markiert das Journal diese Aufgabe als abgeschlossen, sobald sie abgeschlossen ist. Das Dateisystem ist aufgrund dessen immer in einem konsistenten Zustand, sodass es genau weiß, wo Sie aufgehört haben, wenn Ihr Rechner plötzlich heruntergefahren wird. Dies verkürzt auch die Bootzeit, da es anstatt das gesamte Dateisystem zu überprüfen, nur Ihr Journal betrachtet.\n\n<b>Gängige Desktop-Dateisystemtypen</b>\n\n<ul>\n<li>ext4 - Dies ist die aktuellste Version der nativen Linux-Dateisysteme. Es ist kompatibel mit den älteren Versionen ext2 und ext3. Es unterstützt Festplattenvolumina von bis zu 1 Exabyte und Dateigrößen von bis zu 16 Terabyte und vieles mehr. Es ist die Standardwahl für Linux-Dateisysteme.</li>\n<li>Btrfs - \"Better or Butter FS\", es ist ein neues Dateisystem für Linux, das mit Snapshots, inkrementellen Backups, Leistungssteigerungen und vielem mehr kommt. Es ist weit verbreitet, aber noch nicht ganz stabil und kompatibel.</li>\n<li>XFS - Hochleistungs-Journaling-Dateisystem, ideal für ein System mit großen Dateien wie einem Medienserver.</li>\n<li>NTFS und FAT - Windows-Dateisysteme</li>\n<li>HFS+ - Macintosh-Dateisystem</li>\n</ul>\n\nÜberprüfen Sie, welche Dateisysteme auf Ihrem Rechner vorhanden sind: \n\n<pre>\npete@icebox:~$ df -T\nFilesystem     Type     1K-Blocks    Used Available Use% Mounted on\n/dev/sda1      ext4       6461592 2402708   3707604  40% /\nudev           devtmpfs    501356       4    501352   1% /dev\ntmpfs          tmpfs       102544    1068    101476   2% /run\n/dev/sda6      xfs       13752320  460112  13292208   4% /home\n</pre>\n\nDer <b>df</b> Befehl gibt Informationen zur Dateisystem-Disknutzung und anderen Details über Ihre Festplatte aus. Wir werden später noch mehr über dieses Tool sprechen.",
  "exercise": "Recherchieren Sie online zu den anderen Dateisystemtypen: ReiserFS, ZFS, JFS und andere, die Sie finden können.",
  "quizQuestion": "Was ist der gängige Linux-Dateisystemtyp?",
  "quizAnswer": "ext4",
  "slug": "dateisystemtypen"
}