{
  "id": 11,
  "title": "Inodes",
  "lessonContent": "Erinnern Sie sich daran, wie unser Dateisystem aus all unseren tatsächlichen Dateien und einer Datenbank besteht, die diese Dateien verwaltet? Die Datenbank wird als Inode-Tabelle bezeichnet. \n\n<b>Was ist ein Inode?</b>\n\nEin Inode (Indexknoten) ist ein Eintrag in dieser Tabelle, und es gibt einen für jede Datei. Er beschreibt alles über die Datei, wie z.B.:\n\n<ul>\n<li>Dateityp - reguläre Datei, Verzeichnis, Zeichengerät, usw.</li>\n<li>Besitzer</li>\n<li>Gruppe</li>\n<li>Zugriffsberechtigungen</li>\n<li>Zeitstempel - mtime (Zeit der letzten Dateiänderung), ctime (Zeit der letzten Attributänderung), atime (Zeit des letzten Zugriffs)</li>\n<li>Anzahl der harten Verknüpfungen zur Datei</li>\n<li>Dateigröße</li>\n<li>Anzahl der Blöcke, die der Datei zugewiesen sind</li>\n<li>Zeiger auf die Datenblöcke der Datei - am wichtigsten!</li>\n</ul>\n\nIm Grunde speichern Inodes alles über die Datei, außer dem Dateinamen und der Datei selbst!\n\n<b>Wann werden Inodes erstellt?</b>\n\nWenn ein Dateisystem erstellt wird, wird auch Platz für Inodes zugewiesen. Es gibt Algorithmen, die bestimmen, wie viel Inode-Speicherplatz Sie je nach Volumen der Festplatte und mehr benötigen. Sie haben wahrscheinlich schon einmal Fehlermeldungen für Speicherplatzprobleme gesehen. Nun, dasselbe kann auch für Inodes passieren (obwohl seltener), Sie können also keine weiteren Dateien erstellen, wenn Ihnen die Inodes ausgehen. Denken Sie daran, dass die Datenspeicherung sowohl von den Daten als auch von der Datenbank (Inodes) abhängt. \n\nUm zu sehen, wie viele Inodes auf Ihrem System noch übrig sind, verwenden Sie den Befehl <b>df -i</b>\n\n<b>Inode-Informationen</b>\n\nInodes werden durch Nummern identifiziert. Wenn eine Datei erstellt wird, wird ihr eine Inodennummer zugewiesen, die Nummer wird in aufeinanderfolgender Reihenfolge zugewiesen. Manchmal fällt Ihnen jedoch auf, dass eine neu erstellte Datei eine Inodennummer erhält, die niedriger ist als andere. Das liegt daran, dass gelöschte Inodes von anderen Dateien wiederverwendet werden können. Um Inodennummern anzuzeigen, führen Sie <b>ls -li</b> aus:\n\n<pre>\npete@icebox:~$ ls -li\n140 drwxr-xr-x 2 pete pete 6 Jan 20 20:13 Desktop\n141 drwxr-xr-x 2 pete pete 6 Jan 20 20:01 Documents\n</pre>\n\nDas erste Feld in diesem Befehl listet die Inodennummer auf.\n\nSie können auch detaillierte Informationen über eine Datei mit stat anzeigen, es gibt Ihnen auch Informationen über die Inode.\n\n<pre>\npete@icebox:~$ stat ~/Desktop/\n  Datei: ‘/home/pete/Desktop/’\n  Größe: 6               Blöcke: 0          IO-Block: 4096   Verzeichnis\nGerät: 806h/2054d      Inode: 140         Verknüpfungen: 2\nZugriff: (0755/drwxr-xr-x)  Uid: ( 1000/   pete)   Gid: ( 1000/   pete)\nZugriff: 2016-01-20 20:13:50.647435982 -0800\nÄnderung: 2016-01-20 20:13:06.191675843 -0800\nLetzte Änderung: 2016-01-20 20:13:06.191675843 -0800\n Erstellt: -\n</pre>\n\n\n<b>Wie lokalisieren Inodes Dateien?</b>\n\nWir wissen, dass unsere Daten irgendwo auf der Festplatte sind, leider wurden sie wahrscheinlich nicht sequenziell gespeichert, daher müssen wir Inodes verwenden. Inodes zeigen auf die tatsächlichen Datenblöcke Ihrer Dateien. In einem typischen Dateisystem (nicht alle funktionieren gleich) enthält jeder Inode 15 Zeiger, die ersten 12 Zeiger zeigen direkt auf die Datenblöcke. Der 13. Zeiger zeigt auf einen Block mit Zeigern auf weitere Blöcke, der 14. Zeiger zeigt auf einen weiteren verschachtelten Block von Zeigern, und der 15. Zeiger zeigt wiederum auf einen weiteren Block von Zeigern! Verwirrend, ich weiß! Der Grund, warum dies so gemacht wird, ist, die Inodenstruktur für jede Inode gleich zu halten, aber Dateien unterschiedlicher Größe referenzieren zu können. Wenn Sie eine kleine Datei haben, können Sie sie schneller mit den ersten 12 direkten Zeigern finden, größere Dateien können mit den verschachtelten Zeigern gefunden werden. Auf jeden Fall ist die Struktur des Inodes dieselbe.",
  "exercise": "Beobachten Sie einige Inodennummern für verschiedene Dateien, welche werden normalerweise zuerst erstellt?",
  "quizQuestion": "Wie sehen Sie, wie viele Inodes auf Ihrem System noch übrig sind?",
  "quizAnswer": "df -i",
  "slug": "inodes"
}