{
  "id": 12,
  "title": "Symlinks",
  "lessonContent": "Lassen Sie uns ein früheres Beispiel für Inode-Informationen verwenden: \n\n<pre>\npete@icebox:~$ ls -li\n140 drwxr-xr-x 2 pete pete 6 Jan 20 20:13 Desktop\n141 drwxr-xr-x 2 pete pete 6 Jan 20 20:01 Documents\n</pre>\n\nDu hast vielleicht bemerkt, dass wir das dritte Feld im ls-Befehl bisher vernachlässigt haben, dieses Feld ist die Linkanzahl. Die Linkanzahl ist die Gesamtanzahl der harten Links, die eine Datei hat, das bedeutet dir im Moment nichts. Lassen Sie uns also zuerst über Links sprechen. \n\n<b>Symlinks</b>\n\nIm Windows-Betriebssystem gibt es sogenannte Verknüpfungen, Verknüpfungen sind nur Aliasnamen für andere Dateien. Wenn Sie etwas mit der Originaldatei machen, könnten Sie die Verknüpfung potenziell brechen. In Linux entsprechen Verknüpfungen symbolische Links (oder Softlinks oder Symlinks). Symlinks ermöglichen es uns, auf eine andere Datei über ihren Dateinamen zu verweisen. Ein weiterer Typ von Links, die in Linux gefunden werden, sind Hardlinks, dies sind tatsächlich eine andere Datei mit einem Link zu einem Inode. Lassen Sie uns sehen, was ich damit in der Praxis meine, beginnend mit Symlinks.\n\n<pre>\npete@icebox:~/Desktop$ echo 'myfile' > myfile\npete@icebox:~/Desktop$ echo 'myfile2' > myfile2\npete@icebox:~/Desktop$ echo 'myfile3' > myfile3\n\npete@icebox:~/Desktop$ ln -s myfile myfilelink\npete@icebox:~/Desktop$ ls -li\ntotal 12\n  151 -rw-rw-r-- 1 pete pete 7 Jan 21 21:36 myfile\n93401 -rw-rw-r-- 1 pete pete 8 Jan 21 21:36 myfile2\n93402 -rw-rw-r-- 1 pete pete 8 Jan 21 21:36 myfile3\n93403 lrwxrwxrwx 1 pete pete 6 Jan 21 21:39 myfilelink -> myfile\n</pre>\n\nSie sehen, dass ich einen symbolischen Link namens myfilelink erstellt habe, der auf myfile verweist. Symbolische Links werden durch -> gekennzeichnet. Beachten Sie, wie ich jedoch eine neue Inode-Nummer erhalten habe, Symlinks sind nur Dateien, die auf Dateinamen verweisen. Wenn Sie einen Symlink ändern, wird auch die Datei geändert. Inode-Nummern sind eindeutig für Dateisysteme, Sie können nicht zwei gleiche Inode-Nummern in einem einzigen Dateisystem haben, das bedeutet, dass Sie nicht auf eine Datei in einem anderen Dateisystem über ihre Inode-Nummer verweisen können. Wenn Sie jedoch Symlinks verwenden, verwenden sie keine Inode-Nummern, sie verwenden Dateinamen, sodass sie über verschiedene Dateisysteme hinweg referenziert werden können. \n\n<b>Hardlinks</b>\n\nLassen Sie uns ein Beispiel für einen Hardlink sehen:\n\n<pre>\npete@icebox:~/Desktop$ ln myfile2 myhardlink\npete@icebox:~/Desktop$ ls -li\ntotal 16\n  151 -rw-rw-r-- 1 pete pete 7 Jan 21 21:36 myfile\n93401 -rw-rw-r-- 2 pete pete 8 Jan 21 21:36 myfile2\n93402 -rw-rw-r-- 1 pete pete 8 Jan 21 21:36 myfile3\n93403 lrwxrwxrwx 1 pete pete 6 Jan 21 21:39 myfilelink -> myfile\n93401 -rw-rw-r-- 2 pete pete 8 Jan 21 21:36 myhardlink\n</pre>\n\nEin Hardlink erstellt einfach eine weitere Datei mit einem Link zum selben Inode. Wenn ich den Inhalt von myfile2 oder myhardlink ändern würde, würde die Änderung auf beiden sichtbar sein, aber wenn ich myfile2 löschen würde, wäre die Datei immer noch über myhardlink zugänglich. Hier kommt unsere Linkanzahl im ls-Befehl ins Spiel. Die Linkanzahl ist die Anzahl der Hardlinks, die ein Inode hat, wenn Sie eine Datei entfernen, wird diese Linkanzahl verringert. Der Inode wird nur gelöscht, wenn alle Hardlinks zum Inode gelöscht wurden. Wenn Sie eine Datei erstellen, ist ihre Linkanzahl 1, weil es die einzige Datei ist, die auf diesen Inode verweist. Im Gegensatz zu Symlinks erstrecken sich Hardlinks nicht über Dateisysteme, da Inodes eindeutig für das Dateisystem sind. \n\n<b>Erstellen eines Symlinks</b>\n\n<pre>\n$ ln -s myfile mylink</pre>\n\nUm einen symbolischen Link zu erstellen, verwenden Sie den ln-Befehl mit -s für symbolisch und geben ein Ziel und dann einen Linknamen an. \n\n<b>Erstellen eines Hardlinks</b>\n\n<pre>\n$ ln somefile somelink</pre>\n\nÄhnlich wie bei der Erstellung eines Symlinks, lassen Sie dieses Mal das -s weg.",
  "exercise": "Spielen Sie mit der Erstellung von Symlinks und Hardlinks, löschen Sie ein paar und sehen Sie, was passiert.",
  "quizQuestion": "Welcher Befehl wird verwendet, um einen Symlink zu erstellen?",
  "quizAnswer": "ln -s",
  "slug": "symlinks"
}