{
  "id": 4,
  "title": "Dirección de red",
  "lessonContent": "Antes de ver cómo se mueve un paquete a través de una red, debemos familiarizarnos con algunos términos. Cuando envías una carta, debes saber a quién se envía y de dónde proviene. Los paquetes necesitan la misma información, nuestros hosts y otros hosts se identifican utilizando direcciones MAC (control de acceso a medios) y direcciones IP, para facilitarnos la identificación usamos nombres de host.\n\n<b>Direcciones MAC</b>\n\nUna dirección MAC es un identificador único utilizado como dirección de hardware. Esta dirección nunca cambiará. Cuando deseas acceder a Internet, tu máquina necesita tener un dispositivo llamado tarjeta de interfaz de red. Este adaptador de red tiene su propia dirección de hardware que se utiliza para identificar tu máquina. Una dirección MAC para un dispositivo Ethernet se ve algo así: 00:C4:B5:45:B2:43. Las direcciones MAC se asignan a los adaptadores de red cuando se fabrican. Cada fabricante tiene un identificador único organizacional (OUI) para identificarlos como el fabricante. Este OUI se indica en los primeros 3 bytes de la dirección MAC. Por ejemplo, Dell tiene 00-14-22, por lo que un adaptador de red de Dell podría tener una dirección MAC como: 00-14-22-34-B2-C2. \n\n<b>Direcciones IP</b>\n\nUna dirección IP se utiliza para identificar un dispositivo en una red, son independientes del hardware y pueden variar en sintaxis dependiendo de si estás utilizando IPv4 o IPv6 (más sobre esto más adelante). Por ahora asumiremos que estás utilizando IPv4, por lo que una dirección IP típica se vería así: 10.24.12.4. Las direcciones IP se utilizan en el lado del software de las redes. Cada vez que un sistema está conectado a Internet, debe tener una dirección IP. También pueden cambiar si tu red cambia y son únicas en todo Internet (esto no siempre es el caso una vez que aprendemos sobre NAT). \n\nRecuerda que se necesitan tanto software como hardware para mover paquetes a través de las redes, por lo que tenemos dos identificadores para cada uno, MAC (hardware) e IP (software).\n\n<b>Nombres de host</b>\n\nUna última forma de identificar tus máquinas es a través del nombre de host. Los nombres de host toman tu dirección IP y te permiten vincular esa dirección a un nombre legible para los humanos. En lugar de recordar 192.12.41.4, puedes recordar simplemente myhost.com.",
  "exercise": "No hay ejercicios para esta lección.",
  "quizQuestion": "¿Cuántos bytes hay en una dirección IPv4?",
  "quizAnswer": "4",
  "slug": "direccionred"
}