{
  "id": 3,
  "title": "Modelo TCP/IP",
  "lessonContent": "El modelo OSI dio origen a lo que eventualmente se convirtió en el modelo TCP/IP y este modelo es en realidad en lo que se basa Internet. Es la implementación real de la red. El modelo TCP/IP utiliza el conjunto de protocolos TCP/IP, al que comúnmente nos referimos simplemente como TCP/IP. Estos protocolos trabajan juntos para especificar cómo se deben recopilar, dirigir, transmitir y enrutar los datos a través de una red. Utilizando el modelo TCP/IP, podemos ver cómo estos protocolos se utilizan para mostrar el desglose de cómo un paquete viaja a través de la red.\n\n<b>Capa de Aplicación</b>\n\nLa capa superior del modelo TCP/IP. Determina cómo los programas de tu computadora (como tu navegador web) interactúan con los servicios de la capa de transporte para ver los datos que se envían o se reciben.\n\nEsta capa utiliza:\n<ul>\n<li>HTTP (Protocolo de Transferencia de Hipertexto) - utilizado para las páginas web en Internet.</li>\n<li>SMTP (Protocolo Simple de Transferencia de Correo) - transmisión de correo electrónico</li>\n</ul>\n\n<b>Capa de Transporte</b>\n\nCómo se transmitirán los datos, incluye la verificación de los puertos correctos, la integridad de los datos y básicamente la entrega de nuestros paquetes.\n\nEsta capa utiliza:\n<ul>\n<li>TCP (Protocolo de Control de Transmisión) - entrega fiable de datos</li>\n<li>UDP (Protocolo de Datagramas de Usuario) - entrega no fiable de datos</li>\n</ul>\n\n<b>Capa de Red</b>\n\nEsta capa especifica cómo mover paquetes entre hosts y a través de redes.\n\nEsta capa utiliza:\n<ul>\n<li>IP (Protocolo de Internet) - Ayuda a enrutar paquetes de una máquina a otra.</li>\n<li>ICMP (Protocolo de Mensajes de Control de Internet) - Ayuda a informarnos sobre lo que está sucediendo, como mensajes de error e información de depuración.</li>\n</ul>\n\n<b>Capa de Enlace</b>\n\nEsta capa especifica cómo enviar datos a través de un componente físico. Como datos que viajan a través de Ethernet, fibra, etc.\n\nLas listas anteriores de protocolos que cada capa utiliza no son exhaustivas y encontrarás muchos otros protocolos que entran en juego.\n\nEn las siguientes lecciones, profundizaremos en cada una de estas capas y discutiremos cómo nuestro paquete atraviesa la red a través del modelo TCP/IP (hay muchas perspectivas sobre cómo un paquete viaja a través de las redes, no las veremos todas, pero ten en cuenta que existen).",
  "exercise": "No hay ejercicios para esta lección.",
  "quizQuestion": "¿Cuál es la capa superior del modelo TCP/IP?",
  "quizAnswer": "Aplicación",
  "slug": "modelo-tcpip"
}