{
  "id": 6,
  "title": "Capa de transporte",
  "lessonContent": "La capa de transporte nos ayuda a transferir nuestros datos de una manera que las redes puedan leer. Divide nuestros datos en fragmentos que se transportarán y se volverán a unir en el orden correcto. Estos fragmentos se conocen como segmentos. Los segmentos facilitan el transporte de datos a través de las redes. \n\n<b>Puertos</b>\n\nAunque sepamos a dónde enviamos nuestros datos a través de direcciones IP, estas no son lo suficientemente específicas para enviar nuestros datos a ciertos procesos o servicios. Servicios como HTTP utilizan un canal de comunicación a través de puertos. Si queremos enviar datos de una página web, necesitamos enviarlos a través del puerto HTTP (puerto 80). Además de formar segmentos, la capa de transporte también adjuntará los puertos de origen y destino al segmento, para que cuando el receptor reciba el paquete final sepa qué puerto utilizar. \n\n<b>UDP</b>\n\nHay dos protocolos de transporte populares: UDP y TCP. Discutiremos brevemente UDP y pasaremos la mayor parte de nuestro tiempo en TCP, ya que es el más comúnmente utilizado.\n\nUDP no es un método confiable para transportar datos, de hecho no le importa realmente si obtienes todos tus datos originales. Esto puede sonar terrible, pero tiene sus usos, como en la transmisión de medios, está bien si pierdes algunos fotogramas a cambio de obtener tus datos un poco más rápido. \n\n<b>TCP</b>\n\nTCP proporciona una conexión confiable y orientada a la transmisión de datos. TCP utiliza puertos para enviar datos hacia y desde los hosts. Una aplicación abre una conexión desde un puerto en su host hacia otro puerto en un host remoto. Para establecer la conexión, utilizamos el saludo de TCP. \n\n<ul>\n<li>El cliente (proceso de conexión) envía un segmento SYN al servidor para solicitar una conexión</li>\n<li>El servidor envía al cliente un segmento SYN-ACK para confirmar la solicitud de conexión del cliente</li>\n<li>El cliente envía un ACK al servidor para confirmar la solicitud de conexión del servidor</li>\n</ul>\n\nUna vez establecida esta conexión, los datos pueden intercambiarse a través de una conexión TCP. Los datos se envían en diferentes segmentos y se rastrean con números de secuencia TCP para que puedan ser ordenados en el orden correcto cuando se entregan. En nuestro ejemplo de correo electrónico, la capa de transporte adjunta el puerto de destino (25) al puerto de origen del host de origen.",
  "exercise": "No hay ejercicios para esta lección.",
  "quizQuestion": "¿Cuál es un protocolo de transporte confiable?",
  "quizAnswer": "TCP",
  "slug": "capadetransporte"
}