{
  "id": 3,
  "title": "/etc/passwd",
  "lessonContent": "Помните, что имена пользователей на самом деле не являются идентификаторами для пользователей. Система использует идентификатор пользователя (UID) для идентификации пользователя. Чтобы узнать, какие пользователи сопоставлены с каким идентификатором, посмотрите файл /etc/passwd. \n\n<pre>$ cat /etc/passwd</pre>\n\nЭтот файл показывает вам список пользователей и подробную информацию о них. Например, первая строка в этом файле, скорее всего, выглядит так:\n\n<pre>root:x:0:0:root:/root:/bin/bash</pre>\n\nКаждая строка отображает информацию о пользователе, обычно вы увидите пользователя root как первую строку. Есть много полей, разделенных двоеточиями, которые сообщают вам дополнительную информацию о пользователе, давайте рассмотрим их все:\n\n<ol>\n<li>Имя пользователя</li>\n<li>Пароль пользователя - пароль на самом деле не хранится в этом файле, обычно он хранится в файле /etc/shadow. Мы обсудим больше в следующем уроке о /etc/shadow, но пока знайте, что он содержит зашифрованные пароли пользователей. Вы увидите много различных символов в этом поле, если вы видите \"x\", это означает, что пароль хранится в файле /etc/shadow, \"*\" означает, что пользователь не имеет доступа к входу, и если поле пустое, это означает, что у пользователя нет пароля.</li>\n<li>Идентификатор пользователя - как вы видите, у root UID 0</li>\n<li>Идентификатор группы</li>\n<li>Поле GECOS - используется для общих комментариев о пользователе или учетной записи, таких как их настоящее имя или номер телефона, оно разделено запятыми.</li>\n<li>Домашний каталог пользователя</li>\n<li>Оболочка пользователя - вы, вероятно, увидите, что многие пользователи используют bash в качестве своей оболочки по умолчанию</li>\n</ol>\n\nОбычно на странице настройки пользователя вы ожидаете увидеть только человеческих пользователей. Однако вы заметите, что в /etc/passwd содержатся и другие пользователи. Помните, что пользователи на самом деле находятся на системе только для запуска процессов с разрешениями. Иногда мы хотим запускать процессы с заранее определенными разрешениями. Например, пользователь демона используется для демонических процессов.\n\nТакже стоит отметить, что вы можете редактировать файл /etc/passwd вручную, если хотите добавить пользователей и изменить информацию с помощью инструмента <b>vipw</b>, однако такие вещи лучше оставить для инструментов, о которых мы поговорим в следующем уроке, таких как useradd и userdel.",
  "exercise": "Посмотрите свой файл /etc/passwd, взгляните на некоторых пользователей и обратите внимание на доступ, который у них есть.",
  "quizQuestion": "Как обозначается отсутствие доступа к входу у пользователя в файле /etc/passwd?",
  "quizAnswer": "*",
  "slug": "etcpasswdfile"
}