{
  "id": 1,
  "title": "Пользователи и Группы",
  "lessonContent": "В любой традиционной операционной системе существуют пользователи и группы. Они существуют исключительно для доступа и разрешений. При запуске процесса он будет запущен от имени владельца этого процесса, будь то Джейн или Боб. Доступ к файлам и владение ими также зависит от разрешений. Вы бы не хотели, чтобы Джейн видела документы Боба и наоборот. \n\nУ каждого пользователя есть свой домашний каталог, где хранятся его собственные файлы, обычно он находится в /home/имя_пользователя, но может отличаться в различных дистрибутивах. \n\nСистема использует идентификаторы пользователей (UID) для управления пользователями, имена пользователей - это дружественный способ ассоциировать пользователей с идентификацией, но система идентифицирует пользователей по их UID. Система также использует группы для управления разрешениями, группы - это просто наборы пользователей с разрешениями, установленными для этой группы, они идентифицируются системой с помощью их идентификатора группы (GID).\n\nВ Linux у вас будут пользователи, помимо обычных людей, использующих систему. Иногда это пользователи системных служб, которые непрерывно запускают процессы для обеспечения функционирования системы. Один из самых важных пользователей - root или суперпользователь, root - самый мощный пользователь в системе, root может получить доступ к любому файлу, запустить и завершить любой процесс. Поэтому постоянная работа от имени root может быть опасной, вы можете потенциально удалить критически важные файлы системы. К счастью, если требуется доступ root и у пользователя есть такой доступ, он может запустить команду от имени root с помощью команды sudo. Команда sudo (superuser do) используется для выполнения команды с доступом root, мы более подробно рассмотрим, как пользователь получает доступ root, в следующем уроке.\n\nПопробуйте просмотреть защищенный файл, например /etc/shadow:\n\n<pre>$ cat /etc/shadow</pre>\n\nОбратите внимание, что вы получите ошибку доступа запрещен, посмотрите разрешения с помощью: \n\n<pre>$ ls -la /etc/shadow\n\n-rw-r----- 1 root shadow 1134 Dec 1 11:45 /etc/shadow\n</pre>\n\nМы еще не рассматривали разрешения, но что происходит здесь, это то, что root является владельцем файла, и вам понадобится доступ root или быть частью группы shadow для чтения содержимого. Теперь выполните команду с sudo:\n\n<pre>$ sudo cat /etc/shadow</pre>\n\nТеперь вы сможете увидеть содержимое файла!",
  "exercise": "Урок не содержит упражнений.",
  "quizQuestion": "Какую команду вы используете для выполнения от имени root?",
  "quizAnswer": "sudo",
  "slug": "usersandgroups"
}