{
  "id": 1,
  "title": "Netzwerkschnittstellen",
  "lessonContent": "Eine Netzwerkschnittstelle ist die Verbindung des Kernel zwischen der Softwareseite des Netzwerks und der Hardwareseite. Wir haben bereits ein Beispiel dafür gesehen: \n\n<pre>\npete@icebox:~$ ifconfig -a\neth0      Link encap:Ethernet  HWaddr 1d:3a:32:24:4d:ce  \n          inet addr:192.168.1.129  Bcast:192.168.1.255  Mask:255.255.255.0\n          inet6 addr: fd60::21c:29ff:fe63:5cdc/64 Scope:Link\n</pre>\n\n<b> Der ifconfig Befehl</b>\n\nDas <b>ifconfig</b> Tool ermöglicht es uns, unsere Netzwerkschnittstellen zu konfigurieren. Wenn keine Netzwerkschnittstellen eingerichtet sind, wissen die Gerätetreiber des Kernels und das Netzwerk nicht, wie sie miteinander kommunizieren sollen. Ifconfig wird beim Booten ausgeführt und konfiguriert unsere Schnittstellen über Konfigurationsdateien, aber wir können sie auch manuell ändern. Die Ausgabe von ifconfig zeigt den Schnittstellennamen auf der linken Seite und auf der rechten Seite detaillierte Informationen. Sie werden Schnittstellen mit den Namen eth0 (erste Ethernet-Karte im Gerät), wlan0 (drahtlose Schnittstelle), lo (Loopback-Schnittstelle) am häufigsten sehen. Die Loopback-Schnittstelle wird verwendet, um Ihren Computer darzustellen, sie leitet Sie einfach zurück zu sich selbst. Dies ist gut für Debugging oder die Verbindung zu lokal ausgeführten Servern. \n\nDer Status der Schnittstellen kann aktiv (up) oder inaktiv (down) sein. Wie Sie sich vorstellen können, wenn Sie eine Schnittstelle \"ausschalten\" möchten, können Sie sie auf inaktiv setzen. Die Felder, die Sie in der Ausgabe von ifconfig wahrscheinlich am häufigsten betrachten werden, sind HWaddr (MAC-Adresse der Schnittstelle), inet-Adresse (IPv4-Adresse) und inet6 (IPv6-Adresse). Natürlich können Sie auch die Subnetzmaske und die Broadcast-Adresse sehen. Sie können auch Schnittstelleninformationen unter /etc/network/interfaces einsehen.\n\n<b>Um eine Schnittstelle zu erstellen und zu aktivieren</b>\n\n<pre>$ ifconfig eth0 192.168.2.1 netmask 255.255.255.0 up</pre>\n\nDies weist der Schnittstelle eth0 eine IP-Adresse und Netzmaske zu und aktiviert sie.\n\n<b>Um eine Schnittstelle zu aktivieren oder zu deaktivieren</b>\n\n<pre>\n$ ifup eth0\n$ ifdown eth0\n</pre>\n\n<b> Der ip Befehl </b>\n\nDer <b>ip</b> Befehl ermöglicht es uns auch, den Netzwerkstack eines Systems zu manipulieren. Je nach der verwendeten Distribution kann dies die bevorzugte Methode zur Manipulation Ihrer Netzwerkeinstellungen sein. \n\nHier sind einige Beispiele für seine Verwendung:\n\n<b>Um Informationen zu allen Schnittstellen anzuzeigen</b>\n<pre>\n$ ip link show\n</pre>\n\n<b>Um die Statistiken einer Schnittstelle anzuzeigen</b>\n<pre>\n$ ip -s link show eth0\n</pre>\n\n\n<b>Um den den Schnittstellen zugewiesenen IP-Adressen anzuzeigen</b>\n<pre>\n$ ip address show\n</pre>\n\n<b>Um Schnittstellen zu aktivieren oder zu deaktivieren</b>\n<pre>\n$ ip link set eth0 up\n$ ip link set eth0 down\n</pre>\n\n<b>Um einer Schnittstelle eine IP-Adresse hinzuzufügen</b>\n<pre>\n$ ip address add 192.168.1.1/24 dev eth0\n</pre>",
  "exercise": "Versuchen Sie, den Zustand Ihrer Netzwerkschnittstellen auf aktiv oder inaktiv zu ändern und beobachten Sie, was passiert.\n\nKönnen Sie Ihre Netzwerkschnittstellen sowohl mit den Befehlen ifconfig als auch ip ändern?",
  "quizQuestion": "Was ist der Befehl zum Konfigurieren unserer Netzwerkschnittstellen?",
  "quizAnswer": "ifconfig",
  "slug": "netzwerkschnittstellen"
}