{
  "id": 1,
  "title": "regex (Expresiones Regulares)",
  "lessonContent": "Las expresiones regulares son una herramienta poderosa para hacer selección basada en patrones. Utiliza notaciones especiales similares a las que ya hemos encontrado, como el comodín *. \n\nRepasaremos un par de las expresiones regulares más comunes, estas son casi universales en cualquier lenguaje de programación.\n\nUsaremos esta frase como nuestra cadena de prueba:\n<pre>\nsally vende conchas \nen la orilla del mar\n</pre>\n\n<b>1. Inicio de una línea con ^</b>\n\n<pre>\n<b>^</b>en\ncoincidiría con la línea \"en la orilla del mar\"\n</pre>\n\n<b>2. Fin de una línea con $</b>\n\n<pre>\nmar<b>$</b>\ncoincidiría con la línea \"en la orilla del mar\"\n</pre>\n\n<b>3. Coincidir con cualquier carácter individual con .</b>\n\n<pre>\nc<b>.</b>\ncoincidiría con con\n</pre>\n\n<b>4. Notación de corchetes con [] y ()</b>\n\nEsto puede ser un poco complicado, los corchetes nos permiten especificar los caracteres encontrados dentro del corchete. \n\n<pre>\nc<b>[aei]</b>l\ncoincidiría con: cal, cel, cil\n</pre>\n\nLa etiqueta de anclaje anterior ^ cuando se usa en un corchete significa cualquier cosa excepto los caracteres dentro del corchete. \n\n<pre>\nc<b>[^a]</b>l\ncoincidiría con: cel y cil pero no cal\n</pre>\n\nLos corchetes también pueden usar rangos para aumentar la cantidad de caracteres que deseas usar. \n\n<pre>\nc<b>[a-c]</b>l\ncoincidirá con patrones como cal, cbl y ccl\n</pre>\n\nTen cuidado, ya que los corchetes distinguen entre mayúsculas y minúsculas:\n\n<pre>\nc<b>[A-C]</b>l\ncoincidirá con cAl, cBl y cCl pero no cal, cbl y ccl\n</pre>\n\nY esas son algunas expresiones regulares básicas.",
  "exercise": "Intenta combinar expresiones regulares con grep y buscar a través de algunos archivos.\n\n<pre>\ngrep [expresión regular aquí] [archivo]",
  "quizQuestion": "¿Qué expresión regular usarías para coincidir con un solo carácter?",
  "quizAnswer": ".",
  "slug": "expresionesregularesregex"
}