{
  "id": 2,
  "title": "Компоненты DNS",
  "lessonContent": "База данных DNS Интернета зависит от сайтов и организаций, предоставляющих часть этой базы данных. Для этого им необходимо:\n\n<b>Сервер имен</b>\n\nМы настраиваем DNS с помощью \"серверов имен\", которые загружают наши настройки и конфигурации DNS и отвечают на любые вопросы от клиентов или других серверов, которые хотят знать такие вещи, как \"Кто такой google.com?\". Если сервер имен не знает ответ на этот запрос, он перенаправит запрос на другие серверы имен. Серверы имен могут быть \"авторитетными\", что означает, что они содержат фактические DNS-записи, которые вам нужны, или \"рекурсивными\", что означает, что они будут запрашивать другие серверы, и эти серверы будут запрашивать другие серверы, пока не найдут авторитетный сервер, который содержит DNS-записи. Рекурсивные серверы также могут кэшировать информацию, которую мы хотим, вместо того чтобы обращаться к авторитетному серверу.\n\n<b>Файл зоны</b>\n\nВнутри сервера имен находится так называемый файл зоны. Файлы зон - это то, как сервер имен хранит информацию о домене или о том, как к нему попасть, если он не знает.\n\n<b>Записи ресурсов</b>\n\nФайл зоны состоит из записей ресурсов. Каждая строка - это запись и содержит информацию о хостах, серверах имен, других ресурсах и т. д. Поля состоят из следующего: \n\n<ul>\n<li>Имя записи</li>\n<li>TTL - Время, через которое мы удаляем запись и получаем новую, в DNS TTL обозначается временем, поэтому записи могут иметь TTL в один час. Мы делаем это потому, что Интернет постоянно меняется, одну минуту хост может быть сопоставлен с IP-адресом X, а следующую - с IP-адресом Y</li>\n<li>Класс - Пространство имен информации записи, наиболее часто используется IN для Интернета</li>\n<li>Тип - Тип информации, хранящейся в данных записи. Мы не будем вдаваться в типы записей, но вы, вероятно, видели обычные, такие как A для адреса, MX или почтовый обменник и т. д.</li>\n<li>Данные - Это поле может содержать IP-адрес, если это запись A, или что-то другое в зависимости от типа записи.</li>\n</ul>\n<pre>\npatty    IN  A      192.168.0.4 \n</pre>",
  "exercise": "Урок не содержит упражнений.",
  "quizQuestion": "Какой тип записи ресурса используется для почтовых обменников?",
  "quizAnswer": "MX",
  "slug": "компоненты-dns"
}