{
  "id": 3,
  "title": "Процесс DNS",
  "lessonContent": "Давайте рассмотрим пример того, как ваш хост находит домен (catzontheinterwebz.com) с помощью DNS. По сути, мы просачиваемся вниз, пока не достигнем DNS-сервера, который знает об этом домене.\n\n<b>Локальный DNS-сервер</b>\n\nСначала наш хост спрашивает: \"Где находится catzontheinterwebz.com?\", наш локальный DNS-сервер не знает, поэтому он начинает с верхушки воронки, чтобы спросить Корневые серверы. Имейте в виду, что наш хост не делает эти запросы напрямую для поиска catzontheinterwebz.com, большинство пользователей общаются с рекурсивным DNS-сервером, предоставляемым своими поставщиками услуг Интернета, и этот сервер затем получает задачу найти местоположение catzontheinterwebz.com.\n\n<b>Корневые серверы</b>\n\nСуществует 13 Корневых серверов для Интернета, они зеркалируются и распределяются по всему миру для обработки DNS-запросов для Интернета, поэтому на самом деле существует сотни серверов, которые работают, они контролируются различными организациями и содержат информацию о доменах верхнего уровня. Домены верхнего уровня - это то, что вы знаете как адреса .org, .com, .net и т. д. Таким образом, Корневой сервер не знает, где находится catzontheinterwebz.com, поэтому он говорит нам спросить DNS-сервер домена верхнего уровня .com по IP-адресу, который он нам дает.\n\n<b>Домен верхнего уровня</b>\n\nИтак, теперь мы отправляем еще один запрос к серверу имен, который знает о доменах \".com\" и спрашиваем, знает ли он, где находится catzontheinterwebz.com? Домен верхнего уровня не имеет catzontheinterwebz.com в своих зонных файлах, но видит запись для сервера имен для catzontheinterwebz.com. Поэтому он дает нам IP-адрес этого сервера имен и говорит нам посмотреть туда.\n\n<b>Авторитетный DNS-сервер</b>\n\nТеперь мы отправляем последний запрос к DNS-серверу, который действительно имеет запись, которую мы хотим. Сервер имен видит, что у него есть зонный файл для catzontheinterwebz.com и есть ресурсная запись для 'www' для этого хоста. Затем он дает нам IP-адрес этого хоста, и мы наконец можем увидеть некоторых котов в Интернете.",
  "exercise": "Урок без упражнений.",
  "quizQuestion": "Какое сокращение для серверов имен, где находятся адреса .com, .net, .org и т. д.?",
  "quizAnswer": "ДВУ",
  "slug": "dnsprocess"
}