{
  "id": 4,
  "title": "Kernel-Installation",
  "lessonContent": "Ok, jetzt, da wir all das langweilige Zeug aus dem Weg haben, reden wir über das tatsächliche Installieren und Modifizieren von Kernels. Sie können mehrere Kernels auf Ihrem System installieren, erinnern Sie sich an unsere Lektion zum Bootvorgang? Im GRUB-Menü können wir auswählen, welchen Kernel wir booten möchten. \n\nUm zu sehen, welche Kernelversion Sie auf Ihrem System haben, verwenden Sie den folgenden Befehl:\n\n<pre>$ uname -r\n3.19.0-43-generic</pre>\n\nDer uname-Befehl gibt Systeminformationen aus, der -r-Befehl gibt die gesamte Kernelversionsnummer aus.\n\nSie können den Linux-Kernel auf verschiedene Weisen installieren, Sie können das Quellpaket herunterladen und aus den Quellen kompilieren oder Sie können es mit Paketverwaltungstools installieren.\n\n<pre>$ sudo apt install linux-generic-lts-vivid</pre>\n\nund dann einfach in den installierten Kernel neu starten. Einfach, oder? Ein bisschen, Sie müssen auch andere Linux-Pakete installieren, wie z.B. die linux-headers, linux-image-generic, usw.). Sie können auch die Versionsnummer angeben, sodass der obige Befehl wie folgt aussehen kann: <b>sudo apt install 3.19.0-43-generic</b>\n\nAlternativ, wenn Sie nur die aktualisierte Kernelversion möchten, verwenden Sie einfach dist-upgrade, es führt Upgrades für alle Pakete auf Ihrem System durch:\n\n<pre>$ sudo apt dist-upgrade</pre>\n\nEs gibt viele verschiedene Kernelversionen, einige werden als LTS (Langzeitunterstützung) verwendet, einige sind die neuesten und besten, die Kompatibilität kann zwischen Kernelversionen sehr unterschiedlich sein, daher möchten Sie möglicherweise verschiedene Kernel ausprobieren.",
  "exercise": "<ol>\n<li>Ermitteln Sie, welche Kernelversion Sie haben.</li>\n<li>Recherchieren Sie die verschiedenen verfügbaren Kernelversionen.</li>\n</ol>",
  "quizQuestion": "Wie sehen Sie die Kernelversion Ihres Systems?",
  "quizAnswer": "uname -r",
  "slug": "kernelinstallation"
}