{
  "id": 6,
  "title": "Kernel-Module",
  "lessonContent": "Angenommen, ich habe ein tolles Auto, in das ich viel Zeit und Geld investiere. Ich füge einen Spoiler, eine Anhängerkupplung, einen Fahrradträger und andere zufällige Dinge hinzu. Diese Komponenten ändern die Kernfunktionalität des Autos nicht tatsächlich und ich kann sie sehr einfach entfernen und hinzufügen. Der Kernel verwendet dasselbe Konzept mit Kernel-Modulen.\n\nDer Kernel an sich ist ein monolithisches Softwarestück. Wenn wir Unterstützung für einen neuen Tastaturtyp hinzufügen möchten, schreiben wir diesen Code nicht direkt in den Kernelcode. Genau wie wir keinen Fahrradträger an unser Auto schweißen würden (nun ja, vielleicht würden das einige Leute tun). Kernel-Module sind Code-Stücke, die bei Bedarf in den Kernel geladen und entladen werden können. Sie ermöglichen es uns, die Funktionalität des Kernels zu erweitern, ohne tatsächlich zum Kernkernelcode hinzuzufügen. Wir können auch Module hinzufügen, ohne das System neu starten zu müssen (in den meisten Fällen).\n\n<b>Liste der aktuell geladenen Module anzeigen</b>\n\n<pre>$ lsmod</pre>\n\n<b>Ein Modul laden</b>\n\n<pre>$ sudo modprobe bluetooth</pre>\n\nModprobe versucht, das Modul von <b>/lib/modules/(Kernel-Version)/kernel/drivers</b> zu laden. Kernel-Module können auch Abhängigkeiten haben, modprobe lädt unsere Modulabhängigkeiten, wenn sie nicht bereits geladen sind.\n\n<b>Ein Modul entfernen</b>\n\n<pre>$ sudo modprobe -r bluetooth</pre>\n\n<b>Beim Booten laden</b>\n\nSie können auch Module während des Systemstarts laden, anstatt sie vorübergehend mit modprobe zu laden (die beim Neustart entladen werden). Ändern Sie einfach das <b>/etc/modprobe.d</b>-Verzeichnis und fügen Sie eine Konfigurationsdatei wie folgt hinzu:\n\n<pre>pete@icebox:~$ /etc/modprobe.d/peanutbutter.conf\n\nOptionen peanut_butter Typ=Mandel\n</pre>\n\nEin etwas ausgefallenes Beispiel, aber wenn Sie ein Modul namens peanut_butter haben und einen Kernelparameter für Typ=Mandel hinzufügen möchten, können Sie es mit dieser Konfigurationsdatei beim Start laden lassen. Beachten Sie auch, dass Kernel-Module ihre eigenen Kernelparameter haben, sodass Sie das Modul spezifisch lesen sollten, um mehr zu erfahren.\n\n<b>Nicht beim Booten laden</b>\n\nSie können auch sicherstellen, dass ein Modul beim Booten nicht geladen wird, indem Sie eine Konfigurationsdatei wie folgt hinzufügen:\n\n<pre>pete@icebox:~$ /etc/modprobe.d/peanutbutter.conf\n\nSchwarze Liste peanut_butter\n</pre>",
  "exercise": "Entladen Sie Ihr Bluetooth-Modul mit modprobe und sehen Sie, was passiert. Wie werden Sie das beheben?",
  "quizQuestion": "Welcher Befehl wird verwendet, um ein Modul zu entladen?",
  "quizAnswer": "modprobe -r",
  "slug": "kernelmodule"
}