{
  "id": 1,
  "title": "stdout (Standard Out)",
  "lessonContent": "Até agora, nos familiarizamos com muitos comandos e suas saídas e isso nos leva ao nosso próximo assunto E/S (entrada/saída). Vamos executar o seguinte comando e discutiremos como isso funciona. \n\n<pre>$ echo Olá Mundo > peanuts.txt</pre>\n\nO que acabou de acontecer? Bem, verifique o diretório onde você executou esse comando e eis que você deverá ver um arquivo chamado peanuts.txt, olhe dentro desse arquivo e você deverá ver o texto Olá Mundo. Muitas coisas aconteceram em um único comando, então vamos analisar. \n\nPrimeiro, vamos analisar a primeira parte: \n\n<pre>$ echo Olá Mundo</pre>\n\nSabemos que isso imprime Olá Mundo na tela, mas como? Os processos usam fluxos de E/S para receber entrada e retornar saída. Por padrão, o comando echo recebe a entrada (entrada padrão ou stdin) do teclado e retorna a saída (saída padrão ou stdout) para a tela. Por isso, quando você digita echo Olá Mundo no seu shell, você vê Olá Mundo na tela. No entanto, a redireção de E/S nos permite alterar esse comportamento padrão, oferecendo-nos maior flexibilidade de arquivo. \n\nVamos para a próxima parte do comando: \n\n<pre> > </pre>\n\nO > é um operador de redirecionamento que nos permite alterar para onde vai a saída padrão. Ele nos permite enviar a saída do echo Olá Mundo para um arquivo em vez da tela. Se o arquivo ainda não existir, ele será criado para nós. No entanto, se ele já existir, será sobrescrito (você pode adicionar uma flag de shell para evitar isso, dependendo do shell que estiver usando).\n\nE basicamente é assim que a redireção de stdout funciona!\n\nBem, digamos que eu não queira sobrescrever meu peanuts.txt, felizmente existe um operador de redirecionamento para isso também, >>: \n\n<pre>$ echo Olá Mundo >> peanuts.txt</pre>\n\nIsso irá anexar Olá Mundo ao final do arquivo peanuts.txt, se o arquivo ainda não existir, ele será criado para nós, assim como fez com o operador de redirecionamento >!",
  "exercise": "Tente alguns comandos: \n\n<pre>\n$ ls -l /var/log > myoutput.txt\n$ echo Olá Mundo > rm\n$ > somefile.txt \n</pre>",
  "quizQuestion": "Qual operador de redirecionamento você usa para anexar a saída a um arquivo?",
  "quizAnswer": ">>",
  "slug": "stdoutstandardoutredirect"
}