{
  "id": 1,
  "title": "Dateifreigabe-Übersicht",
  "lessonContent": "Sie sind in der Regel nicht der einzige Computer in Ihrem Netzwerk, dies ist besonders der Fall, wenn Sie in einer kommerziellen Umgebung arbeiten. Wenn wir Daten von einem Rechner auf einen anderen übertragen möchten, ist es manchmal einfacher, ein USB-Laufwerk anzuschließen und sie manuell zu kopieren. Aber in den meisten Fällen, wenn Sie mit Maschinen im selben Netzwerk arbeiten, erfolgt die Datenübertragung über die Netzwerkdateifreigabe. \n\nIn diesem Kurs werden wir ein paar verschiedene Methoden durchgehen, um Daten zwischen verschiedenen Maschinen in Ihrem Netzwerk zu kopieren. Wir werden einige einfache Dateikopien besprechen, dann werden wir darüber sprechen, wie man ganze Verzeichnisse auf Ihrem Rechner einbindet, die als separater Laufwerk fungieren. \n\nEin einfaches Dateifreigabe-Tool ist der <b>scp</b>-Befehl. Der scp-Befehl steht für sicheres Kopieren, er funktioniert genau wie der cp-Befehl, ermöglicht es Ihnen jedoch, von einem Host zu einem anderen Host im selben Netzwerk zu kopieren. Er funktioniert über ssh, sodass alle Ihre Aktionen die gleiche Authentifizierung und Sicherheit wie ssh verwenden. \n\n<b>Um eine Datei von einem lokalen Host auf einen Remote-Host zu kopieren</b>\n\n<pre>$ scp myfile.txt benutzername@remotehost.com:/remote/verzeichnis</pre>\n\n<b>Um eine Datei von einem Remote-Host auf Ihren lokalen Host zu kopieren</b>\n\n<pre>$ scp benutzername@remotehost.com:/remote/verzeichnis/myfile.txt /lokales/verzeichnis</pre>\n\n<b>Um ein Verzeichnis von Ihrem lokalen Host auf einen Remote-Host zu kopieren</b>\n\n<pre>$ scp -r meinverzeichnis benutzername@remotehost.com:/remote/verzeichnis</pre>",
  "exercise": "Versuchen Sie, eine Datei mit scp von einem Rechner auf einen anderen zu kopieren.",
  "quizQuestion": "Welchen Befehl können Sie verwenden, um Dateien sicher von einem Host auf einen anderen zu kopieren?",
  "quizAnswer": "scp",
  "slug": "netzwerkdateifreigabe"
}