{
  "id": 5,
  "title": "Samba",
  "lessonContent": "In den Anfangstagen der Computertechnik wurde es notwendig, dass Windows-Maschinen Dateien mit Linux-Maschinen teilen konnten, daher wurde das Server Message Block (SMB)-Protokoll geboren. SMB wurde zum Teilen von Dateien zwischen Windows-Betriebssystemen (Mac hat auch Dateifreigabe mit SMB) verwendet und später in Form des Common Internet File System (CIFS)-Protokolls bereinigt und optimiert. \n\nSamba ist der Begriff für die Linux-Dienstprogramme, um mit CIFS unter Linux zu arbeiten. Neben der Dateifreigabe können auch Ressourcen wie Drucker freigegeben werden. \n\n<b>Erstellen Sie eine Netzwerkfreigabe mit Samba</b>\n\nLassen Sie uns die grundlegenden Schritte durchgehen, um eine Netzwerkfreigabe zu erstellen, auf die eine Windows-Maschine zugreifen kann:\n\n<b>Installieren Sie Samba</b>\n\n<pre>$ sudo apt update\n$ sudo apt install samba</pre>\n\n<b>Setup smb.conf</b>\n\nDie Konfigurationsdatei für Samba befindet sich unter /etc/samba/smb.conf. Diese Datei sollte dem System mitteilen, welche Verzeichnisse freigegeben werden sollen, ihre Zugriffsberechtigungen und weitere Optionen. Die Standard smb.conf enthält bereits viele auskommentierte Codes, die Sie als Beispiel für Ihre eigenen Konfigurationen verwenden können.\n\n<pre>$ sudo vi /etc/samba/smb.conf</pre>\n\n<b>Ein Passwort für Samba einrichten</b>\n\n<pre>$ sudo smbpasswd -a [Benutzername]</pre>\n\n<b>Erstellen Sie ein freigegebenes Verzeichnis</b>\n\n<pre>$ mkdir /mein/verzeichnis/zum/teilen</pre>\n\n<b>Starten Sie den Samba-Dienst neu</b>\n\n<pre>$ sudo service smbd restart</pre>\n\n<b>Zugriff auf eine Samba-Freigabe über Windows</b>\n\nIn Windows geben Sie einfach die Netzwerkverbindung im Ausführen-Prompt ein: \\\\HOST\\freigabename.\n\n<b>Zugriff auf eine Samba/Windows-Freigabe über Linux</b>\n\n<pre>$ smbclient //HOST/verzeichnis -U benutzer</pre>\n\nDas Samba-Paket enthält ein Befehlszeilentool namens <b>smbclient</b>, das Sie verwenden können, um auf jeden Windows- oder Samba-Server zuzugreifen. Sobald Sie mit der Freigabe verbunden sind, können Sie Dateien durchsuchen und übertragen.\n\n<b>Binden Sie eine Samba-Freigabe an Ihr System an</b>\n\nAnstatt Dateien einzeln zu übertragen, können Sie die Netzwerkfreigabe einfach auf Ihrem System einbinden.\n\n<pre>$ sudo mount -t cifs servername:verzeichnis mountpunkt -o benutzer=benutzername,passwort=passwort</pre>",
  "exercise": "Richten Sie eine Samba-Freigabe ein, wenn Sie noch keine haben, öffnen Sie smb.conf und machen Sie sich mit den Optionen in der Konfigurationsdatei vertraut.",
  "quizQuestion": "Was ist das neueste Protokoll, das für den Dateitransfer zwischen Windows und Linux verwendet wird?",
  "quizAnswer": "CIFS",
  "slug": "samba"
}