{
  "id": 1,
  "title": "Network Interfaces",
  "lessonContent": "A network interface is how the kernel links up the software side of networking to the hardware side. We've already seen an example of this: \n\n<pre>\npete@icebox:~$ ifconfig -a\neth0      Link encap:Ethernet  HWaddr 1d:3a:32:24:4d:ce  \n          inet addr:192.168.1.129  Bcast:192.168.1.255  Mask:255.255.255.0\n          inet6 addr: fd60::21c:29ff:fe63:5cdc/64 Scope:Link\n</pre>\n\n<b> The ifconfig command</b>\n\nThe <b>ifconfig</b> tool allows us to configure our network interfaces, if we don't have any network interfaces set up, the kernel's device drivers and the network won't know how to talk to each other. Ifconfig runs on bootup and configures our interfaces through config files, but we can also manually modify them. The output of ifconfig shows the interface name on the left side and the right side shows detailed information. You'll most commonly see interfaces named eth0 (first Ethernet card in the machine), wlan0 (wireless interface), lo (loopback interface). The loopback interface is used to represent your computer, it just loops you back to yourself. This is good for debugging or connecting to servers running locally. \n\nThe status of interfaces, can be up or down, as you can guess if you wanted to \"turn off\" an interface you can set it to go down. The fields you'll probably look at the most in the ifconfig output is the HWaddr (MAC address of the interface), inet address (IPv4 address) and inet6 (IPv6 address). Of course you can see that the subnet mask and broadcast address are there as well. You can also view interface information at /etc/network/interfaces.\n\n<b>To create an interface and bring it up</b>\n\n<pre>$ ifconfig eth0 192.168.2.1 netmask 255.255.255.0 up</pre>\n\nThis assigns an IP address and netmask to the eth0 interface and also turns it up.\n\n<b>To bring up or down an interface</b>\n\n<pre>\n$ ifup eth0\n$ ifdown eth0\n</pre>\n\n<b> The ip command </b>\n\nThe <b>ip</b> command also allows us to manipulate the networking stack of a system. Depending on the distribution you are using it may be the preferred method of manipulating your network settings. \n\nHere are some examples of its use:\n\n<b>To show interface information for all interfaces </b>\n<pre>\n$ ip link show\n</pre>\n\n<b>To show the statistics of an interface</b>\n<pre>\n$ ip -s link show eth0\n</pre>\n\n\n<b>To show ip addresses allocated to interfaces</b>\n<pre>\n$ ip address show\n</pre>\n\n<b>To bring interfaces up and down</b>\n<pre>\n$ ip link set eth0 up\n$ ip link set eth0 down\n</pre>\n\n<b>To add an IP address to an interface</b>\n<pre>\n$ ip address add 192.168.1.1/24 dev eth0\n</pre>",
  "exercise": "Try changing the state of your network interfaces to either up or down and observe what happens.\n\nCan you change your network interface's with both the ifconfig and ip commands ?",
  "quizQuestion": "What is the command to configure our network interfaces?",
  "quizAnswer": "ifconfig",
  "slug": "networkinterfaces"
}
