{
  "id": 1,
  "title": "Tracking processes: top",
  "lessonContent": "In this course, we'll go over how to read and analyze the resource utilization on your system, this lesson shows some great tools to use when you need to track what a process is doing. \n\n<b>top</b>\n\nWe've discussed top before, but we're going to dig into the specifics of what it's actually displaying. Remember top is the tool we used to get a real time view of the system utilization by our processes:\n\n<pre>\ntop - 18:06:26 up 6 days,  4:07,  2 users,  load average: 0.92, 0.62, 0.59\nTasks: 389 total,   1 running, 387 sleeping,   0 stopped,   1 zombie\n%Cpu(s):  1.8 us,  0.4 sy,  0.0 ni, 97.6 id,  0.1 wa,  0.0 hi,  0.0 si,  0.0 st\nKiB Mem:  32870888 total, 27467976 used,  5402912 free,   518808 buffers\nKiB Swap: 33480700 total,    39892 used, 33440808 free. 19454152 cached Mem\n\n  PID USER      PR  NI    VIRT    RES    SHR S  %CPU %MEM     TIME+ COMMAND                             \n 6675 patty    20   0 1731472 520960  30876 S   8.3  1.6 160:24.79 chrome                             \n 6926 patty    20   0  935888 163456  25576 S   4.3  0.5   5:28.13 chrome \n</pre>\n\nLet's go over what this output means, you don't have to memorize this, but come back to this when you need a reference.\n\n<b>1st line: This is the same information you would see if you ran the uptime command (more to come)</b>\n\nThe fields are from left to right:\n<ol>\n<li>Current time</li>\n<li>How long the system has been running</li>\n<li>How many users are currently logged on</li>\n<li>System load average (more to come)</li>\n</ol>\n\n<b>2nd line: Tasks that are running, sleeping, stopped and zombied</b>\n\n<b>3rd line: Cpu information</b>\n\n<ol>\n<li>us: user CPU time - Percentage of CPU time spent running users’ processes that aren’t niced.</li>\n<li>sy: system CPU time - Percentage of CPU time spent running the kernel and kernel processes</li>\n<li>ni: nice CPU time - Percentage of CPU time spent running niced processes</li>\n<li>id: CPU idle time - Percentage of CPU time that is spent idle</li>\n<li>wa: I/O wait - Percentage of CPU time that is spent waiting for I/O. If this value is low, the problem probably isn’t disk or network I/O</li> \n<li>hi: hardware interrupts - Percentage of CPU time spent serving hardware interrupts</li>\n<li>si: software interrupts - Percentage of CPU time spent serving software interrupts</li>\n<li>st: steal time - If you are running virtual machines, this is the percentage of CPU time that was stolen from you for other tasks</li>\n</ol>\n\n<b>4th and 5th line: Memory Usage and Swap Usage</b>\n\n<b>Processes List that are Currently in Use</b>\n\n<ol>\n<li>PID: Id of the process</li>\n<li>USER: user that is the owner of the process</li>\n<li>PR: Priority of process</li>\n<li>NI: The nice value</li>\n<li>VIRT: Virtual memory used by the process</li>\n<li>RES: Physical memory used from the process</li>\n<li>SHR: Shared memory of the process</li>\n<li>S: Indicates the status of the process: S=sleep, R=running, Z=zombie,D=uninterruptible,T=stopped</li>\n<li>%CPU - this is the percent of CPU used by this process</li>\n<li>%MEM - percentage of RAM used by this process</li>\n<li>TIME+ - total time of activity of this process</li>\n<li>COMMAND - name of the process</li>\n</ol>\n\nYou can also specify a process ID if you just want to track certain processes:\n\n<pre>$ top -p 1</pre>",
  "exercise": "Play around with the top command and see what processes are using the most resources.",
  "quizQuestion": "What command displays the same output as the first line in top?",
  "quizAnswer": "uptime",
  "slug": "trackingprocessestop"
}
