{
  "id": 2,
  "title": "Berechtigungen ändern",
  "lessonContent": "Das Ändern von Berechtigungen kann leicht mit dem <b>chmod</b>-Befehl durchgeführt werden. \n\nZuerst wählen Sie aus, welches Berechtigungsset Sie ändern möchten: Benutzer, Gruppe oder Andere. Sie können Berechtigungen hinzufügen oder entfernen mit einem <b>+</b> oder <b>-</b>, schauen wir uns einige Beispiele an.\n\n<b>Hinzufügen eines Berechtigungsbits auf einer Datei</b>\n<pre>$ chmod u+x meineDatei</pre>\n\nDer obige Befehl liest sich wie folgt: Ändere die Berechtigung auf meineDatei, indem du das ausführbare Berechtigungsbit im Benutzerset hinzufügst. Jetzt hat der Benutzer also Ausführungsberechtigung für diese Datei!\n\n<b>Entfernen eines Berechtigungsbits auf einer Datei</b>\n<pre>$ chmod u-x meineDatei</pre>\n\n<b>Hinzufügen mehrerer Berechtigungsbits auf einer Datei</b>\n<pre>$ chmod ug+w</pre>\n\nEs gibt eine andere Möglichkeit, Berechtigungen im numerischen Format zu ändern. Diese Methode ermöglicht es Ihnen, Berechtigungen auf einmal zu ändern. Anstatt r, w oder x zu verwenden, um Berechtigungen darzustellen, verwenden Sie eine numerische Darstellung für ein einzelnes Berechtigungsset. Sie müssen also nicht die Gruppe mit g oder den Benutzer mit u angeben.\n\nDie numerischen Darstellungen sind wie folgt:\n\n<ul>\n<li>4: Leseberechtigung</li>\n<li>2: Schreibberechtigung</li>\n<li>1: Ausführungsberechtigung</li>\n</ul>\n\nSchauen wir uns ein Beispiel an: \n\n<pre>$ chmod 755 meineDatei</pre>\n\nKönnen Sie erraten, welche Berechtigungen wir dieser Datei geben? Lassen Sie uns das aufschlüsseln, also deckt 755 jetzt die Berechtigungen für alle Sets ab. Die erste Zahl (7) repräsentiert Benutzerberechtigungen, die zweite Zahl (5) repräsentiert Gruppenberechtigungen und die letzte 5 repräsentiert Berechtigungen für Andere. \n\nMoment mal, 7 und 5 wurden oben nicht aufgeführt, woher stammen diese Zahlen? Denken Sie daran, dass wir jetzt alle Berechtigungen zu einer Zahl kombinieren, also müssen Sie etwas Mathematik einbeziehen.\n\n7 = 4 + 2 + 1, also hat 7 die Benutzerberechtigungen und es hat Lese-, Schreib- und Ausführungsberechtigungen\n\n5 = 4 + 1, die Gruppe hat Lese- und Ausführungsberechtigungen\n\n5 = 4 + 1, und alle anderen Benutzer haben Lese- und Ausführungsberechtigungen\n\nEine Sache ist zu beachten: Es ist keine gute Idee, Berechtigungen willkürlich zu ändern, Sie könnten potenziell eine sensible Datei für jeden zur Änderung freigeben. Viele Male möchten Sie jedoch berechtigterweise Berechtigungen ändern, seien Sie einfach vorsichtig bei der Verwendung des chmod-Befehls.",
  "exercise": "Ändern Sie die Berechtigungen einer einfachen Textdatei und sehen Sie, wie sich die Bits ändern, wenn Sie ein ls -l ausführen.",
  "quizQuestion": "Welche Zahl repräsentiert die Leseberechtigung im numerischen Format?",
  "quizAnswer": "4",
  "slug": "berechtigungenändern"
}