{
  "id": 5,
  "title": "Setuid",
  "lessonContent": "Es gibt viele Fälle, in denen normale Benutzer erhöhten Zugriff benötigen, um Aufgaben auszuführen. Der Systemadministrator kann nicht immer da sein, um jedes Mal ein Root-Passwort einzugeben, wenn ein Benutzer Zugriff auf eine geschützte Datei benötigt. Deshalb gibt es spezielle Dateiberechtigungsbits, die dieses Verhalten ermöglichen. Das Set User ID (SUID) ermöglicht einem Benutzer, ein Programm als Besitzer der Programmdatei auszuführen, anstatt als sich selbst.\n\nSchauen wir uns ein Beispiel an: \n\nAngenommen, ich möchte mein Passwort ändern, einfach, oder? Ich benutze einfach den passwd Befehl:\n\n<pre>$ passwd</pre>\n\nWas macht der passwd Befehl? Er modifiziert ein paar Dateien, aber am wichtigsten ist, dass er die /etc/shadow Datei modifiziert. Schauen wir uns diese Datei kurz an: \n\n<pre>$ ls -l /etc/shadow\n\n-rw-r----- 1 root shadow 1134 1. Dez 11:45 /etc/shadow\n</pre>\n\nMoment mal, diese Datei gehört root? Wie ist es möglich, dass wir eine Datei ändern können, die root gehört? \n\nSchauen wir uns ein anderes Berechtigungsset an, diesmal des von uns ausgeführten Befehls: \n\n<pre>$ ls -l /usr/bin/passwd\n\n-rwsr-xr-x 1 root root 47032 1. Dez 11:45 /usr/bin/passwd\n</pre>\n\nDu wirst hier ein neues Berechtigungsbit <b>s</b> bemerken. Dieses Berechtigungsbit ist das SUID, wenn eine Datei dieses Berechtigungsset hat, ermöglicht es den Benutzern, die das Programm gestartet haben, die Berechtigung des Dateibesitzers sowie die Ausführungsberechtigung zu erhalten, in diesem Fall root. Im Grunde genommen läuft der Benutzer, während er den passwd Befehl ausführt, als root.\n\nDeshalb können wir auf eine geschützte Datei wie /etc/shadow zugreifen, wenn wir den passwd Befehl ausführen. Wenn du dieses Bit entfernen würdest, würdest du feststellen, dass du /etc/shadow nicht ändern und daher dein Passwort nicht ändern kannst. \n\n<b>Ändern von SUID</b>\n\nWie bei regulären Berechtigungen gibt es zwei Möglichkeiten, SUID-Berechtigungen zu ändern. \n\n<i>Symbolischer Weg:</i>\n<pre>$ sudo chmod u+s myfile</pre>\n\n<i>Numerischer Weg:</i>\n<pre> sudo chmod 4755 myfile</pre>\n\nWie du sehen kannst, wird das SUID durch eine 4 dargestellt und vor das Berechtigungsset gestellt. Du kannst das SUID als Großbuchstaben <b>S</b> sehen, das bedeutet, dass es immer noch dasselbe tut, aber keine Ausführungsberechtigungen hat.",
  "exercise": "Schau dir die Berechtigungen für /etc/passwd im Detail an, fällt dir noch etwas auf? Dateien mit aktiviertem SUID sind auch leicht erkennbar.",
  "quizQuestion": "Welche Zahl repräsentiert das SUID?",
  "quizAnswer": "4",
  "slug": "setuidsetuserid"
}