{
  "id": 2,
  "title": "विशेषाधिकार स्तर",
  "lessonContent": "अगले कुछ पाठ बहुत सिद्धांतात्मक होते हैं, इसलिए यदि आप कुछ व्यावहारिक चीजें देख रहे हैं तो आप आगे बढ़ सकते हैं और बाद में वापस आ सकते हैं।\n\nहमारे पास उपयोगकर्ता स्थान और कर्नेल के लिए विभिन्न व्यवस्थापन परत हैं, इसलिए आप दोनों शक्तियों को एक ही परत में क्यों नहीं मिला सकते? अच्छा, इन दो परतों का अलग-अलग होने का एक बहुत अच्छा कारण है। वे दोनों विभिन्न मोड में काम करते हैं, कर्नेल कर्नेल मोड में काम करता है और उपयोगकर्ता स्थान उपयोगकर्ता मोड में काम करता है।\n\nकर्नेल मोड में, कर्नेल को हार्डवेयर तक पूरी पहुंच होती है, वह सब कुछ नियंत्रित करता है। उपयोगकर्ता स्थान मोड में, आपको पहुंचने की अनुमति दी जाती है एक बहुत ही छोटी सी मात्रा मेमोरी और सीपीयू की। मौजूदा, जब हम कुछ भी करना चाहते हैं जो हार्डवेयर से संबंधित होता है, अपनी डिस्क से डेटा पढ़ना, अपनी डिस्क पर डेटा लिखना, हमारी नेटवर्क को नियंत्रित करना, आदि, सब कुछ कर्नेल मोड में किया जाता है। यह क्यों आवश्यक है? कल्पना करें कि आपकी मशीन में स्पाईवेयर से संक्रमित हो गई है, आप चाहेंगे कि इसे आपके सिस्टम के हार्डवेयर का सीधा पहुंच होने की अनुमति न हो। यह आपके सभी डेटा, आपकी वेबकैम, आदि तक पहुंच सकता है और यह अच्छा नहीं है।\n\nये विभिन्न मोड को विशेषाधिकार स्तर कहा जाता है (जिन्हें आप प्राप्त करते हैं) और अक्सर सुरक्षा छलांगों के रूप में वर्णित किया जाता है। इस चित्र को आसान बनाने के लिए, चलो मान लेते हैं कि आपको पता चल गया है कि आपके स्थानीय क्लर्ब में ब्रिटनी स्पीयर्स है, उसे उसके ग्रुपीज, फिर उसके व्यक्तिगत बॉडीगार्ड्स, फिर क्लर्ब के बाहर के बाउंसर से संरक्षित किया गया है। आप उसका हस्ताक्षर प्राप्त करना चाहते हैं (क्योंकि क्यों नहीं?), लेकिन आप उस तक पहुंच नहीं सकते क्योंकि वह पूरी तरह से संरक्षित है। रिंग एक ही तरह से काम करते हैं, सबसे अंदरी रिंग सबसे अधिक विशेषाधिकार स्तर के साथ संबंधित है। एक x86 कंप्यूटर विन्यास में दो मुख्य स्तर या मोड होते हैं। रिंग #3 उपयोगकर्ता मोड एप्लिकेशन चलाता है, रिंग #0 कर्नेल चलाता है। रिंग #0 किसी भी सिस्टम निर्देश को क्रियान्वित कर सकता है और पूर्ण विश्वास दिया जाता है। तो अब जब हमें पता चल गया है कि वे विशेषाधिकार स्तर कैसे काम करते हैं, हम हार्डवेयर पर कुछ भी लिख सकते हैं कैसे? क्या हमेशा कर्नेल से भिन्न मोड में रहेंगे? \n\nउत्तर है सिस्टम कॉल के साथ, सिस्टम कॉल हमें कर्नेल मोड में एक विशेषाधिकृत निर्देश करने की अनुमति देते हैं और फिर उपयोगकर्ता मोड में वापस स्विच करने की।",
  "exercise": "इस पाठ के लिए कोई अभ्यास नहीं है।",
  "quizQuestion": "सबसे अधिक विशेषाधिकारों वाला रिंग नंबर क्या है?",
  "quizAnswer": "0",
  "slug": "कर्नेलविशेषाधिकारस्तर"
}