{
  "id": 6,
  "title": "कर्नेल मॉड्यूल्स",
  "lessonContent": "चलो मान लो कि मेरे पास एक शानदार गाड़ी है, मैंने इसमें काफी समय और पैसा लगाया है। मैंने इसमें एक स्पॉयलर, हिच, बाइक रैक और अन्य यादृच्छिक चीजें जोड़ी हैं। ये घटक वास्तव में गाड़ी के मूल कार्यक्षमता को बदलते नहीं हैं और मैं इन्हें बहुत आसानी से हटा और जोड़ सकता हूँ। कर्नेल कर्नेल मॉड्यूल के साथ एक ही अवधारणा का उपयोग करता है।\n\nकर्नेल अपने आप में एक एकटक प्रकार का सॉफ्टवेयर है, जब हम एक नए प्रकार के कीबोर्ड के लिए समर्थन जोड़ना चाहते हैं, हम इस कोड को सीधे कर्नेल कोड में नहीं लिखते। जैसे ही हम अपनी गाड़ी में बाइक रैक को मिलाने वाले नहीं होते (ठीक है, शायद कुछ लोग ऐसा करेंगे)। कर्नेल मॉड्यूल वह कोड के टुकड़े हैं जो मांग पर कर्नेल में लोड और अनलोड किए जा सकते हैं। ये हमें कर्नेल की कार्यक्षमता को बढ़ाने की अनुमति देते हैं बिना मूल कर्नेल कोड में जोड़ने के। हम भी मॉड्यूल जोड़ सकते हैं और सिस्टम को रिबूट करने की आवश्यकता नहीं है (अधिकांश मामलों में)।\n\n<b>वर्तमान मॉड्यूल की सूची देखें</b>\n\n<pre>$ lsmod</pre>\n\n<b>मॉड्यूल लोड करें</b>\n\n<pre>$ sudo modprobe bluetooth</pre>\n\nModprobe <b>/lib/modules/(कर्नेल संस्करण)/kernel/drivers</b> से मॉड्यूल को लोड करने का प्रयास करता है। कर्नेल मॉड्यूल की भी आवश्यकता हो सकती है, अगर वे पहले से लोड नहीं हैं तो modprobe हमारे मॉड्यूल आवश्यकताओं को लोड करता है।\n\n<b>मॉड्यूल हटाएं</b>\n\n<pre>$ sudo modprobe -r bluetooth</pre>\n\n<b>बूटअप पर लोड करें</b>\n\nआप सिस्टम बूट के दौरान भी मॉड्यूल लोड कर सकते हैं, अस्थायी रूप से modprobe के साथ उन्हें लोड करने के बजाय (जो जब आप पुनः आरंभ करेंगे तो अनलोड हो जाएगा)। बस <b>/etc/modprobe.d</b> निर्देशिका को संशोधित करें और इसमें एक विन्यास फ़ाइल जोड़ें जैसे:\n\n<pre>pete@icebox:~$ /etc/modprobe.d/peanutbutter.conf\n\noptions peanut_butter type=almond\n</pre>\n\nथोड़ा अजीब उदाहरण, लेकिन अगर आपके पास एक मॉड्यूल नामक peanut_butter है और आप type=almond के लिए एक कर्नेल पैरामीटर जोड़ना चाहते हैं, तो आप इस विन्यास फ़ाइल का उपयोग करके इसे स्टार्टअप पर लोड कर सकते हैं। यह भी ध्यान दें कि कर्नेल मॉड्यूल के अपने कर्नेल पैरामीटर होते हैं तो आपको अधिक जानने के लिए मॉड्यूल के बारे में विशेष रूप से पढ़ना चाहिए।\n\n<b>बूटअप पर लोड न करें</b>\n\nआप यह भी सुनिश्चित कर सकते हैं कि एक मॉड्यूल बूटअप पर लोड न हो जाए इस तरह की एक विन्यास फ़ाइल जोड़कर:\n\n<pre>pete@icebox:~$ /etc/modprobe.d/peanutbutter.conf\n\nblacklist peanut_butter\n</pre>",
  "exercise": "अपने ब्लूटूथ मॉड्यूल को modprobe के साथ अनलोड करें और देखें क्या होता है। इसे आप कैसे ठीक करेंगे?",
  "quizQuestion": "मॉड्यूल को अनलोड करने के लिए कौन सा कमांड प्रयोग किया जाता है?",
  "quizAnswer": "modprobe -r",
  "slug": "kernelmodules"
}