{
  "id": 11,
  "title": "Job Control",
  "lessonContent": "Let's say you're working on a single terminal window and you're running a command that is taking forever. You can't interact with the shell until it is complete, however we want to keep working on our machines, so we need that shell open. Fortunately we can control how our processes run with jobs: \n\n<b>Sending a job to the background</b>\n\nAppending an ampersand (&) to the command will run it in the background so you can still use your shell. Let's see an example:\n\n<pre>$ sleep 1000 &\n$ sleep 1001 &\n$ sleep 1002 &\n</pre>\n\n<b>View all background jobs</b>\n\nNow you can view the jobs you just sent to the background.\n\n<pre>$ jobs\n\n[1]    Running     sleep 1000 &\n[2]-   Running     sleep 1001 &\n[3]+   Running     sleep 1002 &\n\n</pre>\n\nThis will show you the job id in the first column, then the status and the command that was run. The <b>+</b> next to the job ID means that it is the most recent background job that started. The job with the <b>-</b> is the second most recent command.\n\n<b>Sending a job to the background on existing job</b>\n\nIf you already ran a job and want to send it to the background, you don't have to terminate it and start over again. First suspend the job with Ctrl-Z, then run the <b>bg</b> command to send it to the background.\n\n<pre>\npete@icebox ~ $ sleep 1003\n^Z\n[4]+    Stopped     sleep 1003\n\npete@icebox ~ $ bg\n[4]+    sleep 1003 &\n\npete@icebox ~ $ jobs\n\n[1]    Running     sleep 1000 &\n[2]    Running     sleep 1001 &\n[3]-   Running     sleep 1002 &\n[4]+   Running     sleep 1003 &\n</pre>\n\n<b>Moving a job from the background to the foreground</b>\n\nTo move a job out of the background just specify the job ID you want. If you run fg without any options, it will bring back the most recent background job (the job with the + sign next to it)\n\n<pre>$ fg %1</pre>\n\n<b>Kill background jobs</b>\n\nSimilar to moving jobs out of the background, you can use the same form to kill the processes by using their Job ID.\n\n<pre>kill %1</pre>",
  "exercise": "Move some jobs between the background and the foreground",
  "quizQuestion": "What command is used to list background jobs?",
  "quizAnswer": "jobs",
  "slug": "jobcontrol"
}
