{
  "id": 4,
  "title": "Мониторинг ЦП",
  "lessonContent": "Давайте рассмотрим полезную команду, <b>uptime</b>.\n\n<pre>\npete@icebox:~$ uptime\n 17:23:35 up 1 day,  5:59,  2 users,  load average: 0.00, 0.02, 0.05\n</pre>\n\nМы говорили о времени работы системы в первом уроке этого курса, но мы не обсуждали поле load average. Средние нагрузки - это хороший способ увидеть нагрузку ЦП на вашей системе. Эти числа представляют среднюю нагрузку ЦП за интервалы 1, 5 и 15 минут. Что я имею в виду под нагрузкой ЦП, нагрузка ЦП - это среднее количество процессов, ожидающих выполнения ЦП.\n\nПредставьте, что у вас одноядерный ЦП, думайте об этом ядре как о однополосной дороге. Если на фривее час пик, эта полоса будет очень занята, и трафик будет на 100% или нагрузка 1. Теперь трафик стал настолько плохим, что он заторяет фривей и делает обычные дороги занятыми вдвое большим количеством машин, мы можем сказать, что ваша нагрузка 200% или нагрузка 2. Теперь предположим, что немного разгрузится, и на полосе фривея останется только половина машин, мы можем сказать, что нагрузка полосы составляет 0,5. Когда трафика нет, и мы можем быстро добраться домой, нагрузка должна быть очень низкой, как в 2 часа ночи. Машины в этом случае - это процессы, и эти процессы просто ждут, чтобы съехать с фривея и добраться домой.\n\nПросто потому, что у вас средняя нагрузка 1, не означает, что ваш компьютер тащится. Большинство современных машин сегодня имеют несколько ядер. Если у вас процессор с четырьмя ядрами (4 ядра) и ваша средняя нагрузка 1, это действительно влияет только на 25% вашего ЦП. Представьте каждое ядро как полосу на дороге. Вы можете узнать количество ядер на вашей системе с помощью <b>cat /proc/cpuinfo</b>.\n\nПри наблюдении за средней нагрузкой, вы должны учитывать количество ядер, если вы обнаружите, что ваша машина всегда использует выше средней нагрузки, что-то может быть не так.",
  "exercise": "Проверьте среднюю нагрузку вашей системы и посмотрите, что происходит.",
  "quizQuestion": "Какую команду можно использовать, чтобы увидеть среднюю нагрузку?",
  "quizAnswer": "uptime",
  "slug": "cpumonitoring"
}