{
  "id": 5,
  "title": "Мониторинг ввода-вывода (I/O Monitoring)",
  "lessonContent": "Мы также можем отслеживать использование ЦП и использование диска с помощью удобного инструмента, известного как <b>iostat</b>\n\n<pre>\npete@icebox:~$ iostat\nLinux 3.13.0-39-lowlatency (icebox)     01/28/2016      _i686_  (1 CPU)\n\navg-cpu:  %user   %nice %system %iowait  %steal   %idle\n           0.13    0.03    0.50    0.01    0.00   99.33\n\nDevice:            tps    kB_read/s    kB_wrtn/s    kB_read    kB_wrtn\nsda               0.17         3.49         1.92     385106     212417\n</pre>\n\nПервая часть - информация о ЦП:\n\n<ul>\n<li>%user - Показывает процент использования ЦП при выполнении на уровне пользователя (приложение)</li>\n<li>%nice - Показывает процент использования ЦП при выполнении на уровне пользователя с приоритетом nice.</li>\n<li>%system - Показывает процент использования ЦП при выполнении на уровне системы (ядра).</li>\n<li>%iowait - Показывает процент времени, в течение которого ЦП или ЦП были бездействующими во время ожидания системы запроса ввода-вывода с диска.</li>\n<li>%steal - Показывает процент времени, проведенного в невольном ожидании виртуальным ЦП или ЦП, пока гипервизор обслуживал другой виртуальный процессор.</li>\n<li>%idle - Показывает процент времени, в течение которого ЦП или ЦП были бездействующими и система не имела ожидающего запроса ввода-вывода с диска.</li>\n</ul>\n\nВторая часть - использование диска:\n\n<ul>\n<li>tps - Указывает количество передач в секунду, которые были отправлены на устройство. Передача - это запрос ввода-вывода на устройство. Несколько логических запросов могут быть объединены в один запрос ввода-вывода на устройство. Размер передачи неопределен.</li>\n<li>kB_read/s - Указывает количество данных, прочитанных с устройства, выраженное в килобайтах в секунду.</li>\n<li>kB_wrtn/s - Указывает количество данных, записанных на устройство, выраженное в килобайтах в секунду.</li>\n<li>kB_read - Общее количество килобайт, прочитанных.</li>\n<li>kB_wrtn - Общее количество килобайт, записанных.</li>\n</ul>",
  "exercise": "Используйте iostat для просмотра использования диска.",
  "quizQuestion": "Какую команду можно использовать для просмотра использования ввода-вывода и ЦП?",
  "quizAnswer": "iostat",
  "slug": "iomonitoring"
}