{
  "id": 2,
  "title": "lsof и fuser",
  "lessonContent": "Предположим, вы подключили USB-накопитель и начали работать с некоторыми файлами, после завершения работы вы отключаете USB-устройство и получаете ошибку \"Устройство или ресурс занято\". Как узнать, какие файлы на USB-накопителе все еще используются? На самом деле есть два инструмента, которые вы можете использовать для этого: \n\n<b>lsof</b>\n\nПомните, что файлы - это не только текстовые файлы, изображения и т. д., это все на системе, диски, каналы, сетевые сокеты, устройства и т. д. Чтобы увидеть, что используется процессом, вы можете использовать команду lsof (сокращение от \"list open files\"), это покажет вам список всех открытых файлов и их ассоциированный процесс. \n\n<pre>\npete@icebox:~$ lsof .\nCOMMAND    PID  USER   FD   TYPE DEVICE SIZE/OFF NODE NAME\nlxsession 1491 pete  cwd    DIR    8,6     4096  131 .\nupdate-no 1796 pete  cwd    DIR    8,6     4096  131 .\nnm-applet 1804 pete  cwd    DIR    8,6     4096  131 .\nindicator 1809 pete  cwd    DIR    8,6     4096  131 .\nxterm     2205 pete  cwd    DIR    8,6     4096  131 .\nbash      2207 pete  cwd    DIR    8,6     4096  131 .\nlsof      5914 pete  cwd    DIR    8,6     4096  131 .\nlsof      5915 pete  cwd    DIR    8,6     4096  131 .\n</pre>\n\nТеперь я могу увидеть, какие процессы в данный момент удерживают устройство/файл открытым. В нашем примере с USB вы также можете завершить эти процессы, чтобы отключить этот надоедливый накопитель.\n\n<b>fuser</b>\n\nДругой способ отслеживания процесса - использовать команду fuser (сокращение от \"file user\"), это покажет вам информацию о процессе, который использует файл или пользователя файла. \n\n<pre>\npete@icebox:~$ fuser -v .\n                     USER        PID ACCESS COMMAND\n/home/pete:         pete  1491 ..c.. lxsession\n                     pete  1796 ..c.. update-notifier\n                     pete  1804 ..c.. nm-applet\n                     pete  1809 ..c.. indicator-power\n                     pete  2205 ..c.. xterm\n                     pete  2207 ..c.. bash\n</pre>\n\nМы можем увидеть, какие процессы в данный момент используют наш каталог /home/pete. Инструменты lsof и fuser очень похожи, ознакомьтесь с ними и попробуйте использовать их, когда вам нужно отследить файл или процесс.",
  "exercise": "Прочтите страницы руководства для lsof и fuser, там содержится много информации, которую мы не рассмотрели, что позволит вам иметь большую гибкость при использовании этих инструментов.",
  "quizQuestion": "Какая команда используется для отображения открытых файлов и информации о процессе?",
  "quizAnswer": "lsof",
  "slug": "отслеживаниепроцессовlsoffuser"
}