{
  "id": 3,
  "title": "Anatomie d'un disque",
  "lessonContent": "Les disques durs peuvent être subdivisés en partitions, créant essentiellement plusieurs périphériques de blocs. Pensez à des exemples tels que /dev/sda1 et /dev/sda2, /dev/sda est le disque entier, mais /dev/sda1 est la première partition sur ce disque. Les partitions sont extrêmement utiles pour séparer les données et si vous avez besoin d'un certain système de fichiers, vous pouvez facilement créer une partition au lieu de faire du disque entier un seul type de système de fichiers.\n\n<b>Table des partitions</b>\n\nChaque disque aura une table de partitions, cette table indique au système comment le disque est partitionné. Cette table vous indique où commencent et finissent les partitions, quelles partitions sont amorçables, quels secteurs du disque sont alloués à quelle partition, etc. Il existe deux principaux schémas de table de partitions utilisés, le Master Boot Record (MBR) et le GUID Partition Table (GPT).\n\n<b>Partition</b>\n\nLes disques sont composés de partitions qui nous aident à organiser nos données. Vous pouvez avoir plusieurs partitions sur un disque et elles ne peuvent pas se chevaucher. Si un espace n'est pas alloué à une partition, il est alors appelé espace libre. Les types de partitions dépendent de votre table de partitions. À l'intérieur d'une partition, vous pouvez avoir un système de fichiers ou dédier une partition à d'autres choses comme le swap (nous y reviendrons bientôt).\n\n<i>MBR</i>\n\n<ul>\n<li>Table de partition traditionnelle, était utilisée comme norme</li>\n<li>Peut avoir des partitions primaires, étendues et logiques</li>\n<li>Le MBR a une limite de quatre partitions primaires</li>\n<li>Des partitions supplémentaires peuvent être créées en transformant une partition primaire en partition étendue (il ne peut y avoir qu'une seule partition étendue sur un disque). Ensuite, à l'intérieur de la partition étendue, vous ajoutez des partitions logiques. Les partitions logiques sont utilisées comme n'importe quelle autre partition. Absurde, je sais.</li>\n<li>Prend en charge les disques jusqu'à 2 téraoctets</li>\n</ul>\n\n<i>GPT</i>\n\n<ul>\n<li>La table de partition GUID (GPT) devient la nouvelle norme pour le partitionnement des disques</li>\n<li>Ne possède qu'un seul type de partition et vous pouvez en créer beaucoup</li>\n<li>Chaque partition a un identifiant unique mondial (GUID)</li>\n<li>Utilisé principalement en conjonction avec le démarrage basé sur UEFI (nous verrons les détails dans un autre cours)</li>\n</ul>\n\n<b>Structure du système de fichiers</b>\n\nNous savons de notre leçon précédente qu'un système de fichiers est une collection organisée de fichiers et de répertoires. Dans sa forme la plus simple, il est composé d'une base de données pour gérer les fichiers et les fichiers eux-mêmes, cependant nous allons entrer dans un peu plus de détails.\n\n<ul>\n<li>Bloc de démarrage - Il est situé dans les premiers secteurs du système de fichiers, et il n'est pas vraiment utilisé par le système de fichiers. Il contient plutôt des informations utilisées pour démarrer le système d'exploitation. Seul un bloc de démarrage est nécessaire par le système d'exploitation. Si vous avez plusieurs partitions, elles auront des blocs de démarrage, mais beaucoup d'entre eux ne sont pas utilisés.</li>\n<li>Super bloc - Il s'agit d'un seul bloc qui vient après le bloc de démarrage, et il contient des informations sur le système de fichiers, telles que la taille de la table d'inodes, la taille des blocs logiques et la taille du système de fichiers.</li>\n<li>Table d'inodes - Pensez-y comme la base de données qui gère nos fichiers (nous avons une leçon entière sur les inodes, donc ne vous inquiétez pas). Chaque fichier ou répertoire a une entrée unique dans la table d'inodes et elle contient diverses informations sur le fichier.</li>\n<li>Blocs de données - Ce sont les données réelles des fichiers et des répertoires.</li>\n</ul>\n\nJetons un coup d'œil aux différentes tables de partitions. Ci-dessous se trouve un exemple de partition utilisant la table de partitionnement MBR (msdos). Vous pouvez voir les partitions primaires, étendues et logiques sur la machine.\n\n<pre>\npete@icebox:~$ sudo parted -l\nModèle: Seagate (scsi)\nDisque /dev/sda: 21.5Go\nTaille des secteurs (logique/physique): 512o/512o\nTable de partitions: msdos\n\nNuméro  Début   Fin     Taille   Type      Système de fichiers     Drapeaux\n 1      1049ko  6860Mo  6859Mo  primaire   ext4                    amorçable\n 2      6861Mo  21.5Go  14.6Go  étendue\n 5      6861Mo  7380Mo  519Mo   logique   linux-swap(v1)\n 6      7381Mo  21.5Go  14.1Go  logique   xfs\n</pre>\n\n\nCet exemple est GPT, utilisant simplement un identifiant unique pour les partitions.\n\n<pre>\nModèle: Clé USB (scsi)\nDisque /dev/sdb: 4041Mo\nTaille des secteurs (logique/physique): 512o/512o\nTable de partitions: gpt\n\nNuméro  Début   Fin     Taille     Système de fichiers  Nom        Drapeaux\n 1      17.4ko  1000Mo  1000Mo                  first\n 2      1000Mo  4040Mo  3040Mo                  second\n</pre>",
  "exercise": "Exécutez <b>parted -l</b> sur votre machine et évaluez vos résultats.",
  "quizQuestion": "Quel type de partition est utilisé pour créer plus de 4 partitions dans le schéma de partitionnement MBR ?",
  "quizAnswer": "étendue",
  "slug": "anatomiedundisque"
}