{
  "id": 4,
  "title": "Partitionnement de disque",
  "lessonContent": "Faisons des manipulations pratiques avec les systèmes de fichiers en travaillant sur le processus sur une clé USB. Si vous n'en avez pas, pas de soucis, vous pouvez quand même suivre ces prochaines leçons. \n\nTout d'abord, nous devrons partitionner notre disque. Il existe de nombreux outils disponibles pour cela : \n\n<ul>\n<li>fdisk - outil de partitionnement en ligne de commande de base, ne prend pas en charge GPT</li>\n<li>parted - c'est un outil en ligne de commande qui prend en charge le partitionnement MBR et GPT</li>\n<li>gparted - c'est la version graphique de parted</li>\n<li>gdisk - fdisk, mais ne prend en charge que GPT, pas MBR</li>\n</ul>\n\nUtilisons parted pour partitionner. Disons que je connecte le périphérique USB et que nous voyons que le nom du périphérique est /dev/sdb2. \n\n<b>Lancer parted</b>\n\n<pre>$ sudo parted</pre>\n\nVous serez entré dans l'outil parted, où vous pouvez exécuter des commandes pour partitionner votre périphérique. \n\n<b>Sélectionner le périphérique</b>\n\n<pre>sélectionner /dev/sdb2</pre>\n\nPour sélectionner le périphérique avec lequel vous travaillerez, sélectionnez-le par son nom de périphérique.\n\n<b>Afficher la table de partition actuelle</b>\n\n<pre>\n(parted) afficher                                                            \nModèle : Seagate (scsi)\nDisque /dev/sda : 21,5 Go\nTaille des secteurs (logique/physique) : 512 o/512 o\nTable de partitions : msdos\n\nNuméro  Début   Fin     Taille   Type      Système de fichiers     Drapeaux\n 1      1049ko  6860Mo  6859Mo  primaire   ext4            boot\n 2      6861Mo  21,5Go  14,6Go  étendue\n 5      6861Mo  7380Mo  519Mo   logique   linux-swap(v1)\n 6      7381Mo  21,5Go  14,1Go  logique   xfs\n</pre>\n\nIci, vous verrez les partitions disponibles sur le périphérique. Les points de <b>début</b> et de <b>fin</b> indiquent où les partitions occupent de l'espace sur le disque dur, vous voudrez trouver un bon emplacement de début et de fin pour vos partitions. \n\n<b>Partitionner le périphérique</b>\n\n<pre>mkpart primaire 123 4567</pre>\n\nChoisissez maintenant un point de départ et d'arrêt et créez la partition, vous devrez spécifier le type de partition en fonction de la table que vous avez utilisée. \n\n<b>Redimensionner une partition</b>\n\nVous pouvez également redimensionner une partition si vous n'avez plus d'espace. \n\n<pre>redimensionner 2 1245 3456</pre>\n\nSélectionnez le numéro de partition, puis les points de départ et d'arrêt où vous souhaitez le redimensionner. \n\nParted est un outil très puissant et vous devez être prudent lorsque vous partitionnez vos disques.",
  "exercise": "Partitionner une clé USB avec la moitié du disque en ext4 et l'autre moitié en espace libre.",
  "quizQuestion": "Quelle est la commande parted pour créer une partition?",
  "quizAnswer": "mkpart",
  "slug": "partitionnementdedisque"
}