{
  "id": 1,
  "title": "Hiérarchie du système de fichiers",
  "lessonContent": "À ce stade, vous êtes probablement bien familiarisé avec la structure des répertoires de votre système, sinon vous le serez bientôt. Les systèmes de fichiers peuvent varier en fonction de leur structure, mais pour la plupart, ils devraient se conformer à la norme de hiérarchie du système de fichiers. \n\nAllez-y et exécutez un <b>ls -l /</b> pour voir les répertoires répertoriés sous le répertoire racine, le vôtre peut être différent du mien, mais les répertoires devraient pour la plupart ressembler à ce qui suit :\n\n<ul>\n<li>/ - Le répertoire racine de toute la hiérarchie du système de fichiers, tout est niché sous ce répertoire.</li>\n<li>/bin - Programmes prêts à l'emploi essentiels (binaires), inclut les commandes les plus basiques telles que ls et cp.</li>\n<li>/boot - Contient les fichiers du chargeur de démarrage du noyau.</li>\n<li>/dev - Fichiers de périphériques.</li>\n<li>/etc - Répertoire de configuration système de base, ne devrait contenir que des fichiers de configuration et aucun binaire.</li>\n<li>/home - Répertoires personnels pour les utilisateurs, contient vos documents, fichiers, paramètres, etc.</li>\n<li>/lib - Contient des fichiers de bibliothèque que les binaires peuvent utiliser.</li>\n<li>/media - Utilisé comme point de montage pour les supports amovibles comme les clés USB.</li>\n<li>/mnt - Systèmes de fichiers temporairement montés.</li>\n<li>/opt - Paquets logiciels d'application optionnels.</li>\n<li>/proc - Informations sur les processus en cours d'exécution actuellement.</li>\n<li>/root - Le répertoire personnel de l'utilisateur root.</li>\n<li>/run - Informations sur le système en cours depuis le dernier démarrage.</li>\n<li>/sbin - Contient des binaires système essentiels, généralement exécutables uniquement par root.</li>\n<li>/srv - Données spécifiques au site qui sont servies par le système.</li>\n<li>/tmp - Stockage pour les fichiers temporaires.</li>\n<li>/usr - Malheureusement nommé, il ne contient le plus souvent pas de fichiers d'utilisateur au sens d'un dossier personnel. Cela est destiné aux logiciels et utilitaires installés par l'utilisateur, cependant cela ne signifie pas que vous ne pouvez pas ajouter de répertoires personnels à l'intérieur. À l'intérieur de ce répertoire se trouvent des sous-répertoires pour /usr/bin, /usr/local, etc.</li>\n<li>/var - Répertoire variable, il est utilisé pour les journaux système, le suivi des utilisateurs, les caches, etc. Fondamentalement, tout ce qui est sujet à des changements tout le temps.</li>\n</ul>",
  "exercise": "Regardez à l'intérieur de votre répertoire /usr, quel type d'informations y sont stockées ?",
  "quizQuestion": "Dans quel répertoire sont stockés les journaux ?",
  "quizAnswer": "/var",
  "slug": "hiérarchiedusystèmedefichiers"
}