{
  "id": 2,
  "title": "Types de systèmes de fichiers",
  "lessonContent": "Il existe de nombreuses implémentations de systèmes de fichiers disponibles. Certains sont plus rapides que d'autres, certains prennent en charge un stockage de capacité plus importante et d'autres ne fonctionnent que sur un stockage de capacité plus faible. Les différents systèmes de fichiers ont différentes façons d'organiser leurs données et nous allons détailler les types de systèmes de fichiers qui existent. Comme il existe de nombreuses implémentations différentes, les applications ont besoin d'une manière de gérer les différentes opérations. Il y a donc quelque chose appelé la couche d'abstraction du système de fichiers virtuel (VFS). C'est une couche entre les applications et les différents types de systèmes de fichiers, donc peu importe le système de fichiers que vous avez, vos applications pourront y travailler. \n\nVous pouvez avoir de nombreux systèmes de fichiers sur vos disques, en fonction de la façon dont ils sont partitionnés et nous passerons en revue cela dans une leçon à venir.\n\n<b>Journalisation</b>\n\nLa journalisation est activée par défaut sur la plupart des types de systèmes de fichiers, mais au cas où ce ne serait pas le cas, vous devriez savoir ce qu'elle fait. Disons que vous copiez un gros fichier et tout à coup vous perdez de l'électricité. Eh bien, si vous êtes sur un système de fichiers non journalisé, le fichier finirait corrompu et votre système de fichiers serait incohérent, puis lorsque vous redémarrez, votre système effectuerait une vérification du système de fichiers pour s'assurer que tout va bien. Cependant, les réparations pourraient prendre un certain temps en fonction de la taille de votre système de fichiers. \n\nMaintenant, si vous étiez sur un système journalisé, avant même que votre machine commence à copier le fichier, elle écrirait ce que vous allez faire dans un fichier journal (journal). Maintenant, lorsque vous copiez réellement le fichier, une fois qu'il est terminé, le journal marque cette tâche comme terminée. Le système de fichiers est toujours dans un état cohérent à cause de cela, il saura exactement où vous vous êtes arrêté si votre machine s'éteint brusquement. Cela réduit également le temps de démarrage car au lieu de vérifier l'intégralité du système de fichiers, il regarde simplement votre journal.\n\n<b>Types de systèmes de fichiers de bureau courants</b>\n\n<ul>\n<li>ext4 - Il s'agit de la version la plus récente des systèmes de fichiers natifs Linux. Il est compatible avec les anciennes versions ext2 et ext3. Il prend en charge les volumes de disque jusqu'à 1 exaoctet et les tailles de fichiers jusqu'à 16 téraoctets et bien plus encore. C'est le choix standard pour les systèmes de fichiers Linux.</li>\n<li>Btrfs - \"Better or Butter FS\", c'est un nouveau système de fichiers pour Linux qui est livré avec des instantanés, des sauvegardes progressives, une augmentation des performances et bien plus encore. Il est largement disponible, mais pas encore tout à fait stable et compatible.</li>\n<li>XFS - Système de fichiers de journalisation haute performance, idéal pour un système avec de gros fichiers comme un serveur multimédia.</li>\n<li>NTFS et FAT - Systèmes de fichiers Windows</li>\n<li>HFS+ - Système de fichiers Macintosh</li>\n</ul>\n\nConsultez quels systèmes de fichiers sont sur votre machine: \n\n<pre>\npete@icebox:~$ df -T\nFilesystem     Type     1K-blocks    Used Available Use% Mounted on\n/dev/sda1      ext4       6461592 2402708   3707604  40% /\nudev           devtmpfs    501356       4    501352   1% /dev\ntmpfs          tmpfs       102544    1068    101476   2% /run\n/dev/sda6      xfs       13752320  460112  13292208   4% /home\n</pre>\n\nLa commande <b>df</b> rapporte l'utilisation de l'espace disque du système de fichiers et d'autres détails sur votre disque, nous parlerons plus de cet outil plus tard.",
  "exercise": "Faites un peu de recherche en ligne sur les autres types de systèmes de fichiers : ReiserFS, ZFS, JFS et d'autres que vous pouvez trouver.",
  "quizQuestion": "Quel est le type de système de fichiers Linux courant ?",
  "quizAnswer": "ext4",
  "slug": "types-de-systemes-de-fichiers"
}