{
  "id": 11,
  "title": "Inodes",
  "lessonContent": "Souvenez-vous comment notre système de fichiers est composé de tous nos fichiers réels et d'une base de données qui gère ces fichiers ? La base de données est connue sous le nom de table d'inodes. \n\n<b>Qu'est-ce qu'un inode ?</b>\n\nUn inode (index node) est une entrée dans cette table et il y en a un pour chaque fichier. Il décrit tout sur le fichier, tel que :\n\n<ul>\n<li>Type de fichier - fichier régulier, répertoire, périphérique de caractères, etc.</li>\n<li>Propriétaire</li>\n<li>Groupe</li>\n<li>Autorisations d'accès</li>\n<li>Horodatages - mtime (heure de la dernière modification du fichier), ctime (heure de la dernière modification d'attribut), atime (heure du dernier accès)</li>\n<li>Nombre de liens durs vers le fichier</li>\n<li>Taille du fichier</li>\n<li>Nombre de blocs alloués au fichier</li>\n<li>Pointeurs vers les blocs de données du fichier - le plus important !</li>\n</ul>\n\nFondamentalement, les inodes stockent tout sur le fichier, sauf le nom de fichier et le fichier lui-même !\n\n<b>Quand les inodes sont-ils créés ?</b>\n\nLorsqu'un système de fichiers est créé, de l'espace pour les inodes est également alloué. Il existe des algorithmes qui interviennent pour déterminer combien d'espace inode vous avez besoin en fonction du volume du disque et plus encore. Vous avez probablement à un moment de votre vie vu des erreurs pour des problèmes d'espace disque insuffisant. Eh bien, la même chose peut se produire pour les inodes également (bien que moins courant), vous pouvez manquer d'inodes et donc être incapable de créer plus de fichiers. Rappelez-vous que le stockage des données dépend à la fois des données et de la base de données (inodes). \n\nPour voir combien d'inodes il reste sur votre système, utilisez la commande <b>df -i</b>\n\n<b>Informations sur les inodes</b>\n\nLes inodes sont identifiés par des numéros, lorsqu'un fichier est créé, il se voit attribuer un numéro d'inode, le numéro est attribué dans l'ordre séquentiel. Cependant, vous pouvez parfois remarquer que lorsque vous créez un nouveau fichier, il reçoit un numéro d'inode inférieur à d'autres, cela est dû au fait que une fois que des inodes sont supprimés, ils peuvent être réutilisés par d'autres fichiers. Pour voir les numéros d'inode, exécutez <b>ls -li</b>:\n\n<pre>\npete@icebox:~$ ls -li\n140 drwxr-xr-x 2 pete pete 6 janv. 20 20:13 Bureau\n141 drwxr-xr-x 2 pete pete 6 janv. 20 20:01 Documents\n</pre>\n\nLe premier champ de cette commande liste le numéro d'inode.\n\nVous pouvez également voir des informations détaillées sur un fichier avec stat, cela vous donne des informations sur l'inode également.\n\n<pre>\npete@icebox:~$ stat ~/Bureau/\n  Fichier : ‘/home/pete/Bureau/’\n  Taille : 6               Blocs : 0          Bloc d'E/S : 4096   répertoire\nPériphérique : 806h/2054d      Inode : 140         Liens : 2\nAccès : (0755/drwxr-xr-x)  Uid : ( 1000/   pete)   Gid : ( 1000/   pete)\nAccès : 2016-01-20 20:13:50.647435982 -0800\nModif. : 2016-01-20 20:13:06.191675843 -0800\nChangement : 2016-01-20 20:13:06.191675843 -0800\n Création : -\n</pre>\n\n\n<b>Comment les inodes localisent-ils les fichiers ?</b>\n\nNous savons que nos données sont quelque part sur le disque, malheureusement elles n'ont probablement pas été stockées de manière séquentielle, nous devons donc utiliser des inodes. Les inodes pointent vers les blocs de données réels de vos fichiers. Dans un système de fichiers typique (tous ne fonctionnent pas de la même manière), chaque inode contient 15 pointeurs, les 12 premiers pointeurs pointent directement vers les blocs de données. Le 13e pointeur pointe vers un bloc contenant des pointeurs vers d'autres blocs, le 14e pointeur pointe vers un autre bloc imbriqué de pointeurs, et le 15e pointeur pointe encore une fois vers un autre bloc de pointeurs ! Confus, je sais ! La raison pour laquelle cela est fait de cette manière est de maintenir la structure de l'inode identique pour chaque inode, mais de pouvoir référencer des fichiers de tailles différentes. Si vous aviez un petit fichier, vous pourriez le trouver plus rapidement avec les 12 premiers pointeurs directs, les fichiers plus grands peuvent être trouvés avec les nids de pointeurs. De toute façon, la structure de l'inode est la même.",
  "exercise": "Observer quelques numéros d'inode pour différents fichiers, lesquels sont généralement créés en premier ?",
  "quizQuestion": "Comment voir combien d'inodes il reste sur votre système ?",
  "quizAnswer": "df -i",
  "slug": "inodes"
}