{
  "id": 6,
  "title": "monter et démonter",
  "lessonContent": "Avant de pouvoir afficher le contenu de votre système de fichiers, vous devrez le monter. Pour cela, j'aurai besoin de l'emplacement du périphérique, du type de système de fichiers et d'un point de montage, le point de montage est un répertoire sur le système où le système de fichiers va être attaché. Donc, nous voulons essentiellement monter notre périphérique sur un point de montage. \n\nCréez d'abord le point de montage, dans notre cas <b>mkdir /mydrive</b>\n\n<pre>$ sudo mount -t ext4 /dev/sdb2 /mydrive</pre>\n\nAussi simple que cela ! Maintenant, lorsque nous allons dans /mydrive, nous pouvons voir le contenu de notre système de fichiers, le <b>-t</b> spécifie le type de système de fichiers, puis nous avons l'emplacement du périphérique, puis le point de montage. \n\nPour démonter un périphérique d'un point de montage : \n\n<pre>$ sudo umount /mydrive \nou \n$ sudo umount /dev/sdb2</pre>\n\nRappelez-vous que le noyau nomme les périphériques dans l'ordre où il les trouve. Que se passe-t-il si le nom de notre périphérique change pour une raison quelconque après l'avoir monté ? Eh bien, heureusement, vous pouvez utiliser l'identifiant unique universel (UUID) d'un périphérique à la place d'un nom.\n\nPour voir les UUID sur votre système pour les périphériques de bloc :\n\n<pre>\npete@icebox:~$ sudo blkid\n/dev/sda1: UUID=\"130b882f-7d79-436d-a096-1e594c92bb76\" TYPE=\"ext4\" \n/dev/sda5: UUID=\"22c3d34b-467e-467c-b44d-f03803c2c526\" TYPE=\"swap\" \n/dev/sda6: UUID=\"78d203a0-7c18-49bd-9e07-54f44cdb5726\" TYPE=\"xfs\" \n</pre>\n\nNous pouvons voir les noms de nos périphériques, leurs types de systèmes de fichiers correspondants et leurs UUID. Maintenant, lorsque nous voulons monter quelque chose, nous pouvons utiliser :\n\n<pre>$ sudo mount UUID=130b882f-7d79-436d-a096-1e594c92bb76 /mydrive</pre>\n\nLa plupart du temps, vous n'aurez pas besoin de monter des périphériques via leurs UUID, il est beaucoup plus facile d'utiliser le nom du périphérique et souvent le système d'exploitation saura monter des périphériques courants comme les clés USB. Si vous devez monter automatiquement un système de fichiers au démarrage, par exemple si vous avez ajouté un disque dur secondaire, vous voudrez utiliser l'UUID et nous verrons cela dans la prochaine leçon.",
  "exercise": "Consultez la page de manuel pour mount et umount et voyez quelles autres options vous pouvez utiliser.",
  "quizQuestion": "Quelle commande est utilisée pour attacher un système de fichiers ?",
  "quizAnswer": "mount",
  "slug": "montagedémontagesystèmesdefichiers"
}