{
  "id": 12,
  "title": "liens symboliques",
  "lessonContent": "Utilisons un exemple précédent d'informations d'inode : \n\n<pre>\npete@icebox:~$ ls -li\n140 drwxr-xr-x 2 pete pete 6 Jan 20 20:13 Desktop\n141 drwxr-xr-x 2 pete pete 6 Jan 20 20:01 Documents\n</pre>\n\nVous avez peut-être remarqué que nous avons survolé le troisième champ dans la commande ls, ce champ est le compteur de liens. Le compteur de liens est le nombre total de liens physiques qu'un fichier possède, cela n'a pas de sens pour vous pour l'instant. Parlons donc d'abord des liens. \n\n<b>Liens symboliques</b>\n\nDans le système d'exploitation Windows, il existe des raccourcis, des raccourcis ne sont que des alias vers d'autres fichiers. Si vous faites quelque chose sur le fichier original, vous pourriez potentiellement casser le raccourci. Sous Linux, l'équivalent des raccourcis sont les liens symboliques (ou liens souples). Les liens symboliques nous permettent de lier à un autre fichier par son nom de fichier. Un autre type de liens trouvés sous Linux sont les liens physiques, ce sont en fait un autre fichier avec un lien vers un inode. Voyons ce que cela signifie en pratique en commençant par les liens symboliques.\n\n<pre>\npete@icebox:~/Desktop$ echo 'monfichier' > monfichier\npete@icebox:~/Desktop$ echo 'monfichier2' > monfichier2\npete@icebox:~/Desktop$ echo 'monfichier3' > monfichier3\n\npete@icebox:~/Desktop$ ln -s monfichier monfichierlien\npete@icebox:~/Desktop$ ls -li\ntotal 12\n  151 -rw-rw-r-- 1 pete pete 7 Jan 21 21:36 monfichier\n93401 -rw-rw-r-- 1 pete pete 8 Jan 21 21:36 monfichier2\n93402 -rw-rw-r-- 1 pete pete 8 Jan 21 21:36 monfichier3\n93403 lrwxrwxrwx 1 pete pete 6 Jan 21 21:39 monfichierlien -> monfichier\n</pre>\n\nVous pouvez voir que j'ai créé un lien symbolique nommé monfichierlien qui pointe vers monfichier. Les liens symboliques sont indiqués par ->. Remarquez comment j'ai obtenu un nouveau numéro d'inode, les liens symboliques ne sont que des fichiers qui pointent vers des noms de fichiers. Lorsque vous modifiez un lien symbolique, le fichier est également modifié. Les numéros d'inode sont uniques aux systèmes de fichiers, vous ne pouvez pas avoir deux fois le même numéro d'inode dans un seul système de fichiers, ce qui signifie que vous ne pouvez pas référencer un fichier dans un autre système de fichiers par son numéro d'inode. Cependant, si vous utilisez des liens symboliques, ils n'utilisent pas les numéros d'inode, ils utilisent les noms de fichiers, donc ils peuvent être référencés à travers différents systèmes de fichiers. \n\n<b>Liens physiques</b>\n\nVoyons un exemple de lien physique :\n\n<pre>\npete@icebox:~/Desktop$ ln monfichier2 monlienphysique\npete@icebox:~/Desktop$ ls -li\ntotal 16\n  151 -rw-rw-r-- 1 pete pete 7 Jan 21 21:36 monfichier\n93401 -rw-rw-r-- 2 pete pete 8 Jan 21 21:36 monfichier2\n93402 -rw-rw-r-- 1 pete pete 8 Jan 21 21:36 monfichier3\n93403 lrwxrwxrwx 1 pete pete 6 Jan 21 21:39 monfichierlien -> monfichier\n93401 -rw-rw-r-- 2 pete pete 8 Jan 21 21:36 monlienphysique\n</pre>\n\nUn lien physique crée simplement un autre fichier avec un lien vers le même inode. Ainsi, si je modifiais le contenu de monfichier2 ou de monlienphysique, le changement serait visible sur les deux, mais si je supprimais monfichier2, le fichier serait toujours accessible via monlienphysique. C'est là que notre compteur de liens dans la commande ls entre en jeu. Le compteur de liens est le nombre de liens physiques qu'un inode possède, lorsque vous supprimez un fichier, cela diminuera ce compteur de liens. L'inode n'est supprimé que lorsque tous les liens physiques vers l'inode ont été supprimés. Lorsque vous créez un fichier, son compteur de liens est de 1 car c'est le seul fichier qui pointe vers cet inode. Contrairement aux liens symboliques, les liens physiques ne s'étendent pas sur les systèmes de fichiers car les inodes sont uniques au système de fichiers. \n\n<b>Créer un lien symbolique</b>\n\n<pre>\n$ ln -s monfichier monlien</pre>\n\nPour créer un lien symbolique, vous utilisez la commande ln avec -s pour symbolique et vous spécifiez un fichier cible puis un nom de lien. \n\n<b>Créer un lien physique</b>\n\n<pre>\n$ ln unautrefichier unautrelien</pre>\n\nSimilaire à la création d'un lien symbolique, sauf que cette fois vous laissez de côté le -s.",
  "exercise": "Jouez avec la création de liens symboliques et de liens physiques, supprimez-en quelques-uns et voyez ce qui se passe.",
  "quizQuestion": "Quelle est la commande utilisée pour créer un lien symbolique?",
  "quizAnswer": "ln -s",
  "slug": "symlinks"
}