{
  "id": 3,
  "title": "Caminho de um Pacote",
  "lessonContent": "<b>Vamos ver como um pacote viaja dentro de sua rede local</b>\n\n<ol>\n<li>Primeiro, a máquina local irá comparar o endereço IP de destino para ver se está na mesma sub-rede, olhando para sua máscara de sub-rede.</li>\n<li>Quando os pacotes são enviados, eles precisam ter um endereço MAC de origem, endereço MAC de destino, endereço IP de origem e endereço IP de destino, neste ponto não sabemos o endereço MAC de destino.</li>\n<li>Para chegar ao host de destino, usamos ARP para transmitir uma solicitação na rede local para encontrar o endereço MAC do host de destino.</li>\n<li>Agora o pacote pode ser enviado com sucesso!</li>\n</ol>\n\n<b>Vamos ver como um pacote viaja fora de sua rede</b>\n\n<ol>\n<li>Primeiro, a máquina local irá comparar o endereço IP de destino, como está fora de nossa rede, não vê o endereço MAC do host de destino. E não podemos usar ARP porque a solicitação ARP é uma transmissão para hosts conectados localmente.</li>\n<li>Então nosso pacote agora olha para a tabela de roteamento, não conhece o endereço do IP de destino, então o envia para o gateway padrão (outro roteador). Agora nosso pacote contém nosso IP de origem, IP de destino e MAC de origem, porém não temos um MAC de destino. Lembre-se que os endereços MAC só são alcançados através da mesma rede. O que fazemos então? Enviamos uma solicitação ARP para obter o endereço MAC do gateway padrão.</li>\n<li>O roteador olha para o pacote e confirma o endereço MAC de destino, mas não é o endereço IP de destino final, então continua olhando para a tabela de roteamento para encaminhar o pacote para outro endereço IP que pode ajudar o pacote a seguir em direção ao seu destino. Sempre que o pacote se move, ele remove os antigos endereços MAC de origem e destino e atualiza o pacote com os novos endereços MAC de origem e destino.</li>\n<li>Uma vez que o pacote é encaminhado para a mesma rede, usamos ARP para encontrar o endereço MAC de destino final</li>\n<li>Ao longo desse processo, nosso pacote não altera o endereço IP de origem ou de destino.</li>\n</ol>",
  "exercise": "Sem exercícios para esta lição.",
  "quizQuestion": "Como encontramos o endereço MAC de um endereço IP?",
  "quizAnswer": "ARP",
  "slug": "caminhodeumpacote"
}