{
  "id": 1,
  "title": "O que é um roteador?",
  "lessonContent": "Já usamos o termo roteador antes, espero que saiba o que é, já que provavelmente tem um em casa. Um roteador permite que máquinas em uma rede se comuniquem entre si e com outras redes. Em um roteador típico, você terá portas LAN, que permitem que suas máquinas se conectem à mesma rede local, e também terá uma porta de uplink para a Internet que o conecta à Internet, às vezes você verá essa porta sendo rotulada como WAN, porque essencialmente está conectando você a uma rede mais ampla. Quando fazemos qualquer tipo de atividade de rede, ela precisa passar pelo roteador. O roteador decide para onde vão nossos pacotes de rede e quais entram. Ele roteia nossos pacotes entre várias redes para ir do host de origem ao host de destino. \n\n<b>Como um roteador funciona?</b>\n\nPense no roteamento da mesma forma que a entrega de correio, temos um endereço para o qual queremos enviar uma carta, quando a enviamos para o correio, eles pegam a carta e veem, oh, isso vai para a Califórnia, vou colocá-la no caminhão que vai para a Califórnia (sinceramente, não faço ideia de como funciona o sistema postal). A carta então é enviada para São Francisco, dentro de São Francisco existem diferentes códigos postais, e dentro desses códigos postais existem códigos de endereço menores, até que finalmente alguém consegue entregar sua carta no endereço desejado. Por outro lado, se você já mora em São Francisco e no mesmo código postal, o entregador de correio provavelmente saberá exatamente para onde a carta deve ir sem entregá-la a mais ninguém. \n\nQuando roteamos pacotes, eles usam \"rotas\" de endereço semelhantes, como para chegar à rede A, envie esses pacotes para a rede B. Quando não temos uma rota definida para isso, temos uma rota padrão que nossos pacotes usarão. Essas rotas são definidas em uma tabela de roteamento que nosso sistema usa para nos guiar entre redes.\n\n<b>Hops</b>\n\nÀ medida que os pacotes se movem entre redes, eles viajam em saltos, um salto é como medimos aproximadamente a distância que o pacote deve percorrer para ir da origem ao destino. Digamos que tenho dois roteadores conectando o host A ao host B, portanto, dizemos que existem dois saltos entre o host A e o host B. Cada salto é um dispositivo intermediário como os roteadores pelos quais devemos passar.\n\n<b>Compreendendo a diferença básica entre Comutação, Roteamento e Flood?</b>\nA COMUTAÇÃO de pacotes basicamente consiste em receber, processar e encaminhar dados para o dispositivo de destino.\nO ROTEAMENTO é um processo de criação da tabela de roteamento, para que possamos fazer a COMUTAÇÃO de forma mais eficiente.\nAntes do roteamento, era usado o FLOODING. Se um roteador não souber para onde enviar um pacote, então cada pacote recebido é enviado por cada link de saída, exceto aquele pelo qual chegou.",
  "exercise": "Não há exercícios para esta lição.",
  "quizQuestion": "Como os pacotes medem a distância?",
  "quizAnswer": "saltos",
  "slug": "oqueeoroteador"
}