{
  "id": 3,
  "title": "/etc/passwd",
  "lessonContent": "Denken Sie daran, dass Benutzernamen keine wirklichen Identifikationen für Benutzer sind. Das System verwendet eine Benutzer-ID (UID), um einen Benutzer zu identifizieren. Um herauszufinden, welche Benutzer welcher ID zugeordnet sind, schauen Sie sich die Datei /etc/passwd an. \n\n<pre>$ cat /etc/passwd</pre>\n\nDiese Datei zeigt Ihnen eine Liste von Benutzern und detaillierte Informationen über sie. Zum Beispiel sieht die erste Zeile in dieser Datei höchstwahrscheinlich so aus:\n\n<pre>root:x:0:0:root:/root:/bin/bash</pre>\n\nJede Zeile zeigt Benutzerinformationen für einen Benutzer an, am häufigsten sehen Sie den Benutzer root als erste Zeile. Es gibt viele durch Doppelpunkte getrennte Felder, die Ihnen zusätzliche Informationen über den Benutzer mitteilen, schauen wir sie uns alle an:\n\n<ol>\n<li>Benutzername</li>\n<li>Benutzerpasswort - das Passwort wird tatsächlich nicht in dieser Datei gespeichert, es wird normalerweise in der Datei /etc/shadow gespeichert. Wir werden im nächsten Lektionsteil mehr über /etc/shadow diskutieren, aber vorerst wissen Sie, dass sie verschlüsselte Benutzerpasswörter enthält. Sie sehen viele verschiedene Symbole in diesem Feld, wenn Sie ein \"x\" sehen, bedeutet das, dass das Passwort in der Datei /etc/shadow gespeichert ist, ein \"*\" bedeutet, dass der Benutzer keinen Anmeldezugriff hat, und wenn ein leeres Feld vorhanden ist, bedeutet das, dass der Benutzer kein Passwort hat.</li>\n<li>Die Benutzer-ID - wie Sie sehen, hat root die UID 0</li>\n<li>Die Gruppen-ID</li>\n<li>GECOS-Feld - Dies wird im Allgemeinen verwendet, um Kommentare über den Benutzer oder das Konto zu hinterlassen, wie z.B. ihren richtigen Namen oder Telefonnummer, es ist komma-getrennt.</li>\n<li>Benutzerverzeichnis</li>\n<li>Benutzer-Shell - Sie werden wahrscheinlich sehen, dass viele Benutzer standardmäßig bash als ihre Shell verwenden</li>\n</ol>\n\nNormalerweise würden Sie auf einer Benutzerseite nur menschliche Benutzer erwarten. Sie werden jedoch feststellen, dass /etc/passwd auch andere Benutzer enthält. Denken Sie daran, dass Benutzer wirklich nur auf dem System sind, um Prozesse mit unterschiedlichen Berechtigungen auszuführen. Manchmal möchten wir Prozesse mit vordefinierten Berechtigungen ausführen. Zum Beispiel wird der Benutzer daemon für Daemon-Prozesse verwendet.\n\nEs sollte auch beachtet werden, dass Sie die Datei /etc/passwd manuell bearbeiten können, wenn Sie Benutzer hinzufügen und Informationen mit dem <b>vipw</b>-Tool ändern möchten, jedoch sollten solche Dinge am besten den Tools überlassen werden, über die wir in einer späteren Lektion sprechen werden, wie z.B. useradd und userdel.",
  "exercise": "Schauen Sie sich Ihre /etc/passwd-Datei an, betrachten Sie einige der Benutzer und notieren Sie sich die Zugriffsrechte, die sie haben.",
  "quizQuestion": "Wie wird in /etc/passwd angezeigt, dass ein Benutzer keinen Anmeldezugriff hat?",
  "quizAnswer": "*",
  "slug": "etcpasswdfile"
}