{
  "id": 1,
  "title": "Benutzer und Gruppen",
  "lessonContent": "In jedem traditionellen Betriebssystem gibt es Benutzer und Gruppen. Sie existieren ausschließlich für den Zugriff und die Berechtigungen. Wenn ein Prozess ausgeführt wird, wird er als Besitzer dieses Prozesses ausgeführt, ob das nun Jane oder Bob ist. Der Dateizugriff und -besitz hängt ebenfalls von Berechtigungen ab. Sie möchten nicht, dass Jane die Dokumente von Bob sieht und umgekehrt. \n\nJeder Benutzer hat sein eigenes Home-Verzeichnis, in dem seine benutzerspezifischen Dateien gespeichert werden. Dies befindet sich normalerweise unter /home/benutzername, kann jedoch je nach Distribution variieren. \n\nDas System verwendet Benutzer-IDs (UID), um Benutzer zu verwalten. Benutzernamen sind die freundliche Art, Benutzer mit einer Identifikation zu verknüpfen, aber das System identifiziert Benutzer anhand ihrer UID. Das System verwendet auch Gruppen zur Verwaltung von Berechtigungen. Gruppen sind einfach Benutzersets mit Berechtigungen, die von dieser Gruppe festgelegt wurden. Sie werden vom System anhand ihrer Gruppen-ID (GID) identifiziert.\n\nIn Linux haben Sie Benutzer zusätzlich zu den normalen Benutzern, die das System verwenden. Manchmal handelt es sich bei diesen Benutzern um Systemdaemons, die kontinuierlich Prozesse ausführen, um das System am Laufen zu halten. Einer der wichtigsten Benutzer ist root oder Superuser. Root ist der mächtigste Benutzer im System. Root kann auf jede Datei zugreifen und jeden Prozess starten und beenden. Aus diesem Grund kann es gefährlich sein, immer als root zu arbeiten, da Sie potenziell wichtige Systemdateien entfernen könnten. Glücklicherweise kann, wenn Root-Zugriff erforderlich ist und ein Benutzer Root-Zugriff hat, ein Befehl als Root mit dem sudo-Befehl ausgeführt werden. Der sudo-Befehl (Superuser do) wird verwendet, um einen Befehl mit Root-Zugriff auszuführen. Wir werden später genauer darauf eingehen, wie ein Benutzer Root-Zugriff erhält.\n\nVersuchen Sie, eine geschützte Datei wie /etc/shadow anzuzeigen:\n\n<pre>$ cat /etc/shadow</pre>\n\nBeachten Sie, wie Sie einen Berechtigungsfehler erhalten. Sehen Sie sich die Berechtigungen an mit: \n\n<pre>$ ls -la /etc/shadow\n\n-rw-r----- 1 root shadow 1134 Dez 1 11:45 /etc/shadow\n</pre>\n\nWir sind noch nicht auf Berechtigungen eingegangen, aber was hier passiert, ist, dass Root der Besitzer der Datei ist und Sie Root-Zugriff benötigen oder Teil der Shadow-Gruppe sein müssen, um den Inhalt lesen zu können. Führen Sie nun den Befehl mit sudo aus:\n\n<pre>$ sudo cat /etc/shadow</pre>\n\nJetzt können Sie den Inhalt der Datei sehen!",
  "exercise": "Für diese Lektion sind keine Übungen vorhanden.",
  "quizQuestion": "Welchen Befehl verwenden Sie, um als Root auszuführen?",
  "quizAnswer": "sudo",
  "slug": "benutzerundgruppen"
}