{
  "id": 5,
  "title": "Samba",
  "lessonContent": "En los primeros días de la informática, se hizo necesario que las máquinas con Windows compartieran archivos con máquinas Linux, de ahí nació el protocolo Server Message Block (SMB). SMB se utilizaba para compartir archivos entre sistemas operativos Windows (Mac también tiene uso compartido de archivos con SMB) y luego se limpió y optimizó en forma del protocolo Common Internet File System (CIFS).\n\nSamba es como llamamos a las utilidades de Linux para trabajar con CIFS en Linux. Además de compartir archivos, también puedes compartir recursos como impresoras.\n\n<b>Crear un recurso compartido de red con Samba</b>\n\nVamos a través de los pasos básicos para crear un recurso compartido de red al que una máquina con Windows puede acceder:\n\n<b>Instalar Samba</b>\n\n<pre>$ sudo apt update\n$ sudo apt install samba</pre>\n\n<b>Configurar smb.conf</b>\n\nEl archivo de configuración para Samba se encuentra en /etc/samba/smb.conf, este archivo debe indicar al sistema qué directorios deben compartirse, sus permisos de acceso y más opciones. El smb.conf predeterminado ya viene con mucho código comentado y puedes usarlo como ejemplo para escribir tus propias configuraciones.\n\n<pre>$ sudo vi /etc/samba/smb.conf</pre>\n\n<b>Configurar una contraseña para Samba</b>\n\n<pre>$ sudo smbpasswd -a [nombre de usuario]</pre>\n\n<b>Crear un directorio compartido</b>\n\n<pre>$ mkdir /mi/directorio/para/compartir</pre>\n\n<b>Reiniciar el servicio de Samba</b>\n\n<pre>$ sudo service smbd restart</pre>\n\n<b>Acceder a un recurso compartido de Samba a través de Windows</b>\n\nEn Windows, simplemente escribe la conexión de red en el símbolo del sistema: \\\\HOST\\nombre_compartido.\n\n<b>Acceder a un recurso compartido de Samba/Windows a través de Linux</b>\n\n<pre>$ smbclient //HOST/directorio -U usuario</pre>\n\nEl paquete Samba incluye una herramienta de línea de comandos llamada <b>smbclient</b> que puedes usar para acceder a cualquier servidor Windows o Samba. Una vez que estés conectado al recurso compartido, puedes navegar y transferir archivos.\n\n<b>Adjuntar un recurso compartido de Samba a tu sistema</b>\n\nEn lugar de transferir archivos uno por uno, simplemente puedes montar el recurso compartido de red en tu sistema.\n\n<pre>$ sudo mount -t cifs nombre_servidor:directorio punto_montaje -o usuario=nombre_usuario,contraseña=contraseña</pre>",
  "exercise": "Configura un recurso compartido de Samba, si no tienes uno, abre smb.conf y familiarízate con las opciones en el archivo de configuración.",
  "quizQuestion": "¿Cuál es el último protocolo utilizado para la transferencia de archivos entre Windows y Linux?",
  "quizAnswer": "CIFS",
  "slug": "samba"
}