{
  "id": 11,
  "title": "Control de trabajos",
  "lessonContent": "Imaginemos que estás trabajando en una sola ventana de terminal y estás ejecutando un comando que está tardando una eternidad. No puedes interactuar con la terminal hasta que se complete, sin embargo, queremos seguir trabajando en nuestras máquinas, por lo que necesitamos mantener esa terminal abierta. Afortunadamente, podemos controlar cómo se ejecutan nuestros procesos con trabajos: \n\n<b>Enviando un trabajo al segundo plano</b>\n\nAñadir un ampersand (&) al comando lo ejecutará en segundo plano para que puedas seguir utilizando tu terminal. Veamos un ejemplo:\n\n<pre>$ sleep 1000 &\n$ sleep 1001 &\n$ sleep 1002 &\n</pre>\n\n<b>Ver todos los trabajos en segundo plano</b>\n\nAhora puedes ver los trabajos que acabas de enviar al segundo plano.\n\n<pre>$ jobs\n\n[1]    Ejecutando     sleep 1000 &\n[2]-   Ejecutando     sleep 1001 &\n[3]+   Ejecutando     sleep 1002 &\n\n</pre>\n\nEsto te mostrará el ID del trabajo en la primera columna, luego el estado y el comando que se ejecutó. El <b>+</b> junto al ID del trabajo significa que es el trabajo en segundo plano más reciente que se inició. El trabajo con el <b>-</b> es el segundo comando más reciente.\n\n<b>Enviando un trabajo al segundo plano en un trabajo existente</b>\n\nSi ya ejecutaste un trabajo y quieres enviarlo al segundo plano, no es necesario terminarlo y empezar de nuevo. Primero suspende el trabajo con Ctrl-Z, luego ejecuta el comando <b>bg</b> para enviarlo al segundo plano.\n\n<pre>\npete@icebox ~ $ sleep 1003\n^Z\n[4]+    Detenido     sleep 1003\n\npete@icebox ~ $ bg\n[4]+    sleep 1003 &\n\npete@icebox ~ $ jobs\n\n[1]    Ejecutando     sleep 1000 &\n[2]    Ejecutando     sleep 1001 &\n[3]-   Ejecutando     sleep 1002 &\n[4]+   Ejecutando     sleep 1003 &\n</pre>\n\n<b>Moviendo un trabajo del segundo plano al primer plano</b>\n\nPara sacar un trabajo del segundo plano, simplemente especifica el ID del trabajo que deseas. Si ejecutas fg sin opciones, traerá de vuelta el trabajo en segundo plano más reciente (el trabajo con el signo + junto a él)\n\n<pre>$ fg %1</pre>\n\n<b>Matar trabajos en segundo plano</b>\n\nSimilar a mover trabajos del segundo plano, puedes usar la misma forma para matar los procesos utilizando su ID de trabajo.\n\n<pre>kill %1</pre>",
  "exercise": "Mover algunos trabajos entre el segundo plano y el primer plano",
  "quizQuestion": "¿Qué comando se utiliza para listar los trabajos en segundo plano?",
  "quizAnswer": "jobs",
  "slug": "controltrabajos"
}