{
  "id": 1,
  "title": "ps (Procesos)",
  "lessonContent": "Los procesos son los programas que se están ejecutando en su máquina. Son gestionados por el kernel y cada proceso tiene asociado un ID llamado <b>Identificador de Proceso (PID).</b> Este PID se asigna en el orden en que se crean los procesos. \n\nAdelante y ejecute el comando ps para ver una lista de procesos en ejecución:\n\n<pre>$ ps\n\nPID        TTY     STAT   TIME          CMD\n41230    pts/4    Ss        00:00:00     bash\n51224    pts/4    R+        00:00:00     ps\n</pre>\n\nEsto le muestra una vista rápida de los procesos actuales:\n\n<ul>\n<li>PID: Identificador de Proceso</li>\n<li>TTY: Terminal de control asociado con el proceso (hablaremos en detalle sobre esto más adelante)</li>\n<li>STAT: Código de estado del proceso</li>\n<li>TIME: Tiempo total de uso de la CPU</li>\n<li>CMD: Nombre del ejecutable/comando</li>\n</ul>\n\nSi mira la página del manual para ps, verá que hay muchas opciones de comando que puede pasar, que variarán dependiendo de las opciones que desee utilizar: BSD, GNU o Unix. En mi opinión, el estilo BSD es más popular de usar, así que vamos a ir con eso. Si tiene curiosidad por la diferencia entre los estilos, es la cantidad de guiones que usa y las banderas.\n\n<pre>$ ps aux</pre>\n\nLa <b>a</b> muestra todos los procesos en ejecución, incluidos los que se están ejecutando por otros usuarios. La <b>u</b> muestra más detalles sobre los procesos. Y finalmente la <b>x</b> lista todos los procesos que no tienen un TTY asociado, estos programas mostrarán un ? en el campo TTY, son más comunes en procesos daemon que se inician como parte del inicio del sistema.\n\nNotará que ahora está viendo muchos más campos, no es necesario memorizarlos todos, en un curso posterior sobre procesos avanzados, repasaremos algunos de ellos de nuevo:\n\n<ul>\n<li>USUARIO: El usuario efectivo (el que cuyo acceso estamos utilizando)</li>\n<li>PID: Identificador de Proceso</li>\n<li>%CPU: Tiempo de CPU utilizado dividido por el tiempo que el proceso ha estado en ejecución</li>\n<li>%MEM: Relación del tamaño del conjunto residente del proceso con la memoria física de la máquina</li>\n<li>VSZ: Uso de memoria virtual de todo el proceso</li>\n<li>RSS: Tamaño del conjunto residente, la memoria física no intercambiada que una tarea ha utilizado</li>\n<li>TTY: Terminal de control asociado con el proceso</li>\n<li>STAT: Código de estado del proceso</li>\n<li>START: Hora de inicio del proceso</li>\n<li>TIME: Tiempo total de uso de la CPU</li>\n<li>COMANDO: Nombre del ejecutable/comando</li>\n</ul>\n\nEl comando ps puede ser un poco confuso de ver, por ahora los campos en los que nos centraremos más son PID, STAT y COMANDO. \n\nOtro comando muy útil es el comando <b>top</b>, top le proporciona información en tiempo real sobre los procesos en ejecución en su sistema en lugar de una instantánea. De forma predeterminada, obtendrá una actualización cada 10 segundos. Top es una herramienta extremadamente útil para ver qué procesos están consumiendo muchos de sus recursos. \n\n<pre>$ top</pre>",
  "exercise": "Utilice el comando ps con diferentes banderas y vea cómo cambia la salida.",
  "quizQuestion": "¿Qué bandera de ps se utiliza para ver información detallada sobre los procesos?",
  "quizAnswer": "u",
  "slug": "monitorarprocesoscomandops"
}