{
  "id": 8,
  "title": "amabilidad",
  "lessonContent": "Cuando ejecutas múltiples cosas en tu computadora, como quizás Chrome, Microsoft Word o Photoshop al mismo tiempo, puede parecer que estos procesos se están ejecutando al mismo tiempo, pero eso no es del todo cierto. \n\nLos procesos utilizan la CPU durante un pequeño período de tiempo llamado rebanada de tiempo. Luego se detienen durante milisegundos y otro proceso obtiene una pequeña rebanada de tiempo. Por defecto, la programación de procesos ocurre de esta manera en forma de round-robin. Cada proceso recibe suficientes rebanadas de tiempo hasta que haya terminado de procesar. El kernel maneja todos estos cambios de procesos y lo hace bastante bien la mayor parte del tiempo.\n\nLos procesos no pueden decidir cuándo y cuánto tiempo obtienen tiempo de CPU, si todos los procesos se comportaran normalmente, cada uno (aproximadamente) obtendría una cantidad igual de tiempo de CPU. Sin embargo, hay una forma de influir en el algoritmo de programación de procesos del kernel con un valor de amabilidad. Amabilidad es un nombre bastante extraño, pero lo que significa es que los procesos tienen un número para determinar su prioridad para la CPU. Un número alto significa que el proceso es amable y tiene una prioridad más baja para la CPU y un número bajo o negativo significa que el proceso no es muy amable y quiere obtener la mayor cantidad de la CPU posible. \n\n<pre>$ top</pre>\n\nPuedes ver una columna para NI en este momento, que es el nivel de amabilidad de un proceso.\n\nPara cambiar el nivel de amabilidad, puedes usar los comandos nice y renice:\n\n<pre>$ nice -n 5 apt upgrade</pre>\n\nEl comando nice se utiliza para establecer la prioridad para un nuevo proceso. El comando renice se utiliza para establecer la prioridad en un proceso existente. \n\n<pre>$ renice 10 -p 3245</pre>",
  "exercise": "¿Qué procesos no son muy amables y por qué?",
  "quizQuestion": "Si quiero que un proceso obtenga más prioridad de CPU, ¿debo usar un número nice más bajo o más alto?",
  "quizAnswer": "más bajo",
  "slug": "amabilidadproceso"
}