{
  "id": 5,
  "title": "Terminación de Procesos",
  "lessonContent": "Ahora que sabemos qué sucede cuando se crea un proceso, ¿qué ocurre cuando ya no lo necesitamos? Advertencia, a veces Linux puede volverse un poco oscuro...\n\nUn proceso puede finalizar utilizando la llamada al sistema _exit, esto liberará los recursos que el proceso estaba utilizando para su reasignación. Así que cuando un proceso está listo para terminar, le informa al kernel por qué está terminando con algo llamado un estado de terminación. Comúnmente, un estado de 0 significa que el proceso ha tenido éxito. Sin embargo, eso no es suficiente para terminar completamente un proceso. El proceso padre tiene que reconocer la terminación del proceso hijo utilizando la llamada al sistema wait y lo que hace es comprobar el estado de terminación del proceso hijo. Sé que es macabro pensar en ello, pero la llamada wait es una necesidad, después de todo, ¿qué padre no querría saber cómo murió su hijo?\n\nHay otra forma de terminar un proceso que implica el uso de señales, de las cuales hablaremos pronto.\n\n<b>Procesos Huérfanos</b>\n\nCuando un proceso padre muere antes que un proceso hijo, el kernel sabe que no va a recibir una llamada wait, por lo que convierte a estos procesos en \"huérfanos\" y los pone bajo el cuidado de init (recuerda, la madre de todos los procesos). Init eventualmente realizará la llamada al sistema wait para estos huérfanos para que puedan morir.\n\n<b>Procesos Zombis</b>\n\n¿Qué sucede cuando un proceso hijo termina y el proceso padre aún no ha llamado a wait? Aún queremos poder ver cómo terminó un proceso hijo, por lo que aunque el proceso hijo haya finalizado, el kernel convierte al proceso hijo en un proceso zombi. Los recursos que el proceso hijo utilizó aún se liberan para otros procesos, sin embargo, todavía hay una entrada en la tabla de procesos para este zombi. Los procesos zombis tampoco pueden ser eliminados, ya que técnicamente están \"muertos\", por lo que no se pueden utilizar señales para matarlos. Eventualmente, si el proceso padre llama a la llamada al sistema wait, el zombi desaparecerá, esto se conoce como \"recolección\". Si el padre no realiza una llamada wait, init adoptará al zombi y automáticamente realizará wait y eliminará al zombi. Puede ser malo tener demasiados procesos zombis, ya que ocupan espacio en la tabla de procesos, si se llena, impedirá que otros procesos se ejecuten.",
  "exercise": "No hay ejercicios para esta lección.",
  "quizQuestion": "¿Cuál es el estado de terminación más común para un proceso que tiene éxito?",
  "quizAnswer": "0",
  "slug": "terminacionprocesos"
}