{
  "id": 6,
  "title": "Señales",
  "lessonContent": "Una señal es una notificación a un proceso de que algo ha sucedido.\n\n<b>Por qué tenemos señales</b>\n\nSon interrupciones de software y tienen muchos usos:\n\n<ul>\n<li>Un usuario puede escribir uno de los caracteres especiales del terminal (Ctrl-C) o (Ctrl-Z) para matar, interrumpir o suspender procesos</li>\n<li>Pueden ocurrir problemas de hardware y el kernel quiere notificar al proceso</li>\n<li>Pueden ocurrir problemas de software y el kernel quiere notificar al proceso</li>\n<li>Básicamente son formas en que los procesos pueden comunicarse</li>\n</ul>\n\n<b>Proceso de señal</b>\n\nCuando una señal es generada por algún evento, luego se entrega a un proceso, se considera en un estado pendiente hasta que se entrega. Cuando se ejecuta el proceso, la señal será entregada. Sin embargo, los procesos tienen máscaras de señal y pueden bloquear la entrega de señales si se especifica. Cuando se entrega una señal, un proceso puede hacer una multitud de cosas: \n\n<ul>\n<li>Ignorar la señal</li>\n<li>\"Capturar\" la señal y realizar una rutina de manejo específica</li>\n<li>El proceso puede ser terminado, a diferencia de la llamada al sistema de salida normal</li>\n<li>Bloquear la señal, dependiendo de la máscara de señal</li>\n</ul>\n\n<b>Señales comunes</b>\n\nCada señal está definida por enteros con nombres simbólicos que están en forma de SIGxxx. Algunas de las señales más comunes son: \n\n<ul>\n<li>SIGHUP o HUP o 1: Desconexión</li>\n<li>SIGINT o INT o 2: Interrupción</li>\n<li>SIGKILL o KILL o 9: Matar</li>\n<li>SIGSEGV o SEGV o 11: Violación de segmento</li>\n<li>SIGTERM o TERM o 15: Terminación de software</li>\n<li>SIGSTOP o STOP: Detener</li>\n</ul>\n\nLos números pueden variar con las señales, por lo que generalmente se les hace referencia por sus nombres.\n\nAlgunas señales son inbloqueables, un ejemplo es la señal SIGKILL. La señal KILL destruye el proceso.",
  "exercise": "No hay ejercicios para esta lección.",
  "quizQuestion": "¿Qué señal es inbloqueable?",
  "quizAnswer": "SIGKILL",
  "slug": "señalesproceso"
}