{
  "id": 3,
  "title": "/etc/passwd",
  "lessonContent": "Rappelez-vous que les noms d'utilisateur ne sont pas vraiment des identifications pour les utilisateurs. Le système utilise un identifiant d'utilisateur (UID) pour identifier un utilisateur. Pour savoir quels utilisateurs sont associés à quel ID, regardez le fichier /etc/passwd. \n\n<pre>$ cat /etc/passwd</pre>\n\nCe fichier vous montre une liste d'utilisateurs et des informations détaillées à leur sujet. Par exemple, la première ligne de ce fichier ressemble probablement à ceci :\n\n<pre>root:x:0:0:root:/root:/bin/bash</pre>\n\nChaque ligne affiche les informations de l'utilisateur pour un utilisateur, le plus souvent vous verrez l'utilisateur root en première ligne. Il y a de nombreux champs séparés par des deux-points qui vous donnent des informations supplémentaires sur l'utilisateur, regardons-les tous :\n\n<ol>\n<li>Nom d'utilisateur</li>\n<li>Mot de passe de l'utilisateur - le mot de passe n'est pas vraiment stocké dans ce fichier, il est généralement stocké dans le fichier /etc/shadow. Nous en discuterons davantage dans la prochaine leçon sur /etc/shadow, mais pour l'instant, sachez qu'il contient des mots de passe d'utilisateurs cryptés. Vous pouvez voir de nombreux symboles différents dans ce champ, si vous voyez un \"x\" cela signifie que le mot de passe est stocké dans le fichier /etc/shadow, un \"*\" signifie que l'utilisateur n'a pas accès à la connexion et s'il y a un champ vide cela signifie que l'utilisateur n'a pas de mot de passe.</li>\n<li>L'identifiant de l'utilisateur - comme vous pouvez le voir, root a l'UID de 0</li>\n<li>L'identifiant du groupe</li>\n<li>Champ GECOS - Il est utilisé pour laisser généralement des commentaires sur l'utilisateur ou le compte tels que leur vrai nom ou numéro de téléphone, il est délimité par des virgules.</li>\n<li>Répertoire personnel de l'utilisateur</li>\n<li>Shell de l'utilisateur - vous verrez probablement beaucoup d'utilisateurs utilisant bash par défaut pour leur shell</li>\n</ol>\n\nNormalement, sur une page de configuration d'utilisateur, vous vous attendriez à voir uniquement des utilisateurs humains. Cependant, vous remarquerez que /etc/passwd contient d'autres utilisateurs. Rappelez-vous que les utilisateurs ne sont vraiment présents sur le système que pour exécuter des processus avec des autorisations différentes. Parfois, nous voulons exécuter des processus avec des autorisations prédéterminées. Par exemple, l'utilisateur daemon est utilisé pour les processus de démon.\n\nIl convient également de noter que vous pouvez éditer le fichier /etc/passwd manuellement si vous souhaitez ajouter des utilisateurs et modifier des informations avec l'outil <b>vipw</b>, cependant il est préférable de laisser de telles tâches aux outils que nous discuterons dans une leçon ultérieure tels que useradd et userdel.",
  "exercise": "Regardez votre fichier /etc/passwd, examinez certains des utilisateurs et notez les accès qu'ils ont.",
  "quizQuestion": "Si un utilisateur n'a pas accès à la connexion, comment cela est-il indiqué dans /etc/passwd ?",
  "quizAnswer": "*",
  "slug": "fichieretcpasswd"
}