{
  "id": 1,
  "title": "Utilisateurs et Groupes",
  "lessonContent": "Dans n'importe quel système d'exploitation traditionnel, il y a des utilisateurs et des groupes. Ils existent uniquement pour l'accès et les autorisations. Lors de l'exécution d'un processus, il s'exécutera en tant que propriétaire de ce processus, que ce soit Jane ou Bob. L'accès aux fichiers et la propriété dépendent également des autorisations. Vous ne voudriez pas que Jane voie les documents de Bob et vice versa. \n\nChaque utilisateur a son propre répertoire personnel où ses fichiers spécifiques à l'utilisateur sont stockés, cela se trouve généralement dans /home/nom_utilisateur, mais peut varier selon les distributions. \n\nLe système utilise des identifiants d'utilisateur (UID) pour gérer les utilisateurs, les noms d'utilisateur sont la manière conviviale d'associer les utilisateurs à une identification, mais le système identifie les utilisateurs par leur UID. Le système utilise également des groupes pour gérer les autorisations, les groupes ne sont que des ensembles d'utilisateurs avec des autorisations définies par ce groupe, ils sont identifiés par le système avec leur identifiant de groupe (GID).\n\nSous Linux, vous aurez des utilisateurs en plus des humains normaux qui utilisent le système. Parfois, ces utilisateurs sont des démons système qui exécutent continuellement des processus pour maintenir le bon fonctionnement du système. L'un des utilisateurs les plus importants est root ou superutilisateur, root est l'utilisateur le plus puissant du système, root peut accéder à n'importe quel fichier et démarrer et arrêter n'importe quel processus. Pour cette raison, il peut être dangereux d'opérer en tant que root tout le temps, vous pourriez potentiellement supprimer des fichiers critiques du système. Heureusement, si un accès root est nécessaire et qu'un utilisateur a un accès root, il peut exécuter une commande en tant que root avec la commande sudo. La commande sudo (superutilisateur faire) est utilisée pour exécuter une commande avec un accès root, nous approfondirons davantage sur la manière dont un utilisateur obtient un accès root dans une leçon ultérieure.\n\nAllez-y et essayez de visualiser un fichier protégé comme /etc/shadow:\n\n<pre>$ cat /etc/shadow</pre>\n\nRemarquez comment vous obtenez une erreur de permission refusée, regardez les autorisations avec: \n\n<pre>$ ls -la /etc/shadow\n\n-rw-r----- 1 root shadow 1134 Dec 1 11:45 /etc/shadow\n</pre>\n\nNous n'avons pas encore abordé les autorisations, mais ce qui se passe ici, c'est que root est le propriétaire du fichier et vous aurez besoin d'un accès root ou de faire partie du groupe shadow pour lire le contenu. Maintenant exécutez la commande avec sudo:\n\n<pre>$ sudo cat /etc/shadow</pre>\n\nMaintenant vous pourrez voir le contenu du fichier!",
  "exercise": "Aucun exercice pour cette leçon.",
  "quizQuestion": "Quelle commande utilisez-vous pour exécuter en tant que root?",
  "quizAnswer": "sudo",
  "slug": "utilisateursetgroupes"
}