{
  "id": 3,
  "title": "cd (Change Directory)",
  "lessonContent": "Agora que você sabe onde está, vamos ver se conseguimos nos mover um pouco pelo sistema de arquivos. Lembre-se de que precisaremos navegar usando caminhos. Existem duas maneiras diferentes de especificar um caminho, com caminhos absolutos e relativos. \n\n<ul>\n<li>Caminho absoluto: Este é o caminho a partir do diretório raiz. O diretório raiz é o chefe. O diretório raiz é comumente mostrado como uma barra. Toda vez que seu caminho começa com / significa que você está começando a partir do diretório raiz. Por exemplo, /home/pete/Desktop.</li>\n\n<li>Caminho relativo: Este é o caminho de onde você está atualmente no sistema de arquivos. Se eu estivesse na localização /home/pete/Documents e quisesse ir para um diretório dentro de Documents chamado taxes, não preciso especificar o caminho inteiro a partir da raiz como /home/pete/Documents/taxes, posso simplesmente ir para taxes/ em vez disso.</li>\n</ul>\n\nAgora que você sabe como os caminhos funcionam, precisamos de algo para nos ajudar a mudar para o diretório que queremos. Felizmente, temos cd ou \"change directory\" para fazer isso. \n\n<pre>$ cd /home/pete/Pictures</pre> \n\nAgora mudei minha localização de diretório para /home/pete/Pictures.\n\nAgora, a partir deste diretório, tenho uma pasta dentro chamada Hawaii, posso navegar para essa pasta com:\n\n<pre>$ cd Hawaii</pre>\n\nPerceba como eu apenas usei o nome da pasta? Isso porque eu já estava em /home/pete/Pictures.\n\nPode ser cansativo navegar com caminhos absolutos e relativos o tempo todo, felizmente existem alguns atalhos para ajudar você. \n\n<ul>\n<li>. (diretório atual). Este é o diretório em que você está atualmente. </li>\n<li>.. (diretório anterior). Leva você para o diretório acima do seu atual.</li>\n<li>~ (diretório home). Este diretório é o padrão para o seu \"diretório home\". Como /home/pete.</li>\n<li>- (diretório anterior). Isso o levará para o diretório anterior em que você estava.</li>\n</ul>\n\n<pre>$ cd .\n$ cd ..\n$ cd ~\n$ cd -\n</pre>\nExperimente!",
  "exercise": "<ol>\n<li>Execute o comando cd sem nenhuma flag, para onde ele te leva?</li>\n</ol>",
  "quizQuestion": "Se você estiver em /home/pete/Pictures e quiser ir para /home/pete, qual é um bom atalho para usar?",
  "quizAnswer": "cd ..",
  "slug": "changedirectorycdcommand"
}