{
  "id": 10,
  "title": "cp (Copiar)",
  "lessonContent": "Vamos começar a fazer algumas cópias desses arquivos. Assim como copiar e colar arquivos em outros sistemas operacionais, o shell nos dá uma maneira ainda mais simples de fazer isso. \n\n<pre>$ cp mycoolfile /home/pete/Documents/cooldocs</pre>\n\nmycoolfile é o arquivo que você deseja copiar e /home/pete/Documents/cooldocs é para onde você está copiando o arquivo.\n\nVocê pode copiar vários arquivos e diretórios, bem como usar curingas. Um curinga é um caractere que pode ser substituído por uma seleção baseada em padrões, dando a você mais flexibilidade com pesquisas. Você pode usar curingas em todos os comandos para mais flexibilidade.\n\n<ul>\n<li>* o curinga dos curingas, é usado para representar todos os caracteres únicos ou qualquer string.</li>\n<li>? usado para representar um caractere</li>\n<li>[] usado para representar qualquer caractere dentro dos colchetes</li>\n</ul>\n\n<pre>$ cp *.jpg /home/pete/Pictures</pre>\n\nIsso copiará todos os arquivos com a extensão .jpg em seu diretório atual para o diretório Pictures.\n\nUm comando útil é usar a flag -r, isso copiará recursivamente os arquivos e diretórios dentro de um diretório. \n\nTente fazer um cp em um diretório que contenha alguns arquivos para o seu diretório Documents. Não funcionou, não é? Bem, isso acontece porque você precisará copiar também os arquivos e diretórios dentro com o comando -r.\n\n<pre>$ cp -r Pumpkin/ /home/pete/Documents</pre>\n\nUma coisa a se observar, se você copiar um arquivo para um diretório que tem o mesmo nome de arquivo, o arquivo será sobrescrito com o que você está copiando. Isso não é bom se você tem um arquivo que não deseja que seja sobrescrito acidentalmente. Você pode usar a flag -i (interativo) para solicitar antes de sobrescrever um arquivo. \n\n<pre>$ cp -i mycoolfile /home/pete/Pictures</pre>",
  "exercise": "Copie alguns arquivos, tenha cuidado para não sobrescrever nada importante.",
  "quizQuestion": "Que flag você precisa especificar para copiar um diretório?",
  "quizAnswer": "-r",
  "slug": "copycpcommand"
}