{
  "id": 4,
  "title": "ls (Listar Diretórios)",
  "lessonContent": "Agora que sabemos como nos mover pelo sistema, como descobrimos o que está disponível para nós? Atualmente, é como se estivéssemos nos movendo no escuro. Bem, podemos usar o maravilhoso comando ls para listar o conteúdo do diretório. O comando ls listará diretórios e arquivos no diretório atual por padrão, no entanto, você pode especificar o caminho que deseja listar os diretórios.\n\n<pre>$ ls\n$ ls /home/pete</pre>\n\nls é uma ferramenta bastante útil, também mostra informações detalhadas sobre os arquivos e diretórios que você está visualizando.\n\nTambém observe que nem todos os arquivos em um diretório serão visíveis. Os nomes de arquivos que começam com . estão ocultos, você pode visualizá-los, no entanto, com o comando ls e passar a flag -a para ele (a para todos). \n\n<pre>$ ls -a</pre>\n\nExiste também mais uma flag útil do ls, -l para longo, isso mostra uma lista detalhada de arquivos em um formato longo. Isso mostrará informações detalhadas, começando da esquerda: permissões de arquivo, número de links, nome do proprietário, grupo do proprietário, tamanho do arquivo, carimbo de data/hora da última modificação e nome do arquivo/diretório. \n\n<pre>$ ls -l</pre>\n\n<pre>pete@icebox:~$ ls -l\ntotal 80\ndrwxr-x--- 7 pete penguingroup   4096 Nov 20 16:37 Desktop\ndrwxr-x--- 2 pete penguingroup   4096 Oct 19 10:46  Documents\ndrwxr-x--- 4 pete penguingroup   4096 Nov 20 09:30 Downloads\ndrwxr-x--- 2 pete penguingroup   4096 Oct  7 13:13   Music\ndrwxr-x--- 2 pete penguingroup   4096 Sep 21 14:02 Pictures\ndrwxr-x--- 2 pete penguingroup   4096 Jul 27 12:41   Public\ndrwxr-x--- 2 pete penguingroup   4096 Jul 27 12:41   Templates\ndrwxr-x--- 2 pete penguingroup   4096 Jul 27 12:41   Videos</pre>\n\nComandos têm coisas chamadas flags (ou argumentos ou opções, como você quiser chamar) para adicionar mais funcionalidades. Veja como adicionamos -a e -l, bem, você pode adicioná-los juntos com -la. A ordem das flags determina a ordem em que ela é aplicada, na maioria das vezes isso não importa muito, então você também pode fazer ls -al e ainda funcionará.\n\n<pre>$ ls -la</pre>",
  "exercise": "Execute ls com diferentes flags e veja a saída que você recebe.",
  "quizQuestion": "Qual comando você usaria para ver arquivos ocultos?",
  "quizAnswer": "ls -a",
  "slug": "listdirectorieslscommand"
}