{
  "id": 1,
  "title": "Geschichte",
  "lessonContent": "Hey Anfänger! Du hast also beschlossen, in diese wunderbare Welt namens Linux einzutauchen? Nun, du solltest dich besser festhalten, denn es wird ein langer und harter Weg sein. Mein Name ist Pinguin Pete und ich bin hier, um dich auf dieser Reise zu begleiten. Lass uns mit ein wenig Hintergrundwissen über Linux beginnen. \n\nUm zu erfahren, wie Linux entstanden ist, gehen wir zurück zum Anfang des Jahres 1969, als Ken Thompson und Dennis Ritchie von den Bell Laboratories das UNIX-Betriebssystem entwickelten. Es wurde später in C neu geschrieben, um es portabler zu machen, und wurde schließlich zu einem weit verbreiteten Betriebssystem. \n\nEin Jahrzehnt später begann Richard Stallman mit der Arbeit am GNU (GNU ist kein UNIX)-Projekt, dem GNU-Kernel namens Hurd, der leider nie fertiggestellt wurde. Als Ergebnis davon wurde auch die GNU General Public License (GPL), eine freie Softwarelizenz, erstellt. \n\nDer Kernel ist das wichtigste Stück im Betriebssystem. Er ermöglicht es der Hardware, mit der Software zu kommunizieren. Er erledigt auch noch eine ganze Menge anderer Dinge, aber darauf werden wir in einem anderen Kurs eingehen. Vorläufig sei nur gesagt, dass der Kernel praktisch alles kontrolliert, was auf deinem System passiert. \n\nWährend dieser Zeit wurden auch andere Bemühungen wie BSD, MINIX usw. entwickelt, um UNIX-ähnliche Systeme zu sein. Eines hatten jedoch alle diese UNIX-ähnlichen Systeme gemeinsam: das Fehlen eines vereinheitlichten Kernels. \n\nDann, im Jahr 1991, begann ein junger Mann namens Linus Torvalds mit der Entwicklung dessen, was wir heute als den Linux-Kernel kennen.",
  "exercise": "Zusätzliche Lektüre:\n<li><a href='https://www.gnu.org/home.en.html'>GNU</a></li>\n<li><a href='https://en.wikipedia.org/wiki/Ken_Thompson'>Ken Thompson</a></li>\n<li><a href='https://stallman.org/'>Richard Stallman</a></li>\n<li><a href='https://en.wikipedia.org/wiki/Linus_Torvalds'>Linus Torvalds</a></li>",
  "quizQuestion": "Wer hat den Linux-Kernel entwickelt?",
  "quizAnswer": "Linus Torvalds",
  "slug": "linuxhistory"
}