{
  "id": 2,
  "title": "Proceso de arranque: BIOS",
  "lessonContent": "<b>BIOS</b>\n\nEl primer paso en el proceso de arranque de Linux es el BIOS, que realiza comprobaciones de integridad del sistema. El BIOS es un firmware que se encuentra comúnmente en computadoras compatibles con IBM PC, el tipo dominante de computadoras que existen hoy en día. Probablemente has utilizado el firmware BIOS para cambiar el orden de arranque de tus discos duros, verificar la hora del sistema, la dirección MAC de tu máquina, etc. El objetivo principal del BIOS es encontrar el cargador del sistema.\n\nAsí que una vez que el BIOS inicia el disco duro, busca el bloque de arranque para averiguar cómo arrancar el sistema. Dependiendo de cómo hayas particionado tu disco, buscará el registro de arranque principal (MBR) o GPT. El MBR se encuentra en el primer sector del disco duro, los primeros 512 bytes. El MBR contiene el código para cargar otro programa en algún lugar del disco, este programa a su vez carga nuestro cargador de arranque.\n\nAhora, si has particionado tu disco con GPT, la ubicación del cargador de arranque cambia un poco.\n\n<b>UEFI</b>\n\nHay otra forma de arrancar tu sistema en lugar de usar BIOS y es con UEFI (que significa \"Interfaz de firmware extensible unificada\"). UEFI fue diseñado para ser el sucesor del BIOS, la mayoría del hardware que existe hoy en día viene con firmware UEFI incorporado. Las máquinas Macintosh han estado utilizando el arranque EFI desde hace años y Windows ha trasladado la mayor parte de sus cosas al arranque UEFI. El formato GPT estaba destinado a ser utilizado con EFI. No necesariamente necesitas EFI si estás arrancando un disco GPT. El primer sector de un disco GPT está reservado para un \"MBR protector\" para que sea posible arrancar una máquina basada en BIOS.\n\nUEFI almacena toda la información sobre el inicio en un archivo .efi. Este archivo se almacena en una partición especial llamada partición del sistema EFI en el hardware. Dentro de esta partición contendrá el cargador de arranque. UEFI viene con muchas mejoras respecto al firmware BIOS tradicional. Sin embargo, dado que estamos utilizando Linux, la mayoría de nosotros estamos utilizando BIOS. Por lo tanto, todas estas lecciones seguirán con esa pretensión.",
  "exercise": "Ingresa a tu menú de BIOS y verifica si tienes habilitado el arranque UEFI.",
  "quizQuestion": "¿Qué carga el BIOS?",
  "quizAnswer": "cargador de arranque",
  "slug": "procesodearranquebios"
}