{
  "id": 1,
  "title": "Resumen del Proceso de Arranque",
  "lessonContent": "Ahora que tenemos un buen entendimiento de algunos de los componentes importantes de Linux, vamos a unirlos todos aprendiendo cómo arranca el sistema. Cuando enciendes tu máquina, hace algunas cosas interesantes como mostrarte la pantalla del logo, ejecutar diferentes mensajes y luego al final te aparece una ventana de inicio de sesión. Bueno, en realidad hay un montón de cosas sucediendo entre cuando presionas el botón de encendido y cuando inicias sesión y discutiremos eso en este curso. \n\nEl proceso de arranque de Linux se puede dividir en 4 etapas simples: \n\n<b>1. BIOS</b>\n\nLa BIOS (que significa \"Sistema Básico de Entrada/Salida\") inicializa el hardware y se asegura con una Prueba de Autoinicio (POST) de que todo el hardware está listo para funcionar. El trabajo principal de la BIOS es cargar el cargador de arranque.\n\n<b>2. Cargador de Arranque</b>\n\nEl cargador de arranque carga el kernel en memoria y luego inicia el kernel con un conjunto de parámetros del kernel. Uno de los cargadores de arranque más comunes es GRUB, que es un estándar universal de Linux. \n\n<b>3. Kernel</b>\n\nCuando se carga el kernel, inicializa inmediatamente dispositivos y memoria. El trabajo principal del kernel es cargar el proceso init. \n\n<b>4. Init</b>\n\nRecuerda que el proceso init es el primer proceso que se inicia, init inicia y detiene procesos de servicios esenciales en el sistema. Hay tres implementaciones principales de init en distribuciones de Linux. Repasaremos brevemente y luego profundizaremos en ellos en otro curso.\n\nAhí está, la explicación (muy) simple del proceso de arranque de Linux. Profundizaremos más en estas etapas en las próximas lecciones.",
  "exercise": "Reinicia tu sistema y observa si puedes identificar cada paso mientras tu máquina se inicia.",
  "quizQuestion": "¿Cuál es la última etapa en el proceso de arranque de Linux?",
  "quizAnswer": "init",
  "slug": "resumenprocesoarranque"
}