{
  "id": 1,
  "title": "stdout (स्टैंडर्ड आउट)",
  "lessonContent": "अब तक, हमने कई कमांड्स और उनके आउटपुट के साथ परिचित हो गए हैं और यह हमें हमारे अगले विषय I/O (इनपुट/आउटपुट) स्ट्रीम्स तक पहुंचाता है। चलिए निम्नलिखित कमांड चलाएं और हम देखेंगे कि यह कैसे काम करता है। \n\n<pre>$ echo Hello World > peanuts.txt</pre>\n\nक्या हुआ था? अच्छा, उस डायरेक्टरी की जांच करें जहां आपने उस कमांड को चलाया था और देखें आपको एक फ़ाइल नामक peanuts.txt दिखाई देगी, उस फ़ाइल में जाएं और आपको पास में Hello World टेक्स्ट दिखाई देना चाहिए। एक कमांड में बहुत सारी चीजें हो गईं हैं, इसलिए चलिए इसे टूट दें। \n\nसबसे पहले हम पहला हिस्सा टूटें: \n\n<pre>$ echo Hello World</pre>\n\nहम जानते हैं कि यह स्क्रीन पर Hello World प्रिंट करता है, लेकिन कैसे? प्रक्रियाएँ I/O स्ट्रीम्स का उपयोग इनपुट प्राप्त करने और आउटपुट वापस देने के लिए करती हैं। डिफ़ॉल्ट रूप से एको कमांड की इनपुट (स्टैंडर्ड इनपुट या stdin) कीबोर्ड से लेता है और आउटपुट (स्टैंडर्ड आउटपुट या stdout) स्क्रीन पर वापस देता है। इसलिए जब आप अपने शैल में echo Hello World टाइप करते हैं, तो आपको स्क्रीन पर Hello World मिलता है। हालांकि, I/O पुनर्निर्देशन हमें इस डिफ़ॉल्ट व्यवहार को बदलने की अनुमति देता है जिससे हमें अधिक फ़ाइल लचीलाई मिलती है। \n\nआइए कमांड के अगले हिस्से पर बढ़ते हैं: \n\n<pre> > </pre>\n\n> एक पुनर्निर्देशन ऑपरेटर है जो हमें स्टैंडर्ड आउटपुट को कहां भेजने की अनुमति देता है। यह हमें echo Hello World का आउटपुट एक फ़ाइल में स्क्रीन के बजाय भेजने की अनुमति देता है। यदि फ़ाइल पहले से मौजूद नहीं है तो यह हमारे लिए उसे बना देगा। हालांकि, यदि यह मौजूद है तो यह उसे अधिलेखित कर देगा (आप एक शैल फ़्लैग जोड़ सकते हैं जो इसे रोकने के लिए आपके उपयोग के शैल पर निर्भर करता है)।\n\nऔर यही बुनियादी रूप से कैसे stdout पुनर्निर्देशन काम करता है!\n\nचलो मान लो कि मुझे अपनी peanuts.txt को अधिलेखित नहीं करना चाहिए था, भाग्य से उसके लिए एक पुनर्निर्देशन ऑपरेटर है, >>: \n\n<pre>$ echo Hello World >> peanuts.txt</pre>\n\nयह peanuts.txt फ़ाइल के अंत में Hello World को जोड़ देगा, यदि फ़ाइल पहले से मौजूद नहीं है तो यह हमारे लिए उसे बना देगा जैसे यह > पुनर्निर्देशक के साथ किया था!",
  "exercise": "कुछ कमांड का प्रयास करें: \n\n<pre>\n$ ls -l /var/log > myoutput.txt\n$ echo Hello World > rm\n$ > somefile.txt \n</pre>",
  "quizQuestion": "आप किस प्रकार के पुनर्निर्देशक का उपयोग करते हैं जिससे आउटपुट को फ़ाइल में जोड़ा जा सके?",
  "quizAnswer": ">>",
  "slug": "stdoutstandardoutredirect"
}