{
  "id": 2,
  "title": "tipos de dispositivos",
  "lessonContent": "Antes de hablar sobre cómo se gestionan los dispositivos, veamos algunos dispositivos en realidad.\n\n<pre>$ ls -l /dev\nbrw-rw----   1 root disk      8,   0 Dec 20 20:13 sda\ncrw-rw-rw-   1 root root      1,   3 Dec 20 20:13 null\nsrw-rw-rw-   1 root root           0 Dec 20 20:13 log\nprw-r--r--   1 root root           0 Dec 20 20:13 fdata\n</pre>\n\nLas columnas son las siguientes de izquierda a derecha:\n\n<ul>\n<li>Permisos</li>\n<li>Propietario</li>\n<li>Grupo</li>\n<li>Número de dispositivo principal</li>\n<li>Número de dispositivo secundario</li>\n<li>Marca de tiempo</li>\n<li>Nombre del dispositivo</li>\n</ul>\n\nRecuerda que en el comando ls puedes ver el tipo de archivo con el primer bit de cada línea. Los archivos de dispositivo se indican de la siguiente manera: \n\n<ul>\n<li>c - carácter</li>\n<li>b - bloque</li>\n<li>p - tubería</li>\n<li>s - socket</li>\n</ul>\n\n<b>Dispositivo de Carácter</b>\n\nEstos dispositivos transfieren datos, pero uno a la vez. Verás muchos dispositivos pseudo (/dev/null) como dispositivos de carácter, estos dispositivos no están realmente conectados físicamente a la máquina, pero permiten una mayor funcionalidad al sistema operativo. \n\n<b>Dispositivo de Bloque</b>\n\nEstos dispositivos transfieren datos, pero en bloques grandes de tamaño fijo. Comúnmente verás dispositivos que utilizan bloques de datos como dispositivos de bloque, como discos duros, sistemas de archivos, etc. \n\n<b>Dispositivo de Tubería</b>\n\nLas tuberías nombradas permiten que dos o más procesos se comuniquen entre sí, son similares a los dispositivos de carácter, pero en lugar de enviar la salida a un dispositivo, se envía a otro proceso. \n\n<b>Dispositivo de Socket</b>\n\nLos dispositivos de socket facilitan la comunicación entre procesos, similar a los dispositivos de tubería pero pueden comunicarse con muchos procesos a la vez. \n\n<b>Caracterización de Dispositivos</b>\n\nLos dispositivos se caracterizan utilizando dos números, <b>número de dispositivo principal</b> y <b>número de dispositivo secundario</b>. Puedes ver estos números en el ejemplo de ls anterior, están separados por una coma. Por ejemplo, supongamos que un dispositivo tuviera los números de dispositivo: <b>8, 0</b>:\n\nEl número de dispositivo principal representa el controlador de dispositivo que se utiliza, en este caso 8, que a menudo es el número principal para los dispositivos de bloque sd. El número secundario le indica al kernel qué dispositivo único es en esta clase de controlador, en este caso se usa 0 para representar el primer dispositivo (a).",
  "exercise": "Mira tu directorio /dev y descubre qué tipos de dispositivos puedes ver.",
  "quizQuestion": "¿Cuál es el símbolo para los dispositivos de carácter en el comando ls -l?",
  "quizAnswer": "c",
  "slug": "tiposdedispositivos"
}