{
  "id": 3,
  "title": "Nombres de Dispositivos",
  "lessonContent": "Aquí están los nombres de dispositivos más comunes que encontrarás: \n\n<b>Dispositivos SCSI</b>\n\nSi tienes algún tipo de almacenamiento masivo en tu máquina, lo más probable es que esté utilizando el protocolo SCSI (pronunciado \"scuzzy\"). SCSI significa Interfaz de Sistema Pequeño de Computadora, es un protocolo utilizado para permitir la comunicación entre discos, impresoras, escáneres y otros periféricos a tu sistema. Es posible que hayas oído hablar de dispositivos SCSI que en realidad no se utilizan en sistemas modernos, sin embargo, nuestros sistemas Linux corresponden los discos SCSI con unidades de disco duro en /dev. Se representan con un prefijo de sd (disco SCSI):\n\nArchivos de dispositivos SCSI comunes:\n\n<ul>\n<li>/dev/sda - Primer disco duro</li>\n<li>/dev/sdb - Segundo disco duro</li>\n<li>/dev/sda3 - Tercera partición en el primer disco duro</li>\n</ul>\n\n<b>Dispositivos Pseudo</b>\n\nComo discutimos anteriormente, los dispositivos pseudo no están realmente conectados físicamente a tu sistema, los dispositivos pseudo más comunes son dispositivos de caracteres: \n\n<ul>\n<li>/dev/zero - acepta y descarta toda la entrada, produce un flujo continuo de bytes NULL (valor cero)</li>\n<li>/dev/null - acepta y descarta toda la entrada, no produce ninguna salida</li>\n<li>/dev/random - produce números aleatorios</li>\n</ul>\n\n<b>Dispositivos PATA</b>\n\nA veces, en sistemas más antiguos, es posible que veas que los discos duros se refieren con un prefijo hd: \n\n<ul>\n<li>/dev/hda - Primer disco duro</li>\n<li>/dev/hdd2 - Segunda partición en el cuarto disco duro</li>\n</ul>",
  "exercise": "Escribe en los dispositivos pseudo y observa qué sucede, ¡ten cuidado de no escribir en tus discos en esos dispositivos!",
  "quizQuestion": "¿Cuál sería comúnmente el nombre de dispositivo para la primera partición en el segundo disco SCSI?",
  "quizAnswer": "sdb1",
  "slug": "nombresdedispositivos"
}