{
  "id": 1,
  "title": "नेटवर्क इंटरफेस",
  "lessonContent": "नेटवर्क इंटरफेस कर्नल को सॉफ़्टवेयर साइड ऑफ नेटवर्किंग को हार्डवेयर साइड से कैसे जोड़ता है। हमने पहले से ही इसका एक उदाहरण देख लिया है:\n\n<pre>\npete@icebox:~$ ifconfig -a\neth0      Link encap:Ethernet  HWaddr 1d:3a:32:24:4d:ce  \n          inet addr:192.168.1.129  Bcast:192.168.1.255  Mask:255.255.255.0\n          inet6 addr: fd60::21c:29ff:fe63:5cdc/64 Scope:Link\n</pre>\n\n<b> द इफकॉन्फ़िग कमांड</b>\n\n<b>इफकॉन्फ़िग</b> टूल हमें हमारे नेटवर्क इंटरफेस कॉन्फ़िगर करने की अनुमति देता है, अगर हमारे पास कोई नेटवर्क इंटरफेस सेट नहीं है, तो कर्नल के डिवाइस ड्राइवर्स और नेटवर्क एक दूसरे से कैसे बात करेंगे यह पता नहीं चलेगा। इफकॉन्फ़िग बूटअप पर चलता है और हमारे इंटरफेस को कॉन्फ़िगर करता है कॉन्फ़िग फ़ाइलों के माध्यम से, लेकिन हम इन्हें मैन्युअली भी संशोधित कर सकते हैं। इफकॉन्फ़िग का आउटपुट इंटरफेस का नाम बाएं ओर दाएं ओर विस्तृत जानकारी दिखाता है। आप सबसे अधिक आम तौर पर इंटरफेस नाम देखेंगे eth0 (मशीन में पहला ईथरनेट कार्ड), wlan0 (वायरलेस इंटरफेस), lo (लूपबैक इंटरफेस)। लूपबैक इंटरफेस का उपयोग अपने कंप्यूटर को प्रतिनिधित करने के लिए किया जाता है, यह आपको खुद से लूप कर देता है। यह डीबगिंग या स्थानीय रूप से चल रहे सर्वरों से कनेक्ट करने के लिए अच्छा है।\n\nइंटरफेस की स्थिति, ऊपर या नीचे हो सकती है, जैसा कि आप अनुमान लगा सकते हैं अगर आप चाहते थे कि आप किसी इंटरफेस को \"बंद\" करना चाहते हैं तो आप इसे नीचे सेट कर सकते हैं। इफकॉन्फ़िग के आउटपुट में आपको सबसे अधिक देखने के लिए फ़ील्ड होंगे HWaddr (इंटरफेस का एमएसी पता), इंटरनेट पता (आईपीवी4 पता) और इंटरनेट6 (आईपीवी6 पता)। बेशक आप देख सकते हैं कि सबनेट मास्क और ब्रॉडकास्ट पता भी हैं। आप इंटरफेस जानकारी को /इट्स/नेटवर्क/इंटरफेसेस पर भी देख सकते हैं।\n\n<b>एक इंटरफेस बनाने और उसे ऊपर लाने के लिए</b>\n\n<pre>$ ifconfig eth0 192.168.2.1 netmask 255.255.255.0 up</pre>\n\nयह इथ0 इंटरफेस को एक आईपी पता और नेटमास्क सौंपता है और उसे ऊपर भी कर देता है।\n\n<b>इंटरफेस को ऊपर या नीचे लाने के लिए</b>\n\n<pre>\n$ ifup eth0\n$ ifdown eth0\n</pre>\n\n<b> द आईपी कमांड </b>\n\n<b>आईपी</b> कमांड भी हमें सिस्टम के नेटवर्किंग स्टैक को संशोधित करने की अनुमति देता है। आपके उपयोग करने के वितरण पर निर्भर करता है कि आपको अपने नेटवर्क सेटिंग्स को संशोधित करने का पसंदीदा तरीका हो सकता है।\n\nयहाँ कुछ इसके उपयोग के उदाहरण हैं:\n\n<b>सभी इंटरफेसेस के लिए इंटरफेस जानकारी दिखाने के लिए </b>\n<pre>\n$ ip link show\n</pre>\n\n<b>एक इंटरफेस के सांख्यिकी दिखाने के लिए</b>\n<pre>\n$ ip -s link show eth0\n</pre>\n\n\n<b>इंटरफेसेस को आवंटित किए गए आईपी पते दिखाने के लिए</b>\n<pre>\n$ ip address show\n</pre>\n\n<b>इंटरफेस को ऊपर और नीचे लाने के लिए</b>\n<pre>\n$ ip link set eth0 up\n$ ip link set eth0 down\n</pre>\n\n<b>एक आईपी पता को इंटरफेस में जोड़ने के लिए</b>\n<pre>\n$ ip address add 192.168.1.1/24 dev eth0\n</pre>",
  "exercise": "अपने नेटवर्क इंटरफेस की स्थिति को ऊपर या नीचे बदलने की कोशिश करें और देखें क्या होता है।\n\nक्या आप अपने नेटवर्क इंटरफेस को इफकॉन्फ़िग और आईपी कमांड्स के साथ बदल सकते हैं?",
  "quizQuestion": "हमारे नेटवर्क इंटरफेस कॉन्फ़िगर करने के लिए कमांड क्या है?",
  "quizAnswer": "ifconfig",
  "slug": "नेटवर्कइंटरफेस"
}