{
  "id": 1,
  "title": "Historia",
  "lessonContent": "¡Hola novato! ¿Así que decidiste sumergirte en este maravilloso mundo conocido como Linux? Bueno, más te vale abrocharte el cinturón, porque va a ser un camino largo y difícil. Mi nombre es Pingüino Pete y estoy aquí para guiarte en este viaje. Empecemos con un poco de historia sobre Linux. \n\nPara conocer cómo surgió Linux, retrocedamos al principio, en 1969, cuando Ken Thompson y Dennis Ritchie de Bell Laboratories desarrollaron el sistema operativo UNIX. Más tarde fue reescrito en C para hacerlo más portable y eventualmente se convirtió en un sistema operativo ampliamente utilizado. \n\nUna década más tarde, Richard Stallman comenzó a trabajar en el proyecto GNU (GNU is Not UNIX), el núcleo GNU llamado Hurd, que desafortunadamente nunca se completó. La Licencia Pública General de GNU (GPL), una licencia de software libre, también se creó como resultado de esto.\n\nEl núcleo es la pieza más importante en el sistema operativo. Permite que el hardware se comunique con el software. También hace muchas otras cosas, pero profundizaremos en eso en un curso diferente. Por ahora, solo debes saber que el núcleo controla prácticamente todo lo que sucede en tu sistema. \n\nDurante este tiempo, se desarrollaron otros esfuerzos como BSD, MINIX, etc. para ser sistemas similares a UNIX. Sin embargo, una cosa que todos estos sistemas similares a UNIX tenían en común era la falta de un núcleo unificado. \n\nLuego, en 1991, un joven llamado Linus Torvalds comenzó a desarrollar lo que hoy conocemos como el núcleo Linux.",
  "exercise": "Lectura adicional:\n<li><a href='https://www.gnu.org/home.en.html'>GNU</a></li>\n<li><a href='https://en.wikipedia.org/wiki/Ken_Thompson'>Ken Thompson</a></li>\n<li><a href='https://stallman.org/'>Richard Stallman</a></li>\n<li><a href='https://en.wikipedia.org/wiki/Linus_Torvalds'>Linus Torvalds</a></li>",
  "quizQuestion": "¿Quién desarrolló el núcleo de Linux?",
  "quizAnswer": "Linus Torvalds",
  "slug": "historialinux"
}