{
  "id": 5,
  "title": "साम्बा",
  "lessonContent": "कंप्यूटिंग के प्रारंभिक दिनों में, विंडोज मशीनों को लिनक्स मशीनों के साथ फ़ाइल साझा करने की आवश्यकता पड़ी, इसलिए सर्वर संदेश ब्लॉक (SMB) प्रोटोकॉल का जन्म हुआ। SMB का उपयोग विंडोज ऑपरेटिंग सिस्टम्स (मैक भी SMB के साथ फ़ाइल साझा करता है) के बीच फ़ाइल साझा करने के लिए किया गया था और फिर बाद में इसे सामान्य इंटरनेट फ़ाइल सिस्टम (CIFS) प्रोटोकॉल के रूप में साफ किया और अनुकूलित किया गया।\n\nसाम्बा वह है जिसे हम लिनक्स पर CIFS के साथ काम करने के लिए यूटिलिटीज़ कहते हैं। फ़ाइल साझा करने के अतिरिक्त, आप प्रिंटर जैसे संसाधनों को भी साझा कर सकते हैं।\n\n<b>साम्बा के साथ नेटवर्क शेयर बनाएं</b>\n\nचलिए उन मूलभूत कदमों के माध्यम से जाएं जिनका पालन करके एक नेटवर्क शेयर बनाएं जिसे एक विंडोज मशीन तक पहुंच सकती है:\n\n<b>साम्बा इंस्टॉल करें</b>\n\n<pre>$ sudo apt update\n$ sudo apt install samba</pre>\n\n<b>smb.conf को सेटअप करें</b>\n\nसाम्बा के लिए कॉन्फ़िगरेशन फ़ाइल /etc/samba/smb.conf पर मिलती है, इस फ़ाइल में सिस्टम को बताना चाहिए कि कौन से निर्देशिकाएँ साझा की जानी चाहिए, उनकी पहुंच अनुमतियाँ, और अधिक विकल्प। डिफ़ॉल्ट smb.conf में पहले से ही कई कमेंट कोड शामिल हैं और आप उन्हें अपनी कॉन्फ़िगरेशन लिखने के उदाहरण के रूप में उपयोग कर सकते हैं।\n\n<pre>$ sudo vi /etc/samba/smb.conf</pre>\n\n<b>साम्बा के लिए पासवर्ड सेटअप करें</b>\n\n<pre>$ sudo smbpasswd -a [उपयोगकर्ता नाम]</pre>\n\n<b>एक साझा निर्देशिका बनाएं</b>\n\n<pre>$ mkdir /मेरी/निर्देशिका/जिसे/साझा/करना/है</pre>\n\n<b>साम्बा सेवा को पुनः आरंभ करें</b>\n\n<pre>$ sudo service smbd restart</pre>\n\n<b>विंडोज के माध्यम से एक साम्बा शेयर तक पहुंचें</b>\n\nविंडोज में, रन प्रॉम्प्ट में नेटवर्क कनेक्शन टाइप करें: \\\\HOST\\शेयरनेम।\n\n<b>लिनक्स के माध्यम से एक साम्बा/विंडोज शेयर तक पहुंचें</b>\n\n<pre>$ smbclient //HOST/निर्देशिका -U उपयोगकर्ता</pre>\n\nसाम्बा पैकेज में एक कमांड लाइन टूल शामिल है जिसे <b>smbclient</b> कहा जाता है जिसका उपयोग आप किसी भी विंडोज या साम्बा सर्वर तक पहुंचने के लिए कर सकते हैं। जब आप शेयर से कनेक्ट हो जाते हैं तो आप नेविगेट और फ़ाइलें स्थानांतरित कर सकते हैं।\n\n<b>अपने सिस्टम पर एक साम्बा शेयर जोड़ें</b>\n\nएक-एक करके फ़ाइलें स्थानांतरित करने की बजाय, आप अपने सिस्टम पर नेटवर्क शेयर को माउंट कर सकते हैं।\n\n<pre>$ sudo mount -t cifs सर्वरनाम:निर्देशिका माउंटपॉइंट -o उपयोगकर्ता=उपयोगकर्तानाम,पासवर्ड=पासवर्ड</pre>",
  "exercise": "एक साम्बा शेयर सेटअप करें, अगर आपके पास नहीं है, smb.conf खोलें और कॉन्फ़िग फ़ाइल में विकल्पों को समझने के लिए अपने आप को परिचित कराएं।",
  "quizQuestion": "विंडोज और लिनक्स के बीच फ़ाइल स्थानांतरण के लिए नवीनतम प्रोटोकॉल क्या है?",
  "quizAnswer": "CIFS",
  "slug": "samba"
}