{
  "id": 7,
  "title": "dd",
  "lessonContent": "A ferramenta dd é super útil para converter e copiar dados. Ele lê a entrada de um arquivo ou fluxo de dados e escreve em um arquivo ou fluxo de dados. \n\nConsidere o seguinte comando: \n\n<pre>$ dd if=/home/pete/backup.img of=/dev/sdb bs=1024 </pre>\n\nEste comando está copiando o conteúdo de backup.img para /dev/sdb. Ele copiará os dados em blocos de 1024 bytes até que não haja mais dados para serem copiados. \n\n<ul>\n<li>if=arquivo - Arquivo de entrada, lê de um arquivo em vez da entrada padrão</li>\n<li>of=arquivo - Arquivo de saída, escreve em um arquivo em vez da saída padrão</li>\n<li>bs=bytes - Tamanho do bloco, lê e escreve essa quantidade de bytes de dados de cada vez. Você pode usar diferentes métricas de tamanho denotando o tamanho com k para kilobyte, m para megabyte, etc, então 1024 bytes é 1k</li>\n<li>count=número - Número de blocos a serem copiados.</li>\n</ul>\n\nVocê verá alguns comandos dd que usam a opção count, geralmente com dd if você deseja copiar um arquivo que é 1 megabyte, geralmente desejará ver esse arquivo como 1 megabyte quando terminar de ser copiado. Digamos que você execute o seguinte comando: \n\n<pre>$ dd if=/home/pete/backup.img of=/dev/sdb bs=1M count=2</pre>\n\nNosso arquivo backup.img tem 10M, no entanto, estamos dizendo neste comando para copiar 1M 2 vezes, então apenas 2M está sendo copiado, deixando nossos dados copiados incompletos. Count pode ser útil em muitas situações, mas se você está apenas copiando dados, pode praticamente omitir count e até mesmo bs. Se você realmente deseja otimizar suas transferências de dados, então você vai querer começar a usar essas opções.\n\ndd é extremamente poderoso, você pode usá-lo para fazer backups de qualquer coisa, incluindo discos inteiros, restaurar imagens de disco e muito mais. Tenha cuidado, essa ferramenta poderosa pode ter um preço se você não souber o que está fazendo.",
  "exercise": "Use o comando dd para fazer um backup do seu drive e defina a saída para um arquivo .img.",
  "quizQuestion": "Qual é a opção do dd para o tamanho do bloco?",
  "quizAnswer": "bs",
  "slug": "ddcommand"
}