{
  "id": 1,
  "title": "/dev diretório",
  "lessonContent": "Quando você conecta um dispositivo à sua máquina, geralmente ele precisa de um driver de dispositivo para funcionar corretamente. Você pode interagir com drivers de dispositivo através de arquivos de dispositivo ou nós de dispositivo, que são arquivos especiais que se parecem com arquivos regulares. Como esses arquivos de dispositivo são como arquivos regulares, você pode usar programas como ls, cat, etc para interagir com eles. Esses arquivos de dispositivo geralmente são armazenados no diretório /dev. Vá em frente e liste o diretório /dev em seu sistema, você verá uma grande quantidade de arquivos de dispositivos em seu sistema. \n\n<pre>$ ls /dev </pre>\n\nAlguns desses dispositivos você já usou e interagiu, como por exemplo /dev/null. Lembre-se que quando enviamos a saída para /dev/null, o kernel sabe que esse dispositivo recebe toda a nossa entrada e simplesmente a descarta, então nada é retornado.\n\nNos velhos tempos, se você quisesse adicionar um dispositivo ao seu sistema, você adicionaria o arquivo de dispositivo em /dev e provavelmente esqueceria sobre ele. Bem, repita isso algumas vezes e você verá onde estava o problema. O diretório /dev ficaria cheio de arquivos de dispositivos estáticos de dispositivos que você já atualizou, parou de usar, etc. Os dispositivos também são atribuídos arquivos de dispositivo na ordem em que o kernel os encontra. Então, se toda vez que você reiniciasse seu sistema, os dispositivos poderiam ter arquivos de dispositivo diferentes dependendo de quando foram descobertos.\n\nFelizmente, não usamos mais esse método, agora temos algo que usamos para adicionar e remover dinamicamente dispositivos que estão sendo usados no sistema e discutiremos isso nas próximas lições.",
  "exercise": "Confira o conteúdo do diretório /dev, reconhece algum dispositivo familiar?",
  "quizQuestion": "Onde os arquivos de dispositivo são armazenados no sistema?",
  "quizAnswer": "/dev",
  "slug": "devdirectory"
}