{
  "id": 2,
  "title": "tipos de dispositivos",
  "lessonContent": "Antes de conversarmos sobre como os dispositivos são gerenciados, vamos dar uma olhada em alguns dispositivos.\n\n<pre>$ ls -l /dev\nbrw-rw----   1 root disk      8,   0 Dec 20 20:13 sda\ncrw-rw-rw-   1 root root      1,   3 Dec 20 20:13 null\nsrw-rw-rw-   1 root root           0 Dec 20 20:13 log\nprw-r--r--   1 root root           0 Dec 20 20:13 fdata\n</pre>\n\nAs colunas são as seguintes da esquerda para a direita:\n\n<ul>\n<li>Permissões</li>\n<li>Proprietário</li>\n<li>Grupo</li>\n<li>Número do Dispositivo Principal</li>\n<li>Número do Dispositivo Secundário</li>\n<li>Timestamp</li>\n<li>Nome do Dispositivo</li>\n</ul>\n\nLembre-se de que no comando ls você pode ver o tipo de arquivo com o primeiro bit de cada linha. Arquivos de dispositivo são indicados da seguinte forma: \n\n<ul>\n<li>c - caractere</li>\n<li>b - bloco</li>\n<li>p - pipe</li>\n<li>s - socket</li>\n</ul>\n\n<b>Dispositivo de Caractere</b>\n\nEsses dispositivos transferem dados, mas um caractere de cada vez. Você verá muitos dispositivos pseudo (/dev/null) como dispositivos de caractere, esses dispositivos não estão realmente conectados fisicamente à máquina, mas permitem uma maior funcionalidade ao sistema operacional. \n\n<b>Dispositivo de Bloco</b>\n\nEsses dispositivos transferem dados, mas em blocos grandes de tamanho fixo. Você verá mais comumente dispositivos que utilizam blocos de dados como dispositivos de bloco, como discos rígidos, sistemas de arquivos, etc. \n\n<b>Dispositivo de Pipe</b>\n\nOs pipes nomeados permitem que dois ou mais processos se comuniquem entre si, sendo semelhantes aos dispositivos de caractere, mas em vez de ter a saída enviada para um dispositivo, ela é enviada para outro processo. \n\n<b>Dispositivo de Socket</b>\n\nOs dispositivos de socket facilitam a comunicação entre processos, semelhante aos dispositivos de pipe, mas podem se comunicar com vários processos ao mesmo tempo. \n\n<b>Caracterização do Dispositivo</b>\n\nOs dispositivos são caracterizados usando dois números, <b>número do dispositivo principal</b> e <b>número do dispositivo secundário</b>. Você pode ver esses números no exemplo de ls acima, eles são separados por uma vírgula. Por exemplo, digamos que um dispositivo tivesse os números de dispositivo: <b>8, 0</b>:\n\nO número do dispositivo principal representa o driver do dispositivo que está sendo usado, neste caso 8, que é frequentemente o número principal para dispositivos de bloco sd. O número secundário informa ao kernel qual dispositivo único é nessa classe de driver, neste caso 0 é usado para representar o primeiro dispositivo (a).",
  "exercise": "Olhe para o seu diretório /dev e descubra que tipos de dispositivos você pode ver.",
  "quizQuestion": "Qual é o símbolo para dispositivos de caractere no comando ls -l?",
  "quizAnswer": "c",
  "slug": "tiposdedispositivos"
}