{
  "id": 3,
  "title": "cd (Change Directory)",
  "lessonContent": "Jetzt, da Sie wissen, wo Sie sich befinden, schauen wir, ob wir uns im Dateisystem etwas bewegen können. Denken Sie daran, dass wir uns mithilfe von Pfaden navigieren müssen. Es gibt zwei verschiedene Möglichkeiten, einen Pfad anzugeben, mit absoluten und relativen Pfaden. \n\n<ul>\n<li>Absoluter Pfad: Dies ist der Pfad vom Wurzelverzeichnis aus. Die Wurzel ist der Chef. Das Wurzelverzeichnis wird normalerweise als Schrägstrich dargestellt. Jedes Mal, wenn Ihr Pfad mit / beginnt, bedeutet dies, dass Sie vom Wurzelverzeichnis aus starten. Zum Beispiel: /home/pete/Desktop.</li>\n\n<li>Relativer Pfad: Dies ist der Pfad von Ihrem aktuellen Standort im Dateisystem aus. Wenn ich mich zum Beispiel im Verzeichnis /home/pete/Documents befinde und in ein Verzeichnis namens taxes innerhalb von Documents wechseln möchte, muss ich nicht den gesamten Pfad von der Wurzel aus wie /home/pete/Documents/taxes angeben, sondern ich kann einfach zu taxes/ wechseln.</li>\n</ul>\n\nJetzt, da Sie wissen, wie Pfade funktionieren, brauchen wir nur etwas, um uns in das Verzeichnis zu wechseln, in das wir möchten. Glücklicherweise haben wir cd oder „change directory“, um das zu tun. \n\n<pre>$ cd /home/pete/Pictures</pre> \n\nJetzt habe ich meinen Verzeichnisstandort auf /home/pete/Pictures geändert.\n\nVon diesem Verzeichnis aus habe ich einen Ordner namens Hawaii, zu dem ich mit folgendem Befehl navigieren kann:\n\n<pre>$ cd Hawaii</pre>\n\nBeachten Sie, wie ich einfach den Namen des Ordners verwendet habe? Das liegt daran, dass ich bereits in /home/pete/Pictures war.\n\nEs kann ziemlich anstrengend sein, die ganze Zeit mit absoluten und relativen Pfaden zu navigieren, zum Glück gibt es einige Abkürzungen, die Ihnen helfen können. \n\n<ul>\n<li>. (aktuelles Verzeichnis). Dies ist das Verzeichnis, in dem Sie sich gerade befinden.</li>\n<li>.. (vorheriges Verzeichnis). Bringt Sie in das übergeordnete Verzeichnis Ihres aktuellen Verzeichnisses.</li>\n<li>~ (Home-Verzeichnis). Dieses Verzeichnis entspricht standardmäßig Ihrem „Home-Verzeichnis“. Zum Beispiel: /home/pete.</li>\n<li>- (vorheriges Verzeichnis). Dies bringt Sie in das vorherige Verzeichnis, in dem Sie gerade waren.</li>\n</ul>\n\n<pre>$ cd .\n$ cd ..\n$ cd ~\n$ cd -\n</pre>\nProbieren Sie sie aus!",
  "exercise": "<ol>\n<li>Führen Sie den cd-Befehl ohne Flags aus, wohin führt er Sie?</li>\n</ol>",
  "quizQuestion": "Wenn Sie sich in /home/pete/Pictures befinden und nach /home/pete wechseln möchten, welche Abkürzung ist nützlich?",
  "quizAnswer": "cd ..",
  "slug": "changedirectorycdcommand"
}