{
  "id": 10,
  "title": "cp (Kopieren)",
  "lessonContent": "Lassen Sie uns damit beginnen, einige Kopien dieser Dateien zu erstellen. Ähnlich wie beim Kopieren und Einfügen von Dateien in anderen Betriebssystemen bietet die Shell uns eine noch einfachere Möglichkeit, dies zu tun. \n\n<pre>$ cp mycoolfile /home/pete/Documents/cooldocs</pre>\n\nmycoolfile ist die Datei, die Sie kopieren möchten, und /home/pete/Documents/cooldocs ist der Zielort der Kopie.\n\nSie können auch mehrere Dateien und Verzeichnisse kopieren sowie Platzhalter verwenden. Ein Platzhalter ist ein Zeichen, das für eine Muster-basierte Auswahl eingesetzt werden kann und Ihnen mehr Flexibilität bei Suchvorgängen bietet. Sie können Platzhalter in jedem Befehl verwenden, um flexibler zu sein.\n\n<ul>\n<li>* der Platzhalter der Platzhalter, er wird verwendet, um alle einzelnen Zeichen oder beliebige Zeichenfolgen darzustellen.</li>\n<li>? wird verwendet, um ein Zeichen darzustellen</li>\n<li>[] wird verwendet, um jedes Zeichen innerhalb der Klammern darzustellen</li>\n</ul>\n\n<pre>$ cp *.jpg /home/pete/Pictures</pre>\n\nDies kopiert alle Dateien mit der Erweiterung .jpg in Ihrem aktuellen Verzeichnis in das Verzeichnis Pictures.\n\nEin nützlicher Befehl ist die Verwendung des -r Flags, dies kopiert die Dateien und Verzeichnisse innerhalb eines Verzeichnisses rekursiv. \n\nVersuchen Sie, ein cp auf ein Verzeichnis durchzuführen, das ein paar Dateien enthält, in Ihr Documents-Verzeichnis. Hat nicht funktioniert, oder? Nun, das liegt daran, dass Sie die Dateien und Verzeichnisse darin auch mit dem -r Befehl kopieren müssen.\n\n<pre>$ cp -r Pumpkin/ /home/pete/Documents</pre>\n\nEine Sache ist zu beachten: Wenn Sie eine Datei in ein Verzeichnis kopieren, das denselben Dateinamen hat, wird die Datei mit dem überschrieben, was Sie gerade kopieren. Das ist nicht gut, wenn Sie eine Datei haben, die Sie nicht versehentlich überschreiben möchten. Sie können das -i Flag (interaktiv) verwenden, um vor dem Überschreiben einer Datei eine Abfrage zu erhalten. \n\n<pre>$ cp -i mycoolfile /home/pete/Pictures</pre>",
  "exercise": "Kopieren Sie ein paar Dateien, achten Sie darauf, nichts Wichtiges zu überschreiben.",
  "quizQuestion": "Welches Flag müssen Sie angeben, um ein Verzeichnis zu kopieren?",
  "quizAnswer": "-r",
  "slug": "copycpcommand"
}