{
  "id": 9,
  "title": "Verlauf",
  "lessonContent": "In Ihrer Shell gibt es einen Verlauf der Befehle, die Sie zuvor eingegeben haben. Sie können tatsächlich durch diese Befehle blättern. Dies ist sehr nützlich, wenn Sie einen zuvor verwendeten Befehl finden und ausführen möchten, ohne ihn erneut eingeben zu müssen.\n\n<pre>$ history</pre>\n\nMöchten Sie denselben Befehl ausführen, den Sie zuvor ausgeführt haben? Drücken Sie einfach den Pfeil nach oben.\n\nMöchten Sie den vorherigen Befehl ohne erneute Eingabe ausführen? Verwenden Sie !!. Wenn Sie z. B. cat file1 eingegeben haben und ihn erneut ausführen möchten, können Sie einfach !! eingeben und der zuletzt ausgeführte Befehl wird ausgeführt.\n\nEine weitere Verlauf-Verknüpfung ist Strg-R, dies ist der Rückwärtssuchbefehl. Wenn Sie Strg-R drücken und mit der Eingabe des Befehls beginnen, den Sie möchten, werden Übereinstimmungen angezeigt und Sie können durch Drücken der Strg-R-Taste erneut durch sie navigieren. Sobald Sie den Befehl gefunden haben, den Sie erneut verwenden möchten, drücken Sie einfach die Eingabetaste.\n\nUnser Terminal wird ein wenig unübersichtlich, oder? Lassen Sie uns aufräumen, verwenden Sie den Befehl clear, um Ihren Bildschirm aufzuräumen.\n\n<pre>$ clear</pre>\n\nSieht das nicht besser aus? \n\nWährend wir über nützliche Dinge sprechen, ist eine der nützlichsten Funktionen in jeder Befehlszeilenumgebung die Tab-Vervollständigung. Wenn Sie mit der Eingabe eines Befehls, einer Datei, eines Verzeichnisses usw. beginnen und die Tab-Taste drücken, wird basierend auf dem gefundenen Inhalt im Verzeichnis, das Sie durchsuchen, automatisch vervollständigt, solange Sie keine anderen Dateien haben, die mit diesen Buchstaben beginnen. Wenn Sie z. B. versuchen, den Befehl chrome auszuführen, können Sie chr eingeben und die Tab-Taste drücken, um chrome automatisch zu vervollständigen.",
  "exercise": "Navigieren Sie mit den Pfeiltasten nach oben und unten durch Ihren vorherigen Befehlsverlauf. Probieren Sie die Strg-R-Rückwärtssuche aus.",
  "quizQuestion": "Wie lautet der Befehl, um das Terminal zu leeren?",
  "quizAnswer": "clear",
  "slug": "historycommand"
}