{
  "id": 4,
  "title": "ls (Verzeichnisse auflisten)",
  "lessonContent": "Jetzt, da wir wissen, wie wir uns im System bewegen, wie finden wir heraus, was uns zur Verfügung steht? Im Moment ist es, als würden wir im Dunkeln herumirren. Nun, wir können den wunderbaren ls-Befehl verwenden, um den Inhalt von Verzeichnissen aufzulisten. Der ls-Befehl listet standardmäßig Verzeichnisse und Dateien im aktuellen Verzeichnis auf, jedoch können Sie angeben, welchen Pfad Sie auflisten möchten.\n\n<pre>$ ls\n$ ls /home/pete</pre>\n\nls ist ein ziemlich nützliches Werkzeug, es zeigt Ihnen auch detaillierte Informationen über die Dateien und Verzeichnisse, die Sie betrachten.\n\nBeachten Sie auch, dass nicht alle Dateien in einem Verzeichnis sichtbar sind. Dateinamen, die mit . beginnen, sind versteckt, Sie können sie jedoch mit dem ls-Befehl anzeigen und das -a-Flag (a für alle) übergeben.\n\n<pre>$ ls -a</pre>\n\nEs gibt auch noch ein weiteres nützliches ls-Flag, -l für lang, das zeigt eine detaillierte Liste von Dateien im Langformat an. Dies zeigt Ihnen detaillierte Informationen, beginnend von links: Dateiberechtigungen, Anzahl der Verknüpfungen, Besitzername, Besitzergruppe, Dateigröße, Zeitstempel der letzten Änderung und Datei-/Verzeichnisname.\n\n<pre>$ ls -l</pre>\n\n<pre>pete@icebox:~$ ls -l\ngesamt 80\ndrwxr-x--- 7 pete penguingroup   4096 Nov 20 16:37 Desktop\ndrwxr-x--- 2 pete penguingroup   4096 Okt 19 10:46  Dokumente\ndrwxr-x--- 4 pete penguingroup   4096 Nov 20 09:30 Downloads\ndrwxr-x--- 2 pete penguingroup   4096 Okt  7 13:13   Musik\ndrwxr-x--- 2 pete penguingroup   4096 Sep 21 14:02 Bilder\ndrwxr-x--- 2 pete penguingroup   4096 Jul 27 12:41   Öffentlich\ndrwxr-x--- 2 pete penguingroup   4096 Jul 27 12:41   Vorlagen\ndrwxr-x--- 2 pete penguingroup   4096 Jul 27 12:41   Videos</pre>\n\nBefehle haben sogenannte Flags (oder Argumente oder Optionen, wie auch immer Sie es nennen möchten), um mehr Funktionalität hinzuzufügen. Sehen Sie, wie wir -a und -l hinzugefügt haben, nun, Sie können sie beide zusammen mit -la hinzufügen. Die Reihenfolge der Flags bestimmt, in welcher Reihenfolge sie erscheinen, meistens spielt dies keine Rolle, sodass Sie auch ls -al ausführen können und es würde trotzdem funktionieren.\n\n<pre>$ ls -la</pre>",
  "exercise": "Führen Sie ls mit verschiedenen Flags aus und sehen Sie die Ausgabe, die Sie erhalten.",
  "quizQuestion": "Welchen Befehl würden Sie verwenden, um versteckte Dateien zu sehen?",
  "quizAnswer": "ls -a",
  "slug": "verzeichnisselsbefehl"
}