{
  "id": 4,
  "title": "CPU Überwachung",
  "lessonContent": "Lassen Sie uns einen nützlichen Befehl überprüfen, <b>uptime</b>.\n\n<pre>\npete@icebox:~$ uptime\n 17:23:35 up 1 Tag,  5:59,  2 Benutzer,  durchschnittliche Auslastung: 0.00, 0.02, 0.05\n</pre>\n\nWir haben in der ersten Lektion dieses Kurses über die Betriebszeit gesprochen, aber wir haben das Feld der durchschnittlichen Auslastung noch nicht behandelt. Durchschnittliche Auslastungen sind eine gute Möglichkeit, die CPU-Auslastung auf Ihrem System zu sehen. Diese Zahlen repräsentieren die durchschnittliche CPU-Auslastung in 1, 5 und 15 Minuten Intervallen. Was meine ich mit CPU-Auslastung? Die CPU-Auslastung ist die durchschnittliche Anzahl von Prozessen, die darauf warten, von der CPU ausgeführt zu werden.\n\nAngenommen, Sie haben eine Single-Core-CPU, denken Sie an diesen Kern als eine einzelne Spur im Verkehr. Wenn es Stoßzeiten auf der Autobahn gibt, wird diese Spur sehr beschäftigt sein und der Verkehr wird bei 100% oder einer Auslastung von 1 sein. Nun ist der Verkehr so schlecht geworden, dass er die Autobahn blockiert und die normalen Straßen um das Zweifache der üblichen Anzahl von Autos beschäftigt, wir können sagen, dass Ihre Auslastung 200% oder eine Auslastung von 2 beträgt. Angenommen, es klärt sich etwas auf und es gibt nur noch halb so viele Autos auf der Autobahnspur, dann können wir sagen, dass die Auslastung der Spur 0,5 beträgt. Wenn der Verkehr nicht existent ist und wir schneller nach Hause kommen können, sollte die Auslastung idealerweise sehr niedrig sein, wie der Verkehr um 2 Uhr morgens. Die Autos sind in diesem Fall Prozesse und diese Prozesse warten nur darauf, von der Autobahn abzufahren und nach Hause zu kommen.\n\nNur weil Sie eine durchschnittliche Auslastung von 1 haben, bedeutet das nicht, dass Ihr Computer herumschleppt. Die meisten modernen Maschinen haben heutzutage mehrere Kerne. Wenn Sie beispielsweise einen Quad-Core-Prozessor (4 Kerne) haben und Ihre durchschnittliche Auslastung 1 beträgt, betrifft es tatsächlich nur 25% Ihrer CPU. Denken Sie bei jedem Kern an eine Spur im Verkehr. Sie können die Anzahl der Kerne auf Ihrem System mit <b>cat /proc/cpuinfo</b> anzeigen.\n\nBeim Beobachten der durchschnittlichen Auslastung müssen Sie die Anzahl der Kerne berücksichtigen. Wenn Sie feststellen, dass Ihr Computer immer eine überdurchschnittliche Auslastung aufweist, könnte etwas nicht stimmen.",
  "exercise": "Überprüfen Sie die durchschnittliche Auslastung Ihres Systems und sehen Sie, was sie macht.",
  "quizQuestion": "Welchen Befehl können Sie verwenden, um die durchschnittliche Auslastung zu sehen?",
  "quizAnswer": "uptime",
  "slug": "cpumonitoring"
}