{
  "id": 5,
  "title": "I/O Überwachung",
  "lessonContent": "Wir können auch die CPU-Auslastung überwachen sowie die Festplattenauslastung mit einem praktischen Tool namens <b>iostat</b>\n\n<pre>\npete@icebox:~$ iostat\nLinux 3.13.0-39-lowlatency (icebox)     28.01.2016      _i686_  (1 CPU)\n\navg-cpu:  %user   %nice %system %iowait  %steal   %idle\n           0,13    0,03    0,50    0,01    0,00   99,33\n\nDevice:            tps    kB_read/s    kB_wrtn/s    kB_read    kB_wrtn\nsda               0,17         3,49         1,92     385106     212417\n</pre>\n\nDer erste Teil enthält die CPU-Informationen:\n\n<ul>\n<li>%user - Zeigt den Prozentsatz der CPU-Auslastung an, der beim Ausführen auf Benutzerebene (Anwendung) auftrat</li>\n<li>%nice - Zeigt den Prozentsatz der CPU-Auslastung an, der beim Ausführen auf Benutzerebene mit einer angenehmen Priorität auftrat. Benutzer-CPU-Auslastung mit angenehmen Prioritäten</li>\n<li>%system - Zeigt den Prozentsatz der CPU-Auslastung an, der beim Ausführen auf Systemebene (Kernel) auftrat.</li>\n<li>%iowait - Zeigt den Prozentsatz der Zeit an, in der die CPU oder CPUs untätig waren, während das System eine ausstehende Festplatten-E/A-Anforderung hatte.</li>\n<li>%steal - Zeigt den Prozentsatz der Zeit an, die die virtuelle CPU oder CPUs in unfreiwilliger Wartezeit verbracht haben, während der Hypervisor einen anderen virtuellen Prozessor bediente.</li>\n<li>%idle - Zeigt den Prozentsatz der Zeit an, in der die CPU oder CPUs untätig waren und das System keine ausstehende Festplatten-E/A-Anforderung hatte.</li>\n</ul>\n\nDer zweite Teil betrifft die Festplattenauslastung:\n\n<ul>\n<li>tps - Gibt die Anzahl der Transfers pro Sekunde an, die an das Gerät gesendet wurden. Ein Transfer ist eine E/A-Anforderung an das Gerät. Mehrere logische Anforderungen können zu einer einzelnen E/A-Anforderung an das Gerät kombiniert werden. Die Größe eines Transfers ist unbestimmt.</li>\n<li>kB_read/s - Gibt die Menge der vom Gerät gelesenen Daten in Kilobyte pro Sekunde an.</li>\n<li>kB_wrtn/s - Gibt die Menge der auf das Gerät geschriebenen Daten in Kilobyte pro Sekunde an.</li>\n<li>kB_read - Die Gesamtzahl der gelesenen Kilobyte.</li>\n<li>kB_wrtn - Die Gesamtzahl der geschriebenen Kilobyte.</li>\n</ul>",
  "exercise": "Verwenden Sie iostat, um Ihre Festplattenauslastung anzuzeigen.",
  "quizQuestion": "Welcher Befehl kann verwendet werden, um die I/O- und CPU-Auslastung anzuzeigen?",
  "quizAnswer": "iostat",
  "slug": "iomonitoring"
}