{
  "id": 2,
  "title": "lsof und fuser",
  "lessonContent": "Angenommen, Sie haben ein USB-Laufwerk angeschlossen und an einigen Dateien gearbeitet. Sobald Sie fertig waren, trennen Sie das USB-Gerät und erhalten den Fehler \"Gerät oder Ressource belegt\". Wie finden Sie heraus, welche Dateien auf dem USB-Laufwerk noch verwendet werden? Es gibt tatsächlich zwei Tools, die Sie dafür verwenden können: \n\n<b>lsof</b>\n\nDenken Sie daran, dass Dateien nicht nur Textdateien, Bilder usw. sind, sondern alles im System, Festplatten, Pipes, Netzwerk-Sockets, Geräte usw. Um zu sehen, was von einem Prozess verwendet wird, können Sie das lsof-Kommando (kurz für \"Liste offener Dateien\") verwenden. Dies zeigt Ihnen eine Liste aller offenen Dateien und ihrer zugehörigen Prozesse an. \n\n<pre>\npete@icebox:~$ lsof .\nCOMMAND    PID  USER   FD   TYPE DEVICE SIZE/OFF NODE NAME\nlxsession 1491 pete  cwd    DIR    8,6     4096  131 .\nupdate-no 1796 pete  cwd    DIR    8,6     4096  131 .\nnm-applet 1804 pete  cwd    DIR    8,6     4096  131 .\nindicator 1809 pete  cwd    DIR    8,6     4096  131 .\nxterm     2205 pete  cwd    DIR    8,6     4096  131 .\nbash      2207 pete  cwd    DIR    8,6     4096  131 .\nlsof      5914 pete  cwd    DIR    8,6     4096  131 .\nlsof      5915 pete  cwd    DIR    8,6     4096  131 .\n</pre>\n\nJetzt kann ich sehen, welche Prozesse das Gerät/die Datei noch geöffnet haben. In unserem USB-Beispiel können Sie diese Prozesse auch beenden, damit wir dieses lästige Laufwerk aushängen können.\n\n<b>fuser</b>\n\nEine weitere Möglichkeit, einen Prozess zu verfolgen, ist das fuser-Kommando (kurz für \"Dateinutzer\"), dies zeigt Ihnen Informationen über den Prozess, der die Datei verwendet, oder den Dateinutzer an. \n\n<pre>\npete@icebox:~$ fuser -v .\n                     USER        PID ACCESS COMMAND\n/home/pete:         pete  1491 ..c.. lxsession\n                     pete  1796 ..c.. update-notifier\n                     pete  1804 ..c.. nm-applet\n                     pete  1809 ..c.. indicator-power\n                     pete  2205 ..c.. xterm\n                     pete  2207 ..c.. bash\n</pre>\n\nWir können sehen, welche Prozesse gerade unser /home/pete-Verzeichnis verwenden. Die lsof- und fuser-Tools sind sehr ähnlich, machen Sie sich mit diesen Tools vertraut und versuchen Sie sie das nächste Mal zu verwenden, wenn Sie eine Datei oder einen Prozess verfolgen müssen.",
  "exercise": "Lesen Sie die Handbücher für lsof und fuser, es gibt viele Informationen, die wir nicht behandelt haben, die es Ihnen ermöglichen, diese Tools flexibler einzusetzen.",
  "quizQuestion": "Welches Kommando wird verwendet, um offene Dateien und ihre Prozessinformationen aufzulisten?",
  "quizAnswer": "lsof",
  "slug": "trackingprocesseslsoffuser"
}