{
  "id": 1,
  "title": "Prozesse verfolgen: top",
  "lessonContent": "In diesem Kurs werden wir besprechen, wie Sie die Ressourcennutzung auf Ihrem System lesen und analysieren können. Diese Lektion zeigt einige großartige Tools, die Sie verwenden können, wenn Sie verfolgen müssen, was ein Prozess tut. \n\n<b>top</b>\n\nWir haben top bereits besprochen, aber wir werden uns genauer damit befassen, was es tatsächlich anzeigt. Denken Sie daran, dass top das Tool ist, das wir verwenden, um eine Echtzeitansicht der Systemnutzung durch unsere Prozesse zu erhalten:\n\n<pre>\ntop - 18:06:26 up 6 Tage,  4:07,  2 Benutzer,  durchschnittliche Auslastung: 0,92, 0,62, 0,59\nAufgaben: 389 insgesamt,   1 laufend, 387 schlafend,   0 gestoppt,   1 Zombie\n%Cpu(s):  1,8 Ben,  0,4 sys,  0,0 ni, 97,6 id,  0,1 wa,  0,0 hi,  0,0 si,  0,0 st\nKiB Speicher:  32870888 insgesamt, 27467976 verwendet,  5402912 frei,   518808 Puffer\nKiB Swap: 33480700 insgesamt,    39892 verwendet, 33440808 frei. 19454152 zwischengespeicherter Speicher\n\n  PID BENUTZER      PR  NI    VIRT    RES    SHR S  %CPU %MEM     ZEIT+ BEFEHL                             \n 6675 patty    20   0 1731472 520960  30876 S   8,3  1,6 160:24,79 chrome                             \n 6926 patty    20   0  935888 163456  25576 S   4,3  0,5   5:28,13 chrome \n</pre>\n\nLassen Sie uns über die Bedeutung dieser Ausgabe sprechen. Sie müssen sich das nicht merken, aber kommen Sie darauf zurück, wenn Sie eine Referenz benötigen.\n\n<b>1. Zeile: Dies sind die gleichen Informationen, die Sie sehen würden, wenn Sie den uptime-Befehl ausführen würden (weitere Informationen folgen)</b>\n\nDie Felder sind von links nach rechts:\n<ol>\n<li>Aktuelle Zeit</li>\n<li>Wie lange das System bereits läuft</li>\n<li>Wie viele Benutzer derzeit angemeldet sind</li>\n<li>Systemdurchschnittslast (weitere Informationen folgen)</li>\n</ol>\n\n<b>2. Zeile: Aufgaben, die ausgeführt, schlafend, gestoppt und als Zombie markiert sind</b>\n\n<b>3. Zeile: CPU-Informationen</b>\n\n<ol>\n<li>us: Benutzer-CPU-Zeit - Prozentsatz der CPU-Zeit, die mit der Ausführung von Benutzerprozessen verbracht wird, die nicht nett sind.</li>\n<li>sy: System-CPU-Zeit - Prozentsatz der CPU-Zeit, die mit der Ausführung des Kernels und der Kernelprozesse verbracht wird</li>\n<li>ni: Nette CPU-Zeit - Prozentsatz der CPU-Zeit, die mit der Ausführung von netten Prozessen verbracht wird</li>\n<li>id: CPU-Idle-Zeit - Prozentsatz der CPU-Zeit, die im Leerlauf verbracht wird</li>\n<li>wa: I/O-Wartezeit - Prozentsatz der CPU-Zeit, die auf E/A-Wartezeiten entfällt. Wenn dieser Wert niedrig ist, liegt das Problem wahrscheinlich nicht bei der Festplatte oder dem Netzwerk-I/O</li> \n<li>hi: Hardware-Interrupts - Prozentsatz der CPU-Zeit, der für die Bedienung von Hardware-Interrupts aufgewendet wird</li>\n<li>si: Software-Interrupts - Prozentsatz der CPU-Zeit, der für die Bedienung von Software-Interrupts aufgewendet wird</li>\n<li>st: Stahlzeit - Wenn Sie virtuelle Maschinen ausführen, ist dies der Prozentsatz der CPU-Zeit, der Ihnen für andere Aufgaben entzogen wurde</li>\n</ol>\n\n<b>4. und 5. Zeile: Speichernutzung und Swap-Nutzung</b>\n\n<b>Liste der aktuell verwendeten Prozesse</b>\n\n<ol>\n<li>PID: ID des Prozesses</li>\n<li>BENUTZER: Benutzer, der Eigentümer des Prozesses ist</li>\n<li>PR: Priorität des Prozesses</li>\n<li>NI: Der Nettowert</li>\n<li>VIRT: Virtueller Speicher, der vom Prozess verwendet wird</li>\n<li>RES: Physischer Speicher, der vom Prozess verwendet wird</li>\n<li>SHR: Gemeinsamer Speicher des Prozesses</li>\n<li>S: Gibt den Status des Prozesses an: S=Schlafend, R=Laufend, Z=Zombie, D=Ununterbrechbar, T=Gestoppt</li>\n<li>%CPU - dies ist der Prozentsatz der CPU, der von diesem Prozess verwendet wird</li>\n<li>%MEM - Prozentsatz des RAMs, der von diesem Prozess verwendet wird</li>\n<li>ZEIT+ - Gesamtaktivitätszeit dieses Prozesses</li>\n<li>BEFEHL - Name des Prozesses</li>\n</ol>\n\nSie können auch eine Prozess-ID angeben, wenn Sie nur bestimmte Prozesse verfolgen möchten:\n\n<pre>$ top -p 1</pre>",
  "exercise": "Spielen Sie mit dem top-Befehl herum und sehen Sie, welche Prozesse die meisten Ressourcen verwenden.",
  "quizQuestion": "Welcher Befehl zeigt die gleiche Ausgabe wie die erste Zeile in top an?",
  "quizAnswer": "uptime",
  "slug": "trackingprocessestop"
}