{
  "id": 3,
  "title": "Ruta de un Paquete",
  "lessonContent": "<b>Veamos cómo viaja un paquete dentro de su red local</b>\n\n<ol>\n<li>Primero, la máquina local comparará la dirección IP de destino para ver si está en la misma subred mirando su máscara de subred.</li>\n<li>Cuando se envían paquetes, necesitan tener una dirección MAC de origen, dirección MAC de destino, dirección IP de origen y dirección IP de destino, en este punto no conocemos la dirección MAC de destino.</li>\n<li>Para llegar al host de destino, usamos ARP para difundir una solicitud en la red local para encontrar la dirección MAC del host de destino.</li>\n<li>¡Ahora el paquete puede ser enviado con éxito!</li>\n</ol>\n\n<b>Veamos cómo viaja un paquete fuera de su red</b>\n\n<ol>\n<li>Primero, la máquina local comparará la dirección IP de destino, como está fuera de nuestra red, no ve la dirección MAC del host de destino. Y no podemos usar ARP porque la solicitud ARP es una difusión a los hosts conectados localmente.</li>\n<li>Entonces nuestro paquete ahora mira la tabla de enrutamiento, no conoce la dirección de la IP de destino, por lo que la envía al gateway predeterminado (otro enrutador). Ahora nuestro paquete contiene nuestra IP de origen, IP de destino y MAC de origen, sin embargo no tenemos un MAC de destino. Recuerda que las direcciones MAC solo se alcanzan a través de la misma red. ¿Qué hace entonces? Envía una solicitud ARP para obtener la dirección MAC del gateway predeterminado.</li>\n<li>El enrutador mira el paquete y confirma la dirección MAC de destino, pero no es la dirección IP de destino final, por lo que sigue mirando la tabla de enrutamiento para reenviar el paquete a otra dirección IP que pueda ayudar al paquete a avanzar hacia su destino. Cada vez que el paquete se mueve, elimina las direcciones MAC de origen y destino antiguas y actualiza el paquete con las nuevas direcciones MAC de origen y destino.</li>\n<li>Una vez que el paquete se reenvía a la misma red, usamos ARP para encontrar la dirección MAC de destino final</li>\n<li>Durante este proceso, nuestro paquete no cambia la dirección IP de origen o destino.</li>\n</ol>",
  "exercise": "No hay ejercicios para esta lección.",
  "quizQuestion": "¿Cómo encontramos la dirección MAC de una dirección IP?",
  "quizAnswer": "ARP",
  "slug": "ruta-de-un-paquete"
}