{
  "id": 2,
  "title": "Tabla de enrutamiento",
  "lessonContent": "Mira la tabla de enrutamiento de tu máquina:\n\n<pre>\npete@icebox:~$ sudo route -n\nTabla de enrutamiento IP del kernel\nDestino         Puerta de enlace         Máscara de red         Banderas Métrica Ref    Uso Interfaz\n0.0.0.0         192.168.224.2   0.0.0.0         UG    0      0        0 eth0\n192.168.224.0   0.0.0.0         255.255.255.0   U     1      0        0 eth0\n</pre>\n\n<b>Destino</b>\n\nEn el primer campo, tenemos una dirección IP de destino de 192.168.224.0, esto indica que cualquier paquete que intente ir a esta red, saldrá a través de mi cable Ethernet (eth0). Si yo fuera 192.168.224.5 y quisiera llegar a 192.168.224.7, simplemente usaría la interfaz de red eth0 directamente.\n\nObserva que tenemos direcciones de <b>0.0.0.0</b>, esto significa que no se especifica ninguna dirección o es desconocida. Entonces, si por ejemplo, quisiera enviar un paquete a la dirección IP 151.123.43.6, nuestra tabla de enrutamiento no sabe a dónde va eso, por lo que lo denota como 0.0.0.0 y por lo tanto enruta nuestro paquete hacia la Puerta de enlace.\n\n<b>Puerta de enlace</b>\n\nSi estamos enviando un paquete que no está en la misma red, se enviará a esta dirección de Puerta de enlace. Que recibe el nombre adecuado de ser una Puerta de enlace a otra red.\n\n<b>Máscara de red</b>\n\nEsta es la máscara de subred, utilizada para determinar qué direcciones IP coinciden con qué destino.\n\n<b>Banderas</b>\n\n<ul>\n<li>UG - La red está activa y es una Puerta de enlace</li>\n<li>U - La red está activa</li>\n</ul>\n\n<b>Interfaz</b>\n\nEsta es la interfaz por la cual nuestro paquete saldrá, eth0 generalmente representa el primer dispositivo Ethernet en tu sistema.",
  "exercise": "Mira tu tabla de enrutamiento y ve a dónde pueden ir tus paquetes.",
  "quizQuestion": "¿A dónde se enrutan los paquetes si nuestra tabla de enrutamiento no lo sabe?",
  "quizAnswer": "Puerta de enlace",
  "slug": "tablaenrutamiento"
}