{
  "id": 1,
  "title": "¿Qué es un enrutador?",
  "lessonContent": "Hemos utilizado este término enrutador antes, espero que sepas qué es, ya que probablemente tienes uno en tu casa. Un enrutador permite que las máquinas en una red se comuniquen entre sí, así como con otras redes. En un enrutador típico, tendrás puertos LAN que permiten que tus máquinas se conecten a la misma red de área local y también tendrás un puerto de enlace a Internet que te conecta a Internet, a veces verás que este puerto se etiqueta como WAN, porque esencialmente te conecta a una red más amplia. Cuando realizamos cualquier tipo de actividad de red, tiene que pasar por el enrutador. El enrutador decide hacia dónde van nuestros paquetes de red y cuáles entran. Enruta nuestros paquetes entre múltiples redes para llegar desde su host de origen a su host de destino. \n\n<b>¿Cómo funciona un enrutador?</b>\n\nPiensa en el enrutamiento de la misma manera que en la entrega de correo, tenemos una dirección a la que queremos enviar una carta, cuando la enviamos a la oficina de correos, ellos reciben la carta y ven, oh, esto va a California, la pondré en el camión que va a California (sinceramente no tengo idea de cómo funciona el sistema postal). Luego la carta se envía a San Francisco, dentro de San Francisco hay diferentes códigos postales, y luego en esos códigos postales hay códigos de direcciones más pequeños, hasta que finalmente alguien puede entregar tu carta a la dirección que querías. Por otro lado, si ya vivieras en San Francisco y en el mismo código postal, el repartidor de correo probablemente sabrá exactamente a dónde tiene que ir la carta sin entregársela a nadie más. \n\nCuando enrutamos paquetes, utilizan rutas de direcciones similares, como para llegar a la red A, enviar estos paquetes a la red B. Cuando no tenemos una ruta establecida para eso, tenemos una ruta predeterminada que utilizarán nuestros paquetes. Estas rutas se establecen en una tabla de enrutamiento que nuestro sistema utiliza para guiarnos a través de las redes.\n\n<b>Saltos</b>\n\nA medida que los paquetes se mueven a través de las redes, viajan en saltos, un salto es cómo medimos aproximadamente la distancia que el paquete debe recorrer para llegar desde el origen al destino. Digamos que tengo dos enrutadores conectando el host A con el host B, por lo tanto decimos que hay dos saltos entre el host A y el host B. Cada salto es un dispositivo intermedio como los enrutadores por los que debemos pasar.\n\n<b>Comprender la diferencia básica entre Conmutación, Enrutamiento y Difusión</b>\nLa CONMUTACIÓN de paquetes básicamente consiste en recibir, procesar y reenviar datos al dispositivo de destino.\nEl ENRUTAMIENTO es un proceso de creación de la tabla de enrutamiento, para que podamos hacer la CONMUTACIÓN de manera más eficiente.\nAntes del enrutamiento, se utilizaba la DIFUSIÓN. Si un enrutador no sabe a dónde enviar un paquete, entonces cada paquete entrante se envía a través de cada enlace de salida excepto por el que llegó.",
  "exercise": "No hay ejercicios para esta lección.",
  "quizQuestion": "¿Cómo miden distancia los paquetes?",
  "quizAnswer": "saltos",
  "slug": "queesunenrutador"
}