{
  "id": 9,
  "title": "Présentation du DHCP",
  "lessonContent": "Un concept réseau important que nous n'avons pas encore abordé est le DHCP (Dynamic Host Configuration Protocol)\n\nLe DHCP attribue des adresses IP, des masques de sous-réseau et des passerelles à nos machines. Par exemple, disons que vous avez un téléphone portable et que vous voulez obtenir un numéro de téléphone pour commencer à parler aux gens. Vous devez appeler votre opérateur téléphonique et ils vous donneront un numéro. Tant que vous payez vos factures, vous pouvez continuer à utiliser votre téléphone. Le DHCP est l'opérateur téléphonique dans ce cas, il vous attribue une adresse IP afin que vous puissiez communiquer avec d'autres adresses IP. Vous avez également une adresse IP en location, celles-ci durent pendant une certaine période, puis seront renouvelées en fonction de vos paramètres de location. \n\nLe DHCP est excellent pour de nombreuses raisons, il permet à un administrateur réseau de ne pas se soucier de l'attribution des adresses IP et l'empêche également de configurer des adresses IP en double. Chaque réseau physique devrait avoir son propre serveur DHCP afin qu'un hôte puisse demander une adresse IP. Dans un environnement domestique classique, le routeur agit généralement en tant que serveur DHCP.\n\nLa manière dont le DHCP obtient toutes vos informations d'hôte dynamiques est la suivante :\n\n<ol>\n<li>DHCP DISCOVER - Ce message est diffusé pour rechercher un serveur DHCP.</li>\n<li>DHCP OFFER - Le serveur DHCP du réseau répond avec un message d'offre. L'offre contient un paquet avec le temps de bail DHCP, le masque de sous-réseau, l'adresse IP, etc.</li>\n<li>DHCP REQUEST - Le client envoie une autre diffusion pour informer tous les serveurs DHCP de l'offre qu'il a acceptée.</li>\n<li>DHCP ACK - L'accusé de réception est envoyé par le serveur.</li>\n</ol>\n\nLe DHCP devient plus complexe que cela, mais voilà l'essentiel.",
  "exercise": "Pas d'exercices pour cette leçon.",
  "quizQuestion": "Quelles sont les étapes d'une demande DHCP?",
  "quizAnswer": "DISCOVER, OFFER, REQUEST, ACK",
  "slug": "dhcpoverview"
}