{
  "id": 8,
  "title": "Couche de liaison",
  "lessonContent": "Au bas du modèle TCP/IP se trouve la couche de liaison. Cette couche est la couche spécifique au matériel.\n\nDans la couche de liaison, notre paquet est encapsulé une fois de plus dans quelque chose appelé un cadre. L'en-tête du cadre attache les adresses MAC source et destination de nos hôtes, les sommes de contrôle et les séparateurs de paquets afin que le récepteur puisse savoir quand un paquet se termine. \n\nHeureusement, nous sommes sur le même réseau, donc notre paquet n'aura pas à parcourir une grande distance. Tout d'abord, la couche de liaison attache mon adresse MAC source à l'en-tête du cadre, mais elle doit également connaître l'adresse MAC de Patty. Comment le sait-elle et comment puis-je la trouver puisqu'elle n'est pas sur Internet ? Nous utilisons ARP !\n\n<b>ARP (protocole de résolution d'adresse)</b>\n\nARP trouve l'adresse MAC associée à une adresse IP. ARP est utilisé dans le même réseau. Si Patty n'était pas sur le même réseau, nous utiliserions un système de routage pour déterminer le prochain routeur qui recevrait le paquet et une fois que nous serions sur le même réseau, nous pourrions utiliser ARP. \n\nUne fois sur le même réseau, les systèmes utilisent d'abord la table de recherche ARP qui stocke des informations sur quelles adresses IP sont associées à quelles adresses MAC. Si la valeur n'est pas là, alors ARP est utilisé. Ensuite, le système enverra un message de diffusion sur le réseau en utilisant le protocole ARP pour savoir quel hôte possède l'IP 10.10.1.4. Un message de diffusion est un message spécial envoyé à tous les hôtes d'un réseau (nommé de manière appropriée pour l'envoi d'une diffusion). Toute machine avec l'adresse IP demandée répondra avec un paquet ARP contenant l'adresse IP et l'adresse MAC.\n\nMaintenant que nous avons toutes les données nécessaires, adresse IP et adresses MAC, notre couche de liaison transmet ce cadre via notre carte réseau, jusqu'au prochain appareil et trouve le réseau de Patty. Cette étape est un peu plus complexe que ce que je viens d'expliquer, mais nous discuterons de plus de détails dans le cours sur le routage.\n\nEt voilà un parcours de paquet simple (ou pas si simple) dans la couche TCP/IP. Gardez à l'esprit que les paquets ne voyagent pas de cette façon unidirectionnelle. Nous n'avons même pas encore atteint le réseau de Patty ! Lorsqu'on voyage à travers les réseaux, il faut passer par le modèle TCP/IP au moins deux fois avant que des données ne soient envoyées ou reçues. En réalité, l'aspect de ce paquet serait quelque chose comme ceci : \n\n<b>Parcours de paquet</b>\n\n<ol>\n<li>Pete envoie un email à Patty : ces données sont envoyées à la couche transport.</li>\n<li>La couche transport encapsule les données dans un en-tête TCP ou UDP pour former un segment, le segment attache les ports TCP ou UDP de destination et source, puis le segment est envoyé à la couche réseau.</li>\n<li>La couche réseau encapsule le segment TCP à l'intérieur d'un paquet IP, elle attache les adresses IP source et destination. Puis route le paquet vers la couche de liaison.</li>\n<li>Le paquet atteint ensuite le matériel physique de Pete et est encapsulé dans un cadre. Les adresses MAC source et destination sont ajoutées au cadre.</li>\n<li>Patty reçoit ce cadre de données via sa couche physique et vérifie chaque cadre pour l'intégrité des données, puis désencapsule le contenu du cadre et envoie le paquet IP à la couche réseau.</li>\n<li>La couche réseau lit le paquet pour trouver l'adresse IP source et destination qui était précédemment attachée. Elle vérifie si son IP est la même que l'IP de destination, ce qui est le cas ! Elle désencapsule le paquet et envoie le segment à la couche transport.</li>\n<li>La couche transport désencapsule les segments, vérifie les numéros de port TCP ou UDP et établit une connexion à la couche application en fonction de ces numéros de port.</li>\n<li>La couche application reçoit les données de la couche transport sur le port spécifié et les présente à Patty sous la forme du message email final</li>\n</ol>",
  "exercise": "Aucun exercice pour cette leçon.",
  "quizQuestion": "Qu'est-ce qui est utilisé pour trouver l'adresse MAC sur le même réseau ?",
  "quizAnswer": "ARP",
  "slug": "couche-de-lien"
}