{
  "id": 4,
  "title": "Adressage réseau",
  "lessonContent": "Avant de voir comment un paquet se déplace à travers un réseau, nous devons nous familiariser avec certains termes. Lorsque vous envoyez une lettre, vous devez savoir à qui elle est destinée et d'où elle provient. Les paquets ont besoin des mêmes informations, nos hôtes et d'autres hôtes sont identifiés à l'aide d'adresses MAC (media access control) et d'adresses IP, pour faciliter les choses pour nous, les humains, nous utilisons des noms d'hôtes pour identifier un hôte.\n\n<b>Adresses MAC</b>\n\nUne adresse MAC est un identifiant unique utilisé comme adresse matérielle. Cette adresse ne changera jamais. Lorsque vous voulez accéder à Internet, votre machine doit avoir un périphérique appelé une carte réseau. Cet adaptateur réseau a sa propre adresse matérielle qui est utilisée pour identifier votre machine. Une adresse MAC pour un périphérique Ethernet ressemble à ceci 00:C4:B5:45:B2:43. Les adresses MAC sont attribuées aux adaptateurs réseau lors de leur fabrication. Chaque fabricant a un identifiant unique organisationnel (OUI) pour les identifier en tant que fabricant. Cet OUI est indiqué par les 3 premiers octets de l'adresse MAC. Par exemple, Dell a 00-14-22, donc un adaptateur réseau de Dell pourrait avoir une adresse MAC comme: 00-14-22-34-B2-C2. \n\n<b>Adresses IP</b>\n\nUne adresse IP est utilisée pour identifier un appareil sur un réseau, elles sont indépendantes du matériel et peuvent varier en syntaxe en fonction de l'utilisation d'IPv4 ou IPv6 (nous en parlerons plus tard). Pour l'instant, nous supposerons que vous utilisez IPv4, donc une adresse IP typique ressemblerait à ceci: 10.24.12.4. Les adresses IP sont utilisées du côté logiciel du réseau. Chaque fois qu'un système est connecté à Internet, il doit avoir une adresse IP. Elles peuvent également changer si votre réseau change et sont uniques à l'ensemble d'Internet (ce n'est pas toujours le cas une fois que nous en apprenons davantage sur NAT). \n\nN'oubliez pas qu'il faut à la fois du logiciel et du matériel pour déplacer des paquets à travers les réseaux, nous avons donc deux identifiants pour chacun, MAC (matériel) et IP (logiciel).\n\n<b>Noms d'hôtes</b>\n\nUne dernière façon d'identifier vos machines est à travers le nom d'hôte. Les noms d'hôtes prennent votre adresse IP et vous permettent de lier cette adresse à un nom lisible par un humain. Au lieu de se souvenir de 192.12.41.4, vous pouvez simplement vous souvenir de monhote.com.",
  "exercise": "Aucun exercice pour cette leçon.",
  "quizQuestion": "Combien d'octets y a-t-il dans une adresse IPv4?",
  "quizAnswer": "4",
  "slug": "adressageréseau"
}