{
  "id": 3,
  "title": "Modèle TCP/IP",
  "lessonContent": "Le modèle OSI a donné naissance à ce qui est finalement devenu le modèle TCP/IP et ce modèle est en fait sur lequel Internet est basé. C'est la mise en œuvre réelle du réseau. Le modèle TCP/IP utilise la suite de protocoles TCP/IP, que nous appelons simplement TCP/IP. Ces protocoles travaillent ensemble pour spécifier comment les données doivent être collectées, adressées, transmises et routées à travers un réseau. En utilisant le modèle TCP/IP, nous pouvons voir comment ces protocoles sont utilisés pour montrer le déroulement du voyage d'un paquet à travers le réseau.\n\n<b>Couche Application</b>\n\nLa couche supérieure du modèle TCP/IP. Elle détermine comment les programmes de votre ordinateur (comme votre navigateur web) interagissent avec les services de la couche transport pour visualiser les données qui sont envoyées ou reçues.\n\nCette couche utilise :\n<ul>\n<li>HTTP (Hypertext Transfer Protocol) - utilisé pour les pages web sur Internet.</li>\n<li>SMTP (Simple Mail Transfer Protocol) - transmission de courrier électronique (email)</li>\n</ul>\n\n<b>Couche Transport</b>\n\nComment les données seront transmises, inclut la vérification des ports corrects, l'intégrité des données, et essentiellement la livraison de nos paquets.\n\nCette couche utilise :\n<ul>\n<li>TCP (Transmission Control Protocol) - livraison fiable des données</li>\n<li>UDP (User Datagram Protocol) - livraison non fiable des données</li>\n</ul>\n\n<b>Couche Réseau</b>\n\nCette couche spécifie comment déplacer les paquets entre les hôtes et à travers les réseaux.\n\nCette couche utilise :\n<ul>\n<li>IP (Internet Protocol) - Aide à router les paquets d'une machine à une autre.</li>\n<li>ICMP (Internet Control Message Protocol) - Aide à nous dire ce qui se passe, comme les messages d'erreur et les informations de débogage.</li>\n</ul>\n\n<b>Couche Liaison</b>\n\nCette couche spécifie comment envoyer des données à travers un morceau de matériel physique. Comme les données qui voyagent à travers Ethernet, la fibre optique, etc.\n\nLes listes ci-dessus des protocoles utilisés par chaque couche ne sont pas exhaustives et vous rencontrerez de nombreux autres protocoles qui entrent en jeu.\n\nDans les leçons suivantes, nous plongerons dans chacune de ces couches et discuterons de la traversée de notre paquet à travers le réseau selon le modèle TCP/IP (il existe de nombreuses perspectives sur la manière dont un paquet voyage à travers les réseaux, nous n'en examinerons pas toutes, mais sachez qu'elles existent).",
  "exercise": "Aucun exercice pour cette leçon.",
  "quizQuestion": "Quelle est la couche supérieure du modèle TCP/IP?",
  "quizAnswer": "Application",
  "slug": "modele-tcpip"
}