{
  "id": 6,
  "title": "Couche de transport",
  "lessonContent": "La couche de transport nous aide à transférer nos données de manière lisible par les réseaux. Elle divise nos données en morceaux qui seront transportés et remis dans le bon ordre. Ces morceaux sont appelés segments. Les segments facilitent le transport des données à travers les réseaux. \n\n<b>Ports</b>\n\nMême si nous savons où nous envoyons nos données via des adresses IP, elles ne sont pas assez spécifiques pour envoyer nos données à des processus ou services spécifiques. Des services tels que HTTP utilisent un canal de communication via des ports. Si nous voulons envoyer des données de page web, nous devons les envoyer sur le port HTTP (port 80). En plus de former des segments, la couche de transport attachera également les ports source et destination au segment, de sorte que lorsque le destinataire reçoit le paquet final, il saura quel port utiliser. \n\n<b>UDP</b>\n\nIl existe deux protocoles de transport populaires, UDP et TCP. Nous discuterons brièvement de l'UDP et passerons la plupart de notre temps sur le TCP, car c'est celui le plus couramment utilisé.\n\nL'UDP n'est pas une méthode fiable de transport de données, en fait, il n'est pas vraiment important si vous recevez toutes vos données d'origine. Cela peut sembler terrible, mais il a ses utilisations, comme pour le streaming multimédia, il est acceptable de perdre quelques trames en retour pour obtenir vos données un peu plus rapidement. \n\n<b>TCP</b>\n\nTCP fournit une connexion fiable orientée vers un flux de données. TCP utilise des ports pour envoyer des données vers et depuis des hôtes. Une application ouvre une connexion d'un port sur son hôte à un autre port sur un hôte distant. Pour établir la connexion, nous utilisons le handshake TCP. \n\n<ul>\n<li>Le client (processus de connexion) envoie un segment SYN au serveur pour demander une connexion</li>\n<li>Le serveur envoie au client un segment SYN-ACK pour accuser réception de la demande de connexion du client</li>\n<li>Le client envoie un ACK au serveur pour accuser réception de la demande de connexion du serveur</li>\n</ul>\n\nUne fois cette connexion établie, les données peuvent être échangées via une connexion TCP. Les données sont envoyées sous forme de segments différents et sont suivies avec des numéros de séquence TCP pour qu'elles puissent être ordonnées dans le bon ordre lors de leur livraison. Dans notre exemple d'e-mail, la couche de transport attache le port de destination (25) au port source de l'hôte source.",
  "exercise": "Aucun exercice pour cette leçon.",
  "quizQuestion": "Quel est un protocole de transport fiable?",
  "quizAnswer": "TCP",
  "slug": "couchedetransport"
}