{
  "id": 3,
  "title": "/etc/passwd",
  "lessonContent": "याद रखें कि उपयोगकर्ताओं के लिए यूजरनेम वास्तव में उपयोगकर्ताओं के लिए पहचान नहीं है। सिस्टम एक उपयोगकर्ता की पहचान के लिए एक उपयोगकर्ता आईडी (UID) का उपयोग करता है। किस आईडी के लिए कौन से उपयोगकर्ता मैप हैं, यह जानने के लिए /etc/passwd फ़ाइल देखें।\n\n<pre>$ cat /etc/passwd</pre>\n\nयह फ़ाइल आपको उपयोगकर्ताओं की सूची और उनके बारे में विस्तृत जानकारी दिखाती है। उदाहरण के लिए, इस फ़ाइल में पहली पंक्ति बहुत संभावना इस तरह दिखती है:\n\n<pre>root:x:0:0:root:/root:/bin/bash</pre>\n\nप्रत्येक पंक्ति एक उपयोगकर्ता के लिए उपयोगकर्ता जानकारी प्रदर्शित करती है, आमतौर पर आप पहली पंक्ति में रूट उपयोगकर्ता को देखेंगे। कोलन द्वारा अलग किए गए कई क्षेत्र हैं जो आपको उपयोगकर्ता के बारे में अतिरिक्त जानकारी देते हैं, चलिए उन्हें सभी देखते हैं:\n\n<ol>\n<li>उपयोगकर्ता नाम</li>\n<li>उपयोगकर्ता का पासवर्ड - पासवर्ड वास्तव में इस फ़ाइल में स्टोर नहीं होता है, आमतौर पर यह /etc/shadow फ़ाइल में स्टोर होता है। हम अगले सबक में अधिक चर्चा करेंगे /etc/shadow के बारे में, लेकिन अब जानें कि इसमें एन्क्रिप्टेड उपयोगकर्ता पासवर्ड होते हैं। आप इस क्षेत्र में कई विभिन्न प्रतीक देख सकते हैं, यदि आप एक \"x\" देखते हैं तो इसका मतलब है कि पासवर्ड /etc/shadow फ़ाइल में स्टोर है, एक \"*\" का मतलब है कि उपयोगकर्ता को लॉगिन एक्सेस नहीं है और यदि एक खाली क्षेत्र है तो इसका मतलब है कि उपयोगकर्ता का कोई पासवर्ड नहीं है।</li>\n<li>उपयोगकर्ता आईडी - जैसा कि आप देख सकते हैं रूट का UID 0 है</li>\n<li>समूह आईडी</li>\n<li>GECOS क्षेत्र - यह उपयोगकर्ता या खाते के बारे में सामान्य टिप्पणियाँ छोड़ने के लिए उपयोग किया जाता है जैसे कि उनका असली नाम या फ़ोन नंबर, यह कॉमा विभाजित है।</li>\n<li>उपयोगकर्ता का होम डायरेक्टरी</li>\n<li>उपयोगकर्ता का शैल - आप शायद देखेंगे कि उपयोगकर्ता अपने शैल के लिए बैश को डिफ़ॉल्ट कर रहे हैं</li>\n</ol>\n\nसामान्यत: एक उपयोगकर्ता की सेटिंग पृष्ठ में, आपको केवल मानव उपयोगकर्ताओं को देखने की उम्मीद होगी। हालांकि, आप देखेंगे कि /etc/passwd में अन्य उपयोगकर्ता हैं। याद रखें कि उपयोगकर्ताएं वास्तव में केवल प्रक्रियाएँ विभिन्न अनुमतियों के साथ चलाने के लिए सिस्टम पर हैं। कभी-कभी हम पूर्व-निर्धारित अनुमतियों के साथ प्रक्रियाएँ चलाना चाहते हैं। उदाहरण के लिए, डेमन उपयोगकर्ता डेमन प्रक्रियाओं के लिए उपयोग किया जाता है।\n\nयह भी ध्यान देना चाहिए कि आप चाहें तो <b>vipw</b> उपकरण के साथ /etc/passwd फ़ाइल को हाथ से संपादित कर सकते हैं यदि आप उपयोगकर्ताओं को जोड़ना और जानकारी संशोधित करना चाहते हैं, हालांकि इस तरह की चीजें उन उपकरणों के लिए छोड़ देना बेहतर है जिनके बारे में हम बाद में सबक में चर्चा करेंगे जैसे कि useradd और userdel।",
  "exercise": "अपनी /etc/passwd फ़ाइल देखें, कुछ उपयोगकर्ताओं को देखें और उनकी पहुंच को नोट करें।",
  "quizQuestion": "यदि एक उपयोगकर्ता को लॉगिन एक्सेस नहीं है तो /etc/passwd में वह कैसे दर्शित होता है?",
  "quizAnswer": "*",
  "slug": "etcpasswdfile"
}