{
  "id": 1,
  "title": "उपयोगकर्ता और समूह",
  "lessonContent": "किसी भी पारंपरिक ऑपरेटिंग सिस्टम में, उपयोगकर्ता और समूह होते हैं। वे केवल पहुंच और अनुमतियों के लिए मौजूद होते हैं। किसी प्रक्रिया को चलाते समय, वह प्रक्रिया के मालिक के रूप में चलेगा चाहे वह जेन हो या बॉब। फ़ाइल पहुंच और स्वामित्व भी अनुमति पर निर्भर करता है। आप चाहेंगे नहीं कि जेन बॉब के दस्तावेज़ देखे और उल्टा। \n\nप्रत्येक उपयोगकर्ता का अपना होम निर्देशिका होता है जहां उनकी उपयोगकर्ता विशिष्ट फ़ाइलें संग्रहित होती हैं, यह आम तौर पर /home/username में स्थित होता है, लेकिन विभिन्न वितरणों में भिन्न हो सकता है। \n\nसिस्टम उपयोगकर्ता आईडी (UID) का उपयोग उपयोगकर्ताओं को प्रबंधित करने के लिए करता है, उपयोगकर्ता नाम उपयोगकर्ताओं को पहचान के लिए मित्रपूर्ण तरीके से जोड़ने का सहज तरीका है, लेकिन सिस्टम उपयोगकर्ताओं को उनके UID द्वारा पहचानता है। सिस्टम अनुमतियों को प्रबंधित करने के लिए समूहों का भी उपयोग करता है, समूह केवल उपयोगकर्ताओं के सेट होते हैं जिनकी अनुमति उस समूह द्वारा सेट की गई होती है, उन्हें सिस्टम उनके समूह आईडी (GID) के साथ पहचानता है।\n\nलिनक्स में, आप उपयोगकर्ता के अतिरिक्त साधारित मानवों के साथ उपयोग करने वाले उपयोगकर्ता होंगे। कभी-कभी ये उपयोगकर्ता सिस्टम डेमन होते हैं जो प्रक्रियाएँ निरंतर चलाते रहते हैं ताकि सिस्टम कार्यरत रहे। सबसे महत्वपूर्ण उपयोगकर्ता में से एक रूट या सुपरउपयोगकर्ता है, रूट सिस्टम पर सबसे शक्तिशाली उपयोगकर्ता है, रूट किसी भी फ़ाइल तक पहुंच सकता है और किसी भी प्रक्रिया को शुरू और समाप्त कर सकता है। उस कारण से, रूट के रूप में हमेशा काम करना खतरनाक हो सकता है, आप संभावित रूप से सिस्टम महत्वपूर्ण फ़ाइलें हटा सकते हैं। भाग्य से, अगर रूट पहुंच की आवश्यकता होती है और किसी उपयोगकर्ता के पास रूट पहुंच होती है, तो वे सुपरउपयोगकर्ता के रूप में एक कमांड चला सकते हैं बजाय रूट के साथ सुपरउपयोगकर्ता के रूप में। सुपरउपयोगकर्ता कमांड (सुपरउपयोगकर्ता करें) का उपयोग रूट पहुंच के साथ किसी कमांड को चलाने के लिए किया जाता है, हम एक बाद में सीखेंगे कि उपयोगकर्ता कैसे रूट पहुंच प्राप्त करता है।\n\nआगे बढ़ें और कोशिश करें किसी संरक्षित फ़ाइल जैसे /etc/shadow को देखने की:\n\n<pre>$ cat /etc/shadow</pre>\n\nध्यान दें कि आपको एक अनुमति निषेध त्रुटि मिलती है, अनुमतियों को देखें: \n\n<pre>$ ls -la /etc/shadow\n\n-rw-r----- 1 root shadow 1134 Dec 1 11:45 /etc/shadow\n</pre>\n\nहमने अभी तक अनुमतियों के माध्यम से नहीं गया है, लेकिन यहाँ क्या हो रहा है यह है कि रूट फ़ाइल का मालिक है और आपको फ़ाइल की सामग्री पढ़ने के लिए रूट पहुंच या शैडो समूह का हिस्सा होना चाहिए। अब सुपरउपयोगकर्ता के साथ कमांड चलाएँ:\n\n<pre>$ sudo cat /etc/shadow</pre>\n\nअब आप फ़ाइल की सामग्री देख सकेंगे!",
  "exercise": "इस पाठ के लिए कोई अभ्यास नहीं है।",
  "quizQuestion": "आप किस कमांड का उपयोग रूट के रूप में करते हैं?",
  "quizAnswer": "सुडो",
  "slug": "usersandgroups"
}