{
  "id": 4,
  "title": "Monitoramento da CPU",
  "lessonContent": "Vamos revisar um comando útil, <b>uptime</b>.\n\n<pre>\npete@icebox:~$ uptime\n 17:23:35 ligado 1 dia,  5:59,  2 usuários,  carga média: 0.00, 0.02, 0.05\n</pre>\n\nNós falamos sobre o uptime na primeira lição deste curso, mas não abordamos o campo de carga média. As cargas médias são uma boa maneira de ver a carga da CPU no seu sistema. Esses números representam a carga média da CPU em intervalos de 1, 5 e 15 minutos. O que eu quero dizer com carga da CPU, a carga da CPU é o número médio de processos que estão esperando para serem executados pela CPU.\n\nDigamos que você tenha uma CPU de núcleo único, pense neste núcleo como uma faixa única no trânsito. Se for hora do rush na rodovia, esta faixa estará muito movimentada e o trânsito estará a 100% ou uma carga de 1. Agora o trânsito ficou tão ruim que está congestionando a rodovia e deixando as estradas regulares movimentadas com o dobro de carros, podemos dizer que sua carga é de 200% ou uma carga de 2. Agora digamos que melhora um pouco e há apenas metade dos carros na faixa da rodovia, podemos dizer que a carga da faixa é 0.5. Quando o trânsito não existe e podemos chegar em casa mais rápido, a carga idealmente deve ser muito baixa, como o trânsito das 2h da manhã. Os carros neste caso são processos e esses processos estão apenas esperando para sair da rodovia e chegar em casa.\n\nApenas porque você tem uma carga média de 1 não significa que seu computador está arrastando. A maioria das máquinas modernas hoje em dia tem vários núcleos. Se você tiver um processador quad-core (4 núcleos) e sua carga média for 1, ela realmente está afetando apenas 25% da sua CPU. Pense em cada núcleo como uma faixa no trânsito. Você pode ver a quantidade de núcleos que tem no seu sistema com <b>cat /proc/cpuinfo</b>.\n\nAo observar a carga média, você precisa levar em conta o número de núcleos, se você perceber que sua máquina está sempre usando uma carga acima da média, pode haver algo errado acontecendo.",
  "exercise": "Verifique a carga média do seu sistema e veja o que está acontecendo.",
  "quizQuestion": "Que comando você pode usar para ver a carga média?",
  "quizAnswer": "uptime",
  "slug": "monitoramentocpu"
}