{
  "id": 5,
  "title": "Monitoramento de E/S",
  "lessonContent": "Também podemos monitorar o uso da CPU, bem como o uso do disco com uma ferramenta útil conhecida como <b>iostat</b>\n\n<pre>\npete@icebox:~$ iostat\nLinux 3.13.0-39-lowlatency (icebox)     01/28/2016      _i686_  (1 CPU)\n\navg-cpu:  %user   %nice %system %iowait  %steal   %idle\n           0.13    0.03    0.50    0.01    0.00   99.33\n\nDevice:            tps    kB_read/s    kB_wrtn/s    kB_read    kB_wrtn\nsda               0.17         3.49         1.92     385106     212417\n</pre>\n\nA primeira parte é a informação da CPU:\n\n<ul>\n<li>%user - Mostra a porcentagem de utilização da CPU que ocorreu durante a execução no nível do usuário (aplicativo)</li>\n<li>%nice - Mostra a porcentagem de utilização da CPU que ocorreu durante a execução no nível do usuário com prioridade nice.utilização da CPU do usuário com prioridades nice</li>\n<li>%system - Mostra a porcentagem de utilização da CPU que ocorreu durante a execução no nível do sistema (kernel).</li>\n<li>%iowait - Mostra a porcentagem de tempo em que a CPU ou CPUs estavam ociosas durante as quais o sistema tinha uma solicitação de E/S de disco pendente.</li>\n<li>%steal - Mostra a porcentagem de tempo gasto em espera involuntária pela CPU virtual ou CPUs enquanto o hipervisor estava atendendo a outro processador virtual.</li>\n<li>%idle - Mostra a porcentagem de tempo em que a CPU ou CPUs estavam ociosas e o sistema não tinha uma solicitação de E/S de disco pendente.</li>\n</ul>\n\nA segunda parte é a utilização do disco:\n\n<ul>\n<li>tps - Indica o número de transferências por segundo que foram emitidas para o dispositivo. Uma transferência é uma solicitação de E/S para o dispositivo. Múltiplas solicitações lógicas podem ser combinadas em uma única solicitação de E/S para o dispositivo. Uma transferência é de tamanho indeterminado.</li>\n<li>kB_read/s - Indica a quantidade de dados lidos do dispositivo expressa em kilobytes por segundo.</li>\n<li>kB_wrtn/s - Indica a quantidade de dados gravados no dispositivo expressa em kilobytes por segundo.</li>\n<li>kB_read - O número total de kilobytes lidos.</li>\n<li>kB_wrtn - O número total de kilobytes gravados.</li>\n</ul>",
  "exercise": "Use o iostat para visualizar o uso do seu disco.",
  "quizQuestion": "Qual comando pode ser usado para visualizar o uso de E/S e da CPU?",
  "quizAnswer": "iostat",
  "slug": "monitoramento-de-e-s"
}