{
  "id": 1,
  "title": "Rastreando processos: top",
  "lessonContent": "Neste curso, vamos aprender como ler e analisar a utilização de recursos em seu sistema, esta lição mostra algumas ótimas ferramentas para usar quando você precisa rastrear o que um processo está fazendo. \n\n<b>top</b>\n\nJá discutimos o top antes, mas vamos nos aprofundar nos detalhes do que ele realmente está exibindo. Lembre-se de que o top é a ferramenta que usamos para obter uma visualização em tempo real da utilização do sistema pelos nossos processos:\n\n<pre>\ntop - 18:06:26 up 6 days,  4:07,  2 usuários,  carga média: 0.92, 0.62, 0.59\nTarefas: 389 no total,   1 em execução, 387 dormindo,   0 parado,   1 zumbi\n%Cpu(s):  1.8 us,  0.4 sy,  0.0 ni, 97.6 id,  0.1 wa,  0.0 hi,  0.0 si,  0.0 st\nKiB Mem:  32870888 total, 27467976 usado,  5402912 livre,   518808 buffers\nKiB Swap: 33480700 total,    39892 usado, 33440808 livre. 19454152 Memória cacheada\n\n  PID USUÁRIO      PR  NI    VIRT    RES    SHR S  %CPU %MEM     TIME+ COMANDO                             \n 6675 patty    20   0 1731472 520960  30876 S   8.3  1.6 160:24.79 chrome                             \n 6926 patty    20   0  935888 163456  25576 S   4.3  0.5   5:28.13 chrome \n</pre>\n\nVamos analisar o que essa saída significa, você não precisa memorizar isso, mas volte a este conteúdo quando precisar de uma referência.\n\n<b>1ª linha: Esta é a mesma informação que você veria se executasse o comando uptime (mais informações a seguir)</b>\n\nOs campos são da esquerda para a direita:\n<ol>\n<li>Tempo atual</li>\n<li>Há quanto tempo o sistema está em execução</li>\n<li>Quantos usuários estão atualmente logados</li>\n<li>Carga média do sistema (mais informações a seguir)</li>\n</ol>\n\n<b>2ª linha: Tarefas em execução, dormindo, paradas e zumbis</b>\n\n<b>3ª linha: Informações da CPU</b>\n\n<ol>\n<li>us: tempo de CPU do usuário - Porcentagem do tempo de CPU gasto executando processos de usuários que não são nice</li>\n<li>sy: tempo de CPU do sistema - Porcentagem do tempo de CPU gasto executando o kernel e processos do kernel</li>\n<li>ni: tempo de CPU nice - Porcentagem do tempo de CPU gasto executando processos nice</li>\n<li>id: tempo de CPU ocioso - Porcentagem do tempo de CPU gasto ocioso</li>\n<li>wa: espera de E/S - Porcentagem do tempo de CPU gasto aguardando E/S. Se esse valor for baixo, o problema provavelmente não é E/S de disco ou rede</li> \n<li>hi: interrupções de hardware - Porcentagem do tempo de CPU gasto atendendo interrupções de hardware</li>\n<li>si: interrupções de software - Porcentagem do tempo de CPU gasto atendendo interrupções de software</li>\n<li>st: tempo de roubo - Se você estiver executando máquinas virtuais, esta é a porcentagem de tempo de CPU que foi roubada de você para outras tarefas</li>\n</ol>\n\n<b>4ª e 5ª linha: Uso de Memória e Uso de Swap</b>\n\n<b>Lista de Processos Atualmente em Uso</b>\n\n<ol>\n<li>PID: Id do processo</li>\n<li>USUÁRIO: usuário que é o proprietário do processo</li>\n<li>PR: Prioridade do processo</li>\n<li>NI: O valor nice</li>\n<li>VIRT: Memória virtual usada pelo processo</li>\n<li>RES: Memória física usada pelo processo</li>\n<li>SHR: Memória compartilhada do processo</li>\n<li>S: Indica o status do processo: S=dormindo, R=em execução, Z=zumbi,D=ininterruptível,T=parado</li>\n<li>%CPU - esta é a porcentagem de CPU usada por este processo</li>\n<li>%MEM - porcentagem de RAM usada por este processo</li>\n<li>TIME+ - tempo total de atividade deste processo</li>\n<li>COMANDO - nome do processo</li>\n</ol>\n\nVocê também pode especificar um ID de processo se quiser rastrear determinados processos:\n\n<pre>$ top -p 1</pre>",
  "exercise": "Experimente o comando top e veja quais processos estão usando mais recursos.",
  "quizQuestion": "Qual comando exibe a mesma saída que a primeira linha no top?",
  "quizAnswer": "uptime",
  "slug": "rastreandoprocessostop"
}