{
  "id": 2,
  "title": "lsof e fuser",
  "lessonContent": "Digamos que você conectou uma unidade USB e começou a trabalhar em alguns arquivos, uma vez que terminou, você desmonta o dispositivo USB e recebe um erro \"Dispositivo ou Recurso Ocupado\". Como você descobriria quais arquivos na unidade USB ainda estão em uso? Na verdade, existem duas ferramentas que você pode usar para isso: \n\n<b>lsof</b>\n\nLembre-se de que arquivos não são apenas arquivos de texto, imagens, etc., são tudo no sistema, discos, pipes, soquetes de rede, dispositivos, etc. Para ver o que está em uso por um processo, você pode usar o comando lsof (abreviação de \"listar arquivos abertos\"), isso mostrará uma lista de todos os arquivos abertos e seus processos associados. \n\n<pre>\npete@icebox:~$ lsof .\nCOMMAND    PID  USER   FD   TYPE DEVICE SIZE/OFF NODE NAME\nlxsession 1491 pete  cwd    DIR    8,6     4096  131 .\nupdate-no 1796 pete  cwd    DIR    8,6     4096  131 .\nnm-applet 1804 pete  cwd    DIR    8,6     4096  131 .\nindicator 1809 pete  cwd    DIR    8,6     4096  131 .\nxterm     2205 pete  cwd    DIR    8,6     4096  131 .\nbash      2207 pete  cwd    DIR    8,6     4096  131 .\nlsof      5914 pete  cwd    DIR    8,6     4096  131 .\nlsof      5915 pete  cwd    DIR    8,6     4096  131 .\n</pre>\n\nAgora posso ver quais processos estão atualmente mantendo o dispositivo/arquivo aberto. Em nosso exemplo USB, você também pode encerrar esses processos para desmontar essa unidade irritante.\n\n<b>fuser</b>\n\nOutra maneira de rastrear um processo é o comando fuser (abreviação de \"file user\"), isso mostrará informações sobre o processo que está usando o arquivo ou o usuário do arquivo. \n\n<pre>\npete@icebox:~$ fuser -v .\n                     USER        PID ACCESS COMMAND\n/home/pete:         pete  1491 ..c.. lxsession\n                     pete  1796 ..c.. update-notifier\n                     pete  1804 ..c.. nm-applet\n                     pete  1809 ..c.. indicator-power\n                     pete  2205 ..c.. xterm\n                     pete  2207 ..c.. bash\n</pre>\n\nPodemos ver quais processos estão usando atualmente nosso diretório /home/pete. As ferramentas lsof e fuser são muito semelhantes, familiarize-se com essas ferramentas e tente usá-las da próxima vez que precisar rastrear um arquivo ou processo.",
  "exercise": "Leia as páginas de manual para lsof e fuser, há muitas informações que não cobrimos que permitem ter maior flexibilidade com essas ferramentas.",
  "quizQuestion": "Qual comando é usado para listar arquivos abertos e suas informações de processo?",
  "quizAnswer": "lsof",
  "slug": "rastreandoprocessoslsoffuser"
}