{
  "id": 1,
  "title": "Überblick über den Bootvorgang",
  "lessonContent": "Nun, da wir ein ziemlich gutes Verständnis einiger wichtiger Komponenten von Linux haben, lassen Sie uns sie alle zusammenfügen, indem wir lernen, wie das System startet. Wenn Sie Ihren Computer einschalten, führt er einige interessante Schritte aus, wie das Anzeigen des Logobildschirms, das Durchlaufen verschiedener Meldungen und schließlich werden Sie mit einem Anmeldefenster aufgefordert. Es passiert tatsächlich eine Menge Dinge zwischen dem Drücken der Ein-/Aus-Taste und dem Anmelden, über die wir in diesem Kurs sprechen werden. \n\nDer Linux-Startvorgang kann in 4 einfache Phasen unterteilt werden: \n\n<b>1. BIOS</b>\n\nDas BIOS (steht für \"Basic Input/Output System\") initialisiert die Hardware und stellt mit einem Power-on-Self-Test (POST) sicher, dass alle Hardware einsatzbereit ist. Die Hauptaufgabe des BIOS besteht darin, den Bootloader zu laden.\n\n<b>2. Bootloader</b>\n\nDer Bootloader lädt den Kernel in den Speicher und startet dann den Kernel mit einer Reihe von Kernelparametern. Einer der häufigsten Bootloader ist GRUB, der ein universeller Linux-Standard ist. \n\n<b>3. Kernel</b>\n\nWenn der Kernel geladen ist, initialisiert er sofort Geräte und Speicher. Die Hauptaufgabe des Kernels besteht darin, den Init-Prozess zu laden. \n\n<b>4. Init</b>\n\nDenken Sie daran, dass der Init-Prozess der erste Prozess ist, der gestartet wird. Init startet und stoppt wichtige Dienstprozesse im System. Es gibt drei Hauptimplementierungen von Init in Linux-Distributionen. Wir werden sie kurz durchgehen und uns dann in einem anderen Kurs näher damit befassen.\n\nDa ist sie, die (sehr) einfache Erklärung des Linux-Startvorgangs. Wir werden in den nächsten Lektionen detaillierter auf diese Phasen eingehen.",
  "exercise": "Starten Sie Ihr System neu und sehen Sie, ob Sie jeden Schritt erkennen können, während Ihr Computer hochfährt.",
  "quizQuestion": "Was ist die letzte Phase im Linux-Startvorgang?",
  "quizAnswer": "init",
  "slug": "bootprocessoverview"
}