{
  "id": 2,
  "title": "Boot-Vorgang: BIOS",
  "lessonContent": "<b>BIOS</b>\n\nDer erste Schritt im Linux-Bootvorgang ist das BIOS, das Integritätsprüfungen des Systems durchführt. Das BIOS ist eine Firmware, die in den meisten IBM-PC-kompatiblen Computern vorkommt, der dominierende Computertyp, der heute auf dem Markt ist. Sie haben wahrscheinlich die BIOS-Firmware verwendet, um die Bootreihenfolge Ihrer Festplatten zu ändern, die Systemzeit zu überprüfen, die MAC-Adresse Ihres Geräts usw. Das Hauptziel des BIOS besteht darin, den System-Bootloader zu finden.\n\nSobald das BIOS die Festplatte hochfährt, sucht es nach dem Bootblock, um herauszufinden, wie das System hochgefahren werden soll. Abhängig davon, wie Sie Ihre Festplatte partitioniert haben, wird nach dem Master Boot Record (MBR) oder GPT gesucht. Der MBR befindet sich im ersten Sektor der Festplatte, den ersten 512 Bytes. Der MBR enthält den Code zum Laden eines anderen Programms irgendwo auf der Festplatte, dieses Programm lädt dann tatsächlich unseren Bootloader hoch.\n\nWenn Sie Ihre Festplatte jedoch mit GPT partitioniert haben, ändert sich die Position des Bootloaders etwas.\n\n<b>UEFI</b>\n\nEs gibt eine andere Möglichkeit, Ihr System hochzufahren, anstatt das BIOS zu verwenden, und das ist mit UEFI (steht für \"Unified Extensible Firmware Interface\"). UEFI wurde als Nachfolger des BIOS konzipiert, die meisten Hardwaregeräte von heute sind mit einer UEFI-Firmware ausgestattet. Macintosh-Maschinen verwenden seit Jahren das EFI-Booten und Windows hat den Großteil seiner Systeme auf das UEFI-Booten umgestellt. Das GPT-Format war für die Verwendung mit EFI vorgesehen. Wenn Sie eine GPT-Festplatte booten, benötigen Sie nicht unbedingt EFI. Der erste Sektor einer GPT-Festplatte ist für einen \"Schutz-MBR\" reserviert, um das Booten auf einem BIOS-basierten Gerät zu ermöglichen.\n\nUEFI speichert alle Informationen zum Startvorgang in einer .efi-Datei. Diese Datei wird auf einer speziellen Partition namens EFI-Systempartition auf der Hardware gespeichert. In dieser Partition befindet sich der Bootloader. UEFI bietet viele Verbesserungen gegenüber der traditionellen BIOS-Firmware. Da wir jedoch Linux verwenden, verwenden die meisten von uns BIOS. Daher werden alle diese Lektionen unter dieser Voraussetzung durchgeführt.",
  "exercise": "Gehen Sie in Ihr BIOS-Menü und prüfen Sie, ob Sie das UEFI-Booten aktiviert haben.",
  "quizQuestion": "Was lädt das BIOS?",
  "quizAnswer": "Bootloader",
  "slug": "bootvorgangbios"
}