{
  "id": 9,
  "title": "Visão Geral do DHCP",
  "lessonContent": "Um conceito importante de rede que ainda não abordamos é o DHCP (Protocolo de Configuração Dinâmica de Host)\n\nO DHCP atribui endereços IP, máscaras de sub-rede e gateways às nossas máquinas. Por exemplo, digamos que você tenha um celular e queira obter um número de celular para começar a falar com as pessoas. Você precisa ligar para sua operadora de telefonia e eles lhe darão um número. Enquanto você pagar suas contas, poderá continuar usando seu telefone. O DHCP é a operadora de telefonia nesse caso, ele fornece a você um endereço IP para que você possa falar com outros endereços IP. Você também recebe um endereço IP em regime de locação, que dura por um determinado período de tempo e será renovado dependendo de como você configurou suas definições de locação. \n\nO DHCP é ótimo por muitas razões, ele permite que um administrador de rede não se preocupe em atribuir endereços IP e também impede a configuração de endereços IP duplicados. Cada rede física deve ter seu próprio servidor DHCP para que um host possa solicitar um endereço IP. Em um ambiente doméstico comum, o roteador geralmente atua como servidor DHCP.\n\nO DHCP obtém todas as suas informações de host dinâmicas da seguinte maneira:\n\n<ol>\n<li>DHCP DISCOVER - Esta mensagem é transmitida para procurar um servidor DHCP.</li>\n<li>DHCP OFFER - O servidor DHCP na rede responde com uma mensagem de oferta. A oferta contém um pacote com tempo de locação DHCP, máscara de sub-rede, endereço IP, etc.</li>\n<li>DHCP REQUEST - O cliente envia outra transmissão para informar a todos os servidores DHCP qual oferta ele aceitou.</li>\n<li>DHCP ACK - O servidor envia um reconhecimento.</li>\n</ol>\n\nO DHCP é mais complexo do que isso, mas esta é a essência dele.",
  "exercise": "Não há exercícios para esta lição.",
  "quizQuestion": "Quais são as etapas em uma solicitação DHCP?",
  "quizAnswer": "DISCOVER, OFFER, REQUEST, ACK",
  "slug": "visao-geral-dhcp"
}