{
  "id": 8,
  "title": "Camada de Ligação",
  "lessonContent": "No fundo do modelo TCP/IP está a Camada de Ligação. Esta camada é a camada específica de hardware.\n\nNa camada de ligação, nosso pacote é encapsulado mais uma vez em algo chamado de quadro. O cabeçalho do quadro anexa os endereços MAC de origem e destino de nossos hosts, checksums e separadores de pacotes para que o receptor possa saber quando um pacote termina. \n\nFelizmente estamos na mesma rede, então nosso pacote não terá que viajar muito longe. Primeiro, a camada de ligação anexa meu endereço MAC de origem ao cabeçalho do quadro, mas também precisa saber o endereço MAC da Patty. Como ele sabe disso e como eu o encontro, já que não está na Internet? Usamos ARP!\n\n<b>ARP (Protocolo de Resolução de Endereços)</b>\n\nO ARP encontra o endereço MAC associado a um endereço IP. O ARP é usado dentro da mesma rede. Se a Patty não estivesse na mesma rede, usaríamos um sistema de roteamento para determinar o próximo roteador que receberia o pacote e uma vez que estivéssemos na mesma rede, poderíamos usar o ARP. \n\nUma vez que estamos na mesma rede, os sistemas primeiro usam a tabela de pesquisa ARP que armazena informações sobre quais endereços IP estão associados a quais endereços MAC. Se o valor não estiver lá, então o ARP é usado. Em seguida, o sistema enviará uma mensagem de broadcast para a rede usando o protocolo ARP para descobrir qual host possui o IP 10.10.1.4. Uma mensagem de broadcast é uma mensagem especial que é enviada para todos os hosts em uma rede (adequadamente nomeada para enviar um broadcast). Qualquer máquina com o endereço IP solicitado responderá com um pacote ARP contendo o endereço IP e o endereço MAC.\n\nAgora que temos todos os dados necessários, endereços IP e MAC, nossa camada de ligação encaminha este quadro através de nosso cartão de interface de rede, para o próximo dispositivo e encontra a rede da Patty. Este passo é um pouco mais complexo do que eu acabei de explicar, mas discutiremos mais detalhes no curso de Roteamento.\n\nE aí está uma travessia de pacotes simples (ou não tão simples) pela camada TCP/IP. Tenha em mente que os pacotes não viajam de forma unidirecional como esta. Ainda nem chegamos à rede da Patty! Ao viajar pelas redes, é necessário passar pelo modelo TCP/IP pelo menos duas vezes antes que quaisquer dados sejam enviados ou recebidos. Na realidade, a aparência deste pacote seria algo assim: \n\n<b>Travessia de Pacotes</b>\n\n<ol>\n<li>Pete envia um e-mail para a Patty: esses dados são enviados para a camada de transporte.</li>\n<li>A camada de transporte encapsula os dados em um cabeçalho TCP ou UDP para formar um segmento, o segmento anexa a porta TCP ou UDP de destino e de origem, em seguida, o segmento é enviado para a camada de rede.</li>\n<li>A camada de rede encapsula o segmento TCP dentro de um pacote IP, anexa os endereços IP de origem e destino. Em seguida, roteia o pacote para a camada de ligação.</li>\n<li>O pacote então chega ao hardware físico do Pete e é encapsulado em um quadro. Os endereços MAC de origem e destino são adicionados ao quadro.</li>\n<li>A Patty recebe este quadro de dados através de sua camada física e verifica cada quadro quanto à integridade dos dados, em seguida, desencapsula o conteúdo do quadro e envia o pacote IP para a camada de rede.</li>\n<li>A camada de rede lê o pacote para encontrar o IP de origem e destino que foi anexado anteriormente. Ele verifica se seu IP é o mesmo que o IP de destino, o que é! Ele desencapsula o pacote e envia o segmento para a camada de transporte.</li>\n<li>A camada de transporte desencapsula os segmentos, verifica os números das portas TCP ou UDP e estabelece uma conexão com a camada de aplicação com base nesses números de porta.</li>\n<li>A camada de aplicação recebe os dados da camada de transporte na porta especificada e os apresenta para a Patty na forma da mensagem de e-mail final</li>\n</ol>",
  "exercise": "Sem exercícios para esta lição.",
  "quizQuestion": "O que é usado para encontrar o endereço MAC na mesma rede?",
  "quizAnswer": "ARP",
  "slug": "camadaligacao"
}