{
  "id": 3,
  "title": "Modelo TCP/IP",
  "lessonContent": "O modelo OSI deu origem ao que eventualmente se tornou o modelo TCP/IP e este modelo é na verdade no que a Internet é baseada. É a implementação real de redes. O modelo TCP/IP utiliza o conjunto de protocolos TCP/IP, que comumente nos referimos apenas como TCP/IP. Esses protocolos trabalham juntos para especificar como os dados devem ser coletados, endereçados, transmitidos e roteados através de uma rede. Usando o modelo TCP/IP, podemos ver como esses protocolos são usados para mostrar a decomposição de como um pacote viaja pela rede.\n\n<b>Camada de Aplicação</b>\n\nA camada superior do modelo TCP/IP. Ela determina como os programas do seu computador (como seu navegador da web) interagem com os serviços da camada de transporte para visualizar os dados que são enviados ou recebidos.\n\nEsta camada utiliza:\n<ul>\n<li>HTTP (Protocolo de Transferência de Hipertexto) - usado para as páginas da web na Internet.</li>\n<li>SMTP (Protocolo Simples de Transferência de Correio) - transmissão de correio eletrônico (email)</li>\n</ul>\n\n<b>Camada de Transporte</b>\n\nComo os dados serão transmitidos, inclui verificação das portas corretas, integridade dos dados e basicamente entrega de nossos pacotes.\n\nEsta camada utiliza:\n<ul>\n<li>TCP (Protocolo de Controle de Transmissão) - entrega confiável de dados</li>\n<li>UDP (Protocolo de Datagrama de Usuário) - entrega não confiável de dados</li>\n</ul>\n\n<b>Camada de Rede</b>\n\nEsta camada especifica como mover pacotes entre hosts e através de redes.\n\nEsta camada utiliza:\n<ul>\n<li>IP (Protocolo de Internet) - Ajuda a rotear pacotes de uma máquina para outra.</li>\n<li>ICMP (Protocolo de Mensagem de Controle da Internet) - Ajuda a nos dizer o que está acontecendo, como mensagens de erro e informações de depuração.</li>\n</ul>\n\n<b>Camada de Link</b>\n\nEsta camada especifica como enviar dados através de um pedaço físico de hardware. Como dados que viajam através de Ethernet, fibra, etc.\n\nAs listas acima dos protocolos que cada camada utiliza não são extensivas e você encontrará muitos outros protocolos que entram em jogo.\n\nNas próximas lições, vamos mergulhar em cada uma dessas camadas e discutir como nosso pacote atravessa a rede aos olhos do modelo TCP/IP (existem muitas perspectivas sobre como um pacote viaja através de redes, não vamos examiná-las todas, mas esteja ciente de que elas existem).",
  "exercise": "Não há exercícios para esta lição.",
  "quizQuestion": "Qual é a camada superior do modelo TCP/IP?",
  "quizAnswer": "Aplicação",
  "slug": "modelo-tcpip"
}