{
  "id": 6,
  "title": "Camada de Transporte",
  "lessonContent": "A camada de transporte nos ajuda a transferir nossos dados de uma maneira que as redes possam lê-los. Ela quebra nossos dados em pedaços que serão transportados e reunidos na ordem correta. Esses pedaços são conhecidos como segmentos. Os segmentos facilitam o transporte de dados pelas redes. \n\n<b>Portas</b>\n\nMesmo sabendo para onde estamos enviando nossos dados por meio de endereços IP, eles não são específicos o suficiente para enviar nossos dados para determinados processos ou serviços. Serviços como HTTP usam um canal de comunicação via portas. Se quisermos enviar dados de uma página da web, precisamos enviá-los pela porta HTTP (porta 80). Além de formar segmentos, a camada de transporte também anexará as portas de origem e destino ao segmento, para que, quando o receptor receber o pacote final, saiba qual porta usar. \n\n<b>UDP</b>\n\nExistem dois protocolos de transporte populares, UDP e TCP. Vamos discutir brevemente o UDP e passar a maior parte do tempo no TCP, pois é o mais comumente usado.\n\nO UDP não é um método confiável de transporte de dados, na verdade, não se importa se você recebe todos os seus dados originais. Isso pode parecer terrível, mas tem seus usos, como para streaming de mídia, tudo bem se você perder alguns quadros, em troca, obtém seus dados um pouco mais rápido. \n\n<b>TCP</b>\n\nO TCP fornece uma conexão confiável e orientada a conexão de fluxo de dados. O TCP usa portas para enviar dados de e para hosts. Uma aplicação abre uma conexão de uma porta em seu host para outra porta em um host remoto. Para estabelecer a conexão, usamos o handshake do TCP. \n\n<ul>\n<li>O cliente (processo de conexão) envia um segmento SYN para o servidor para solicitar uma conexão</li>\n<li>O servidor envia ao cliente um segmento SYN-ACK para reconhecer a solicitação de conexão do cliente</li>\n<li>O cliente envia um ACK ao servidor para reconhecer a solicitação de conexão do servidor</li>\n</ul>\n\nUma vez estabelecida essa conexão, os dados podem ser trocados por meio de uma conexão TCP. Os dados são enviados em segmentos diferentes e são rastreados com números de sequência TCP para que possam ser organizados na ordem correta quando forem entregues. Em nosso exemplo de e-mail, a camada de transporte anexa a porta de destino (25) à porta de origem do host de origem.",
  "exercise": "Não há exercícios para esta lição.",
  "quizQuestion": "Qual é um protocolo de transporte confiável?",
  "quizAnswer": "TCP",
  "slug": "camadadetransporte"
}