{
  "id": 2,
  "title": "Subnetze",
  "lessonContent": "Wie kann ich feststellen, ob ich im selben Netzwerk wie Patty bin? Nun, wir können einfach das Subnetz, kurz für Subnetzwerk, betrachten. Ein Subnetz ist eine Gruppe von Hosts mit IP-Adressen, die auf bestimmte Weise ähnlich sind. Diese Hosts befinden sich normalerweise in unmittelbarer Nähe zueinander, und Sie können problemlos Daten an Hosts im selben Subnetz senden und von ihnen empfangen. Denken Sie daran, wie das Senden von Postleitzahlen, es ist viel einfacher als das Senden von Post in einen anderen Staat. \n\nZum Beispiel würden alle Hosts mit einer IP-Adresse, die mit 123.45.67 beginnt, im selben Subnetz sein. Mein Host hat die IP 123.45.67.8 und Pattys hat die IP 123.45.67.9. Die gemeinsamen Zahlen sind mein Netzwerkpräfix und die 8 und 9 sind unsere Hosts, daher ist mein Netzwerk dasselbe wie das von Patty. Ein Subnetz ist in ein Netzwerkpräfix, wie z.B. 123.45.67.0, und eine Subnetzmaske unterteilt.\n\n<b>Subnetzmasken</b>\n\nSubnetzmasken bestimmen, welcher Teil Ihrer IP-Adresse der Netzwerkanteil und welcher Teil der Hostanteil ist. \n\nEine typische Subnetzmaske kann so aussehen:\n\n<pre>255.255.255.0</pre>\n\nDer 255-Teil ist tatsächlich unsere Maske. Um dies etwas einfacher zu verstehen, erinnern Sie sich daran, wie wir jedes Oktett als 8 Bits bezeichnen? In der Informatik wird ein Bit durch eine 0 oder eine 1 in binärer Form dargestellt. Wenn binäre Zahlen verwendet werden, bedeutet 1 ein und 0 aus. Was ergibt also 8 Mal 0 oder 1?\n\nGeben Sie bei Google \"Binär-zu-Dezimal-Rechner\" ein und konvertieren Sie 11111111 in dezimaler Form. Was erhalten Sie? 255! Ein Oktett reicht also von 0 bis 255. Wenn wir also eine Subnetzmaske von 255.255.255.0 und eine IP-Adresse von 192.168.1.0 hätten, wie viele Hosts gibt es in diesem Subnetz? Wir werden die Antwort in unserer Subnetzberechnung herausfinden.\n\nWenn wir über unser Subnetz sprechen, bezeichnen wir es normalerweise durch das Netzwerkpräfix gefolgt von der Subnetzmaske:\n\n<pre>123.234.0.0/255.255.0.0</pre>\n\n<b>Warum?</b>\n\nWarum zum Teufel erstellen wir Subnetze? Subnetting wird verwendet, um Netzwerke zu segmentieren und den Datenverkehr innerhalb dieses Netzwerks zu steuern. Ein Host in einem Subnetz kann also nicht mit einem anderen Host in einem anderen Subnetz interagieren. \n\nAber Moment mal, was ist, wenn ich mich mit anderen Hosts wie yahoo.com verbinden möchte? Dann müssen Sie Subnetze miteinander verbinden. Um Subnetze zu verbinden, müssen Sie einfach die Hosts finden, die mit mehr als einem Subnetz verbunden sind. Wenn z.B. mein Host unter 192.168.1.129 mit einem lokalen Netzwerk von 192.168.1.129/24 verbunden ist, kann er auf alle Hosts in diesem Netzwerk zugreifen. Um auf Hosts im restlichen Internet zuzugreifen, muss er über den Router kommunizieren. Traditionell befindet sich auf den meisten Netzwerken mit einer Subnetzmaske von 255.255.255.0 der Router normalerweise unter der Adresse 1 des Subnetzes, also 192.168.1.1. Dieser Router wird einen Port haben, der ihn mit einem anderen Subnetz verbindet (mehr dazu im Routing-Kurs). Bestimmte IP-Adressen (private Netzwerke) sind für das Internet nicht sichtbar, und wir haben Dinge wie NAT im Einsatz (dazu später mehr).",
  "exercise": "Verwenden Sie ifconfig, um Ihre Subnetzmaske anzuzeigen.",
  "quizQuestion": "Wahr oder falsch, ein Subnetz besteht aus einer Subnetzmaske und einem Netzwerkpräfix.",
  "quizAnswer": "Wahr",
  "slug": "subnets"
}