{
  "id": 4,
  "title": "Subnetting Cheats",
  "lessonContent": "Ich hasse es, diesen Abschnitt hinzufügen zu müssen. In der realen Welt müssten Sie höchstwahrscheinlich niemals Subnetz-Mathematik von Hand durchführen. Wenn Sie jedoch in einem Interview damit konfrontiert werden, müssen Sie wissen, wie man in und aus binärer Form für Subnetting konvertiert. Glücklicherweise gibt es einige arithmetische Tricks, die Sie auswendig lernen können. \n\nMerken Sie sich zuerst Ihre Basis-2-Berechnungen, einfach machen:\n\n<ul>\n<li>2^1 = 2</li>\n<li>2^2 = 4</li>\n<li>2^3 = 8</li>\n<li>2^4 = 16</li>\n<li>2^5 = 32</li>\n<li>2^6 = 64</li>\n<li>2^7 = 128</li>\n<li>2^8 = 256</li>\n<li>2^9 = 512</li>\n<li>2^10 = 1024</li>\n<li>2^11 = 2048</li>\n<li>2^12 = 4096</li>\n</ul>\n\n<b>Dezimal zu Binär Tabelle</b>\n\n<pre>\n1   1  1  1  1 1 1 1\n128 64 32 16 8 4 2 1\n</pre>\n\nEs gibt viele Gründe, warum die folgende Tabelle so aussieht, wie sie aussieht. Wenn Sie neugierig sind, wie sie funktioniert, gibt es viele Ressourcen online.\n\nOkay, haben Sie diese auswendig gelernt? Lassen Sie uns eine schnelle Dezimal zu Binär Umwandlung durchführen:\n\n<b>Wandeln Sie 192.168.23.43 in Binär um</b>\n\nDenken Sie daran: 128 / 64 / 32 / 16 / 8 / 4 / 2 / 1\n\nLassen Sie uns die Umwandlung des ersten Oktetts in Binär durchgehen und Sie werden verstehen, wie der Rest funktioniert.\n\n<ol>\n<li>Können Sie 192 - 128 subtrahieren? Ja, also ist das erste Bit 1</li>\n<li>192 - 128 = 64, die nächste Zahl in der Tabelle ist 64, können Sie 64 - 64 subtrahieren? Ja, also ist das zweite Bit 1</li>\n<li>Wir haben keine Zahlen mehr zum Subtrahieren, also ist unsere binäre Form von 192 11000000</li>\n</ol>\n\n<b>Wandeln Sie Binär 11000000 in Dezimal um</b>\n\nFür die Umwandlung von Binär in Dezimal addieren Sie die Zahlen, die eine 1 haben, also:\n\n128 + 64 + 0 + 0 + 0 + 0 + 0 + 0 = 192!",
  "exercise": "Schauen Sie sich Ihre IP-Adresse und Subnetzmaske an und sehen Sie, wie viele Hosts Sie in Ihrem Subnetz haben können.",
  "quizQuestion": "Was ist die binäre Umwandlung von 123?",
  "quizAnswer": "1111011",
  "slug": "subnettingcheats"
}