{
  "id": 2,
  "title": "अनुमतियाँ संशोधित करना",
  "lessonContent": "अनुमतियों को <b>chmod</b> कमांड के साथ आसानी से बदला जा सकता है। \n\nपहले, उस अनुमति सेट को चुनें जिसे आप बदलना चाहते हैं, उपयोगकर्ता, समूह या अन्य। आप अनुमतियों को जोड़ सकते हैं या हटा सकते हैं एक <b>+</b> या <b>-</b> के साथ, चलिए कुछ उदाहरण देखते हैं।\n\n<b>फ़ाइल पर अनुमति बिट जोड़ना</b>\n<pre>$ chmod u+x myfile</pre>\n\nऊपर का कमांड इस प्रकार पढ़ा जाता है: myfile पर अनुमति बदलें उपयोगकर्ता सेट पर एक्सीक्यूटेबल अनुमति बिट जोड़कर। तो अब उपयोगकर्ता के पास इस फ़ाइल पर एक्सीक्यूटेबल अनुमति है!\n\n<b>फ़ाइल से अनुमति बिट हटाना</b>\n<pre>$ chmod u-x myfile</pre>\n\n<b>फ़ाइल पर कई अनुमति बिट जोड़ना</b>\n<pre>$ chmod ug+w</pre>\n\nअनुमतियों को संख्यात्मक प्रारूप का उपयोग करके अनुमतियों को बदलने का एक और तरीका है। यह विधि आपको सभी एक साथ अनुमतियाँ बदलने की अनुमति देती है। अनुमतियों को प्रतिनिधित्व करने के लिए r, w, या x का उपयोग करने की बजाय, आप एकल अनुमति सेट के लिए एक संख्यात्मक प्रतिनिधित्व का उपयोग करेंगे। तो g या u के साथ समूह को निर्दिष्ट करने की आवश्यकता नहीं है।\n\nसंख्यात्मक प्रतिनिधित्व नीचे दिखाई देते हैं:\n\n<ul>\n<li>4: पढ़ने की अनुमति</li>\n<li>2: लेखन की अनुमति</li>\n<li>1: क्रियान्वयन की अनुमति</li>\n</ul>\n\nएक उदाहरण देखते हैं: \n\n<pre>$ chmod 755 myfile</pre>\n\nक्या आप अनुमान लगा सकते हैं कि हम इस फ़ाइल को कौन सी अनुमतियाँ दे रहे हैं? चलिए इसे विश्लेषण करें, तो अब 755 सभी सेट के लिए अनुमतियों को कवर करता है। पहला नंबर (7) उपयोगकर्ता अनुमतियाँ का प्रतिनिधित्व करता है, दूसरा नंबर (5) समूह अनुमतियाँ प्रतिनिधित्व करता है और आखिरकार का 5 अन्य अनुमतियाँ प्रतिनिधित्व करता है।\n\nरुकिए एक मिनट, 7 और 5 ऊपर सूचीबद्ध नहीं थे, ये नंबर कहां से आ रहे हैं? याद रखें हम अब सभी अनुमतियों को एक संख्या में मिला रहे हैं, तो आपको कुछ गणित शामिल करना होगा।\n\n7 = 4 + 2 + 1, तो 7 उपयोगकर्ता अनुमतियाँ है और इसमें पढ़ने, लेखन और क्रियान्वयन की अनुमतियाँ हैं\n\n5 = 4 + 1, समूह में पढ़ने और क्रियान्वयन की अनुमतियाँ हैं\n\n5 = 4 +1, और सभी अन्य उपयोगकर्ताओं को पढ़ने और क्रियान्वयन की अनुमतियाँ हैं\n\nएक बात का ध्यान रखें: अनुमतियाँ बिना सोचे-समझे बदलना अच्छा विचार नहीं है, आप संभावित रूप से एक संवेदनशील फ़ाइल को सभी के लिए संशोधित करने के लिए उजागर कर सकते हैं, हालांकि कई बार आप वास्तव में अनुमतियाँ बदलना चाहते हैं, तो जब आप chmod कमांड का उपयोग कर रहे हो तो सावधानी बरतें।",
  "exercise": "कुछ मौलिक पाठ फ़ाइल अनुमतियाँ बदलें और जब आप ls -l करते हैं तो बिट बदलते हुए देखें।",
  "quizQuestion": "संख्यात्मक प्रारूप का उपयोग करते समय पढ़ने की अनुमति को किस संख्या का प्रतिनिधित्व करता है?",
  "quizAnswer": "4",
  "slug": "अनुमतियाँसंशोधितकरना"
}