{
  "id": 7,
  "title": "प्रक्रिया अनुमतियाँ",
  "lessonContent": "थोड़ी देर के लिए प्रक्रिया अनुमतियों में प्रवेश करें, याद रखें कि मैंने आपको बताया था कि जब आप SUID अनुमति बिट सक्षम करके passwd कमांड चलाते हैं तो आप कार्यक्रम को रूट के रूप में चलाएंगे? यह सच है, हालांकि क्या इसका अर्थ है कि आप अस्थायी रूप से रूट होने के कारण अन्य उपयोगकर्ताओं के पासवर्ड को संशोधित कर सकते हैं? नहीं निराशा की बात है!\n\nयह इसलिए है क्योंकि लिनक्स ने कई यूआईडीएस का अमल किया है। प्रत्येक प्रक्रिया के साथ तीन UIDS जुड़े होते हैं:\n\nजब आप किसी प्रक्रिया को लॉन्च करते हैं, तो यह उसी अनुमतियों के साथ चलता है जो उपयोगकर्ता या समूह ने इसे चलाया है, इसे एक <b>प्रभावी उपयोगकर्ता आईडी</b> के रूप में जाना जाता है। यह यूआईडी प्रक्रिया को पहुंच अधिकार देने के लिए उपयोग किया जाता है। इसलिए यदि बॉब ने टच कमांड चलाया, तो प्रक्रिया उसी रूप में चलेगी और उसने बनाए गए किसी भी फ़ाइलें उसके स्वामित्व में होंगी।\n\nएक और UID है, जिसे <b>वास्तविक उपयोगकर्ता आईडी</b> कहा जाता है, यह प्रक्रिया लॉन्च करने वाले उपयोगकर्ता की आईडी है। यह उन्हें ट्रैक करने के लिए उपयोग किए जाते हैं जिन्होंने प्रक्रिया लॉन्च की है।\n\nएक अंतिम UID है <b>बचाया गया उपयोगकर्ता आईडी</b>, यह एक प्रक्रिया को प्रभावी UID और वास्तविक UID के बीच स्विच करने की अनुमति देता है, उल्टा-पुल्टा। यह उपयोगी है क्योंकि हम चाहते हैं कि हमारी प्रक्रिया हमेशा उच्च विशेषाधिकारों के साथ न चले, विशेष समयों पर विशेष विशेषाधिकारों का उपयोग करना अच्छा अभ्यास है।\n\nअब चलो इन सभी को एक साथ जोड़ते हैं और पासवर्ड कमांड को एक बार फिर देखते हैं।\n\nपासवर्ड कमांड चलाने पर, आपकी प्रभावी UID आपकी उपयोगकर्ता आईडी है, चलो कहें अब इसके लिए 500 है। ओह लेकिन रुको, क्या याद है, पासवर्ड कमांड के पास SUID अनुमति सक्षम है। तो जब आप इसे चलाते हैं, तो आपकी प्रभावी UID अब 0 है (0 रूट की UID है)। अब यह कार्यक्रम रूट के रूप में फ़ाइलों तक पहुंच सकता है।\n\nचलो मान लो आपने एक छोटी सी ताकत का स्वाद चखा और आप सैली का पासवर्ड संशोधित करना चाहते हैं, सैली की UID 600 है। तो आपके लिए बड़ी बात है, भाग्यशाली तौर पर प्रक्रिया में आपकी वास्तविक UID भी इस मामले में 500 है। यह जानता है कि आपकी UID 500 है और इसलिए आप 600 की UID का पासवर्ड संशोधित नहीं कर सकते। (यह तब हमेशा उन्हें छोड़ दिया जाता है अगर आप मशीन पर सुपरयूजर हैं और सबकुछ नियंत्रित और बदल सकते हैं)।\n\nजैसे ही आप passwd चलाते हैं, यह आपकी वास्तविक UID का उपयोग करके प्रक्रिया शुरू करेगा, और यह फ़ाइल के मालिक की UID (प्रभावी UID) को बचाएगा, ताकि आप दोनों के बीच स्विच कर सकें। रूट एक्सेस के साथ सभी फ़ाइलों को संशोधित करने की आवश्यकता नहीं है अगर यह आवश्यक नहीं है।\n\nअधिकांश समय वास्तविक UID और प्रभावी UID एक ही होते हैं, लेकिन ऐसे मामलों में जैसे पासवर्ड कमांड वे बदल जाएंगे।",
  "exercise": "हमने अभी तक प्रक्रियाओं पर चर्चा नहीं की है, हम इस परिवर्तन को वास्तविक समय में हो रहे देख सकते हैं: \n\n<ol>\n<li>एक टर्मिनल विंडो खोलें, और निम्नलिखित कमांड चलाएं: <b>watch -n 1 \"ps aux | grep passwd\"</b>। यह passwd प्रक्रिया के लिए देखेगा।</li>\n<li>एक दूसरी टर्मिनल विंडो खोलें और चलाएं: <b>passwd</b></li>\n<li>पहली टर्मिनल विंडो पर देखें, आपको देखने को मिलेगा कि passwd के लिए एक प्रक्रिया आई है। प्रक्रिया सारणी में पहला स्तंभ प्रभावी उपयोगकर्ता आईडी है, देखो और देखो यह रूट उपयोगकर्ता है!</li>\n</ol>",
  "quizQuestion": "कौन सी UID निर्णय करती है कि किसे पहुंच देनी है?",
  "quizAnswer": "प्रभावी",
  "slug": "processpermissions"
}