{
  "id": 4,
  "title": "सीपीयू मॉनिटरिंग",
  "lessonContent": "एक उपयोगी कमांड पर चलते हैं, <b>uptime</b>।\n\n<pre>\npete@icebox:~$ uptime\n 17:23:35 up 1 day,  5:59,  2 users,  load average: 0.00, 0.02, 0.05\n</pre>\n\nहमने इस कोर्स के पहले सबक में uptime के बारे में बात की थी, लेकिन हमने लोड औसत क्षेत्र पर अभी तक नहीं गए हैं। लोड औसतें आपके सिस्टम पर सीपीयू लोड देखने का एक अच्छा तरीका है। ये नंबर 1, 5 और 15 मिनट के अंतराल में औसत सीपीयू लोड को प्रतिनिधित करते हैं। मैं सीपीयू लोड से क्या मतलब कर रहा हूँ, सीपीयू लोड वह औसत संख्या है जो सीपीयू द्वारा क्रियान्वित किए जाने की प्रतीक्षा कर रही प्रक्रियाओं की।\n\nचलिए मान लेते हैं कि आपके पास एक सिंगल-कोर सीपीयू है, इस कोर को एक ट्रैफिक में एकल लेन के रूप में सोचें। अगर फ्रीवे पर रश घंटे हैं, तो यह लेन वास्तव में बहुत व्यस्त होगा और ट्रैफिक 100% होगा या लोड 1 होगा। अब यातायात इतना खराब हो गया है कि यह फ्रीवे को पीछे कर रहा है और नियमित सड़कों को दोगुनी गाड़ियों से भर रहा है, हम कह सकते हैं कि आपका लोड 200% है या लोड 2 है। अब मान लेते हैं कि थोड़ी देर के लिए साफ हो जाता है और फ्रीवे लेन पर केवल आधी गाड़ियां हैं, हम कह सकते हैं कि लेन का लोड 0.5 है। जब यातायात अभावमय होता है और हम घर जल्दी पहुंच सकते हैं, तो लोड आदर्श रूप से बहुत कम होना चाहिए, जैसे 2 बजे का यातायात। इस मामले में गाड़ियां प्रक्रियाएँ हैं और ये प्रक्रियाएँ बस फ्रीवे से उतरने और घर पहुंचने की प्रतीक्षा कर रही हैं।\n\nअब यह नहीं कहा जा सकता कि आपके पास लोड औसत 1 है इसका यह मतलब नहीं है कि आपका कंप्यूटर धीमा चल रहा है। आजकल अधिकांश मशीनें मल्टीकोर होती हैं। यदि आपके पास एक क्वाड कोर प्रोसेसर (4 कोर) है और आपका लोड औसत 1 है, तो यह वास्तव में आपके सीपीयू का 25% प्रभावित कर रहा है। प्रत्येक कोर को एक ट्रैफिक लेन के रूप में सोचें। आप अपने सिस्टम पर कितने कोर हैं, इसे <b>cat /proc/cpuinfo</b> के साथ देख सकते हैं।\n\nलोड औसत को देखते समय, आपको कोरों की संख्या को ध्यान में रखना होगा, यदि आपको लगता है कि आपकी मशीन हमेशा से औसत से अधिक लोड कर रही है, तो कुछ गलत हो सकता है।",
  "exercise": "अपने सिस्टम का लोड औसत जांचें और देखें कि वह क्या कर रहा है।",
  "quizQuestion": "लोड औसत देखने के लिए आप कौन सा कमांड उपयोग कर सकते हैं?",
  "quizAnswer": "uptime",
  "slug": "cpumonitoring"
}