{
  "id": 5,
  "title": "I/O मॉनिटरिंग",
  "lessonContent": "हम एक सहायक उपकरण के साथ CPU उपयोग और डिस्क उपयोग को मॉनिटर कर सकते हैं, जिसे <b>iostat</b> के रूप में जाना जाता है\n\n<pre>\npete@icebox:~$ iostat\nLinux 3.13.0-39-lowlatency (icebox)     01/28/2016      _i686_  (1 CPU)\n\navg-cpu:  %user   %nice %system %iowait  %steal   %idle\n           0.13    0.03    0.50    0.01    0.00   99.33\n\nDevice:            tps    kB_read/s    kB_wrtn/s    kB_read    kB_wrtn\nsda               0.17         3.49         1.92     385106     212417\n</pre>\n\nपहला हिस्सा CPU जानकारी है:\n\n<ul>\n<li>%user - उपयोगकर्ता स्तर (एप्लिकेशन) पर निष्पादित होने वाले CPU उपयोग का प्रतिशत दिखाएं</li>\n<li>%nice - नाइस प्राथमिकता के साथ उपयोगकर्ता स्तर पर निष्पादित होने वाले CPU उपयोग का प्रतिशत दिखाएं</li>\n<li>%system - कर्ण (कर्नल) स्तर पर निष्पादित होने वाले CPU उपयोग का प्रतिशत दिखाएं</li>\n<li>%iowait - उस समय का प्रतिशत दिखाएं जब CPU या CPU निष्क्रिय थे जब सिस्टम में एक आउटस्टैंडिंग डिस्क I/O अनुरोध था</li>\n<li>%steal - वर्चुअल CPU या CPU द्वारा अनवशोधित प्रतिशत समय जिसमें हाइपरवाइजर एक अन्य वर्चुअल प्रोसेसर की सेवा कर रहा था में बिना इच्छापूर्वक प्रतीक्षा में व्यतीत किया गया</li>\n<li>%idle - CPU या CPU जब निष्क्रिय थे और सिस्टम में कोई आउटस्टैंडिंग डिस्क I/O अनुरोध नहीं था, तब समय का प्रतिशत दिखाएं</li>\n</ul>\n\nदूसरा हिस्सा डिस्क उपयोग है:\n\n<ul>\n<li>tps - उपकरण को जारी किए गए प्रति सेकंड स्थानांतरण की संख्या दर्शाता है। एक स्थानांतरण उपकरण के लिए एक I/O अनुरोध है। कई तार्किक अनुरोधों को एक ही I/O अनुरोध में संयोजित किया जा सकता है। एक स्थानांतरण अपरिपक्षित आकार का है।</li>\n<li>kB_read/s - उपकरण से पठित डेटा की मात्रा को किलोबाइट प्रति सेकंड में व्यक्त करता है।</li>\n<li>kB_wrtn/s - उपकरण में लिखे गए डेटा की मात्रा को किलोबाइट प्रति सेकंड में व्यक्त करता है।</li>\n<li>kB_read - पठित किलोबाइट की कुल संख्या।</li>\n<li>kB_wrtn - लिखे गए किलोबाइट की कुल संख्या।</li>\n</ul>",
  "exercise": "अपने डिस्क उपयोग देखने के लिए iostat का उपयोग करें।",
  "quizQuestion": "I/O और CPU उपयोग देखने के लिए कौन सा कमांड उपयोग किया जा सकता है?",
  "quizAnswer": "iostat",
  "slug": "iomonitoring"
}