{
  "id": 2,
  "title": "lsof और fuser",
  "lessonContent": "चलो मान लो कि आपने एक USB ड्राइव को प्लग इन किया और कुछ फ़ाइलों पर काम करना शुरू किया, एक बार जब आप ख़त्म हो गए, तो आप जाते हैं और USB डिवाइस को अनमाउंट करने की कोशिश कर रहे हैं और आपको एक त्रुटि मिल रही है \"डिवाइस या संसाधन व्यस्त है\"। आप कैसे पता करेंगे कि USB ड्राइव में कौन सी फ़ाइलें अब भी उपयोग में हैं? वास्तव में इसके लिए दो उपकरण हैं: \n\n<b>lsof</b>\n\nयाद रखें फ़ाइलें सिर्फ पाठ फ़ाइलें, छवियाँ, आदि नहीं हैं, वे सिस्टम पर सभी चीज़ें हैं, डिस्क, पाइप, नेटवर्क सॉकेट, डिवाइस, आदि। प्रक्रिया द्वारा क्या उपयोग में है, यह देखने के लिए आप lsof कमांड का उपयोग कर सकते हैं (\"लिस्ट ओपन फ़ाइल्स\" के लिए संक्षेप में) यह आपको सभी खुली फ़ाइलों और उनकी संबंधित प्रक्रिया की सूची दिखाएगा। \n\n<pre>\npete@icebox:~$ lsof .\nCOMMAND    PID  USER   FD   TYPE DEVICE SIZE/OFF NODE NAME\nlxsession 1491 pete  cwd    DIR    8,6     4096  131 .\nupdate-no 1796 pete  cwd    DIR    8,6     4096  131 .\nnm-applet 1804 pete  cwd    DIR    8,6     4096  131 .\nindicator 1809 pete  cwd    DIR    8,6     4096  131 .\nxterm     2205 pete  cwd    DIR    8,6     4096  131 .\nbash      2207 pete  cwd    DIR    8,6     4096  131 .\nlsof      5914 pete  cwd    DIR    8,6     4096  131 .\nlsof      5915 pete  cwd    DIR    8,6     4096  131 .\n</pre>\n\nअब मैं देख सकता हूँ कि कौन सी प्रक्रियाएँ वर्तमान में डिवाइस/फ़ाइल को खुले रख रही हैं। हमारे USB उदाहरण में, आप इन प्रक्रियाओं को बंद कर सकते हैं ताकि हम इस उपद्रवपूर्ण ड्राइव को अनमाउंट कर सकें।\n\n<b>fuser</b>\n\nएक और तरीका एक प्रक्रिया को ट्रैक करने के लिए fuser कमांड (\"फ़ाइल उपयोगकर्ता\" के लिए संक्षेप में) है, यह आपको जानकारी दिखाएगा कि कौन सी प्रक्रिया फ़ाइल या फ़ाइल उपयोगकर्ता का उपयोग कर रही है। \n\n<pre>\npete@icebox:~$ fuser -v .\n                     USER        PID ACCESS COMMAND\n/home/pete:         pete  1491 ..c.. lxsession\n                     pete  1796 ..c.. update-notifier\n                     pete  1804 ..c.. nm-applet\n                     pete  1809 ..c.. indicator-power\n                     pete  2205 ..c.. xterm\n                     pete  2207 ..c.. bash\n</pre>\n\nहम देख सकते हैं कि कौन सी प्रक्रियाएँ वर्तमान में हमारे /home/pete निर्देशिका का उपयोग कर रही हैं। lsof और fuser उपकरण बहुत समान हैं, इन उपकरणों को अधिक जानें और अगली बार जब आपको किसी फ़ाइल या प्रक्रिया का पता लगाना हो, तो इनका उपयोग करने की कोशिश करें।",
  "exercise": "lsof और fuser के मैनपेज पढ़ें, इन उपकरणों के साथ अधिक जानकारी है जिसे हमने नहीं शामिल किया है और जो आपको इन उपकरणों के साथ अधिक लचीलाई देने की अनुमति देती है।",
  "quizQuestion": "खुली फ़ाइलें और उनकी प्रक्रिया जानकारी की सूची देने के लिए कौन सा कमांड प्रयोग किया जाता है?",
  "quizAnswer": "lsof",
  "slug": "trackingprocesseslsoffuser"
}