{
  "id": 5,
  "title": "सिस्टमडी अवलोकन",
  "lessonContent": "सिस्टमडी धीरे-धीरे इनिट के लिए उभरते मानक बन रहा है। यदि आपके पास /usr/lib/systemd निर्देशिका है, तो आप संभावित रूप से सिस्टमडी का उपयोग कर रहे हैं।\n\nसिस्टमडी आपके सिस्टम को चालू और चलाने के लिए लक्ष्यों का उपयोग करता है। मूल रूप से आपके पास एक लक्ष्य होता है जिसे आप प्राप्त करना चाहते हैं और इस लक्ष्य के भी ऐसे आवश्यकताएं होती हैं जिन्हें हमें प्राप्त करना होता है। सिस्टमडी अत्यंत लचीला और मजबूत है, यह प्रक्रियाओं को शुरू करने के लिए एक सख्त क्रम का पालन नहीं करता है। यहां एक सामान्य सिस्टमडी बूट के दौरान क्या होता है:\n\n<ol>\n<li>पहले, सिस्टमडी अपनी कॉन्फ़िगरेशन फ़ाइलों को लोड करता है, जो आम तौर पर /etc/systemd/system या /usr/lib/systemd/system में स्थित होती हैं</li>\n<li>फिर यह अपना बूट लक्ष्य निर्धारित करता है, जो आम तौर पर default.target होता है</li>\n<li>सिस्टमडी बूट लक्ष्य की आवश्यकताओं को खोजता है और उन्हें सक्रिय करता है</li>\n</ol>\n\nSys V रनलेवल्स के समान रूप से, सिस्टमडी विभिन्न लक्ष्यों में बूट होता है:\n\n<ul>\n<li>poweroff.target - सिस्टम बंद करें</li>\n<li>rescue.target - एकल उपयोगकर्ता मोड</li>\n<li>multi-user.target - नेटवर्किंग के साथ बहुउपयोगकर्ता</li>\n<li>graphical.target - नेटवर्किंग और GUI के साथ बहुउपयोगकर्ता</li>\n<li>reboot.target - पुनः आरंभ करें</li>\n</ul>\n\ndefault.target का डिफ़ॉल्ट बूट लक्ष्य आम तौर पर graphical.target की ओर इशारा करता है।\n\nसिस्टमडी जो विकास करता है, उसे इकाइयों के रूप में जाना जाता है। सिस्टमडी सेवाएँ बंद और चालू नहीं करता है, यह फ़ाइल सिस्टमों को माउंट कर सकता है, आपके नेटवर्क सॉकेट को मॉनिटर कर सकता है, आदि और उस मजबूती के कारण जिसके कारण इसके पास वह इकाइयों के लिए विभिन्न प्रकार की इकाइयाँ होती हैं जिनका उपयोग करता है। सबसे सामान्य इकाइयाँ हैं:\n\n<ul>\n<li>सेवा इकाइयाँ - ये सेवाएँ हैं जिन्हें हम शुरू और बंद कर रहे हैं, ये इकाइयों की फ़ाइलें .service से समाप्त होती हैं</li>\n<li>माउंट इकाइयाँ - ये फ़ाइल सिस्टमों को माउंट करती हैं, ये इकाइयों की फ़ाइलें .mount से समाप्त होती हैं</li>\n<li>टारगेट इकाइयाँ - ये अन्य इकाइयों को समूहित करती हैं, फ़ाइलें .target से समाप्त होती हैं</li>\n</ul>\n\nउदाहरण के लिए, चलो मान लो कि हम अपने default.target में बूट करते हैं, ठीक है इस लक्ष्य में नेटवर्किंग सेवा इकाई, crond सेवा इकाई, आदि को समूहित करता है, इसलिए एक बार हम एक एकल इकाई को सक्रिय करते हैं, तो उस इकाई के नीचे सभी कुछ सक्रिय हो जाता है।",
  "exercise": "इस पाठ के लिए कोई अभ्यास नहीं।",
  "quizQuestion": "अन्य इकाइयों को समूहित करने के लिए कौन सी इकाई का उपयोग किया जाता है?",
  "quizAnswer": "टारगेट",
  "slug": "systemdoverview"
}