{
  "id": 1,
  "title": "सिस्टम वी अवलोकन",
  "lessonContent": "इनिट का मुख्य उद्देश्य सिस्टम पर आवश्यक प्रक्रियाओं को शुरू और बंद करना है। लिनक्स में इनिट के तीन प्रमुख कार्यान्वयन हैं, सिस्टम वी, अपस्टार्ट और सिस्टमडी। इस पाठ में, हम सबसे पारंपरिक संस्करण इनिट, सिस्टम वी इनिट या सिस वी (जिसे 'सिस्टम फाइव' के रूप में उच्चारित किया जाता है) पर जानेंगे। \n\nयदि आप सिस वी इनिट कार्यान्वयन का उपयोग कर रहे हैं, तो यदि आपके पास एक /etc/inittab फ़ाइल है तो आपकी संभावना है कि आप सिस वी चला रहे हैं। \n\nसिस वी प्रक्रियाएँ क्रमशः शुरू और बंद करता है, इसलिए यदि आप 'फू-ए' नामक सेवा को शुरू करना चाहते हैं, तो फू-बी काम कर सके, तो आपको सुनिश्चित करना होगा कि फू-ए पहले से ही चल रहा है। सिस वी इसे स्क्रिप्ट के साथ करता है, ये स्क्रिप्ट हमारे लिए सेवाएँ शुरू और बंद करती हैं, हम अपनी स्क्रिप्ट लिख सकते हैं या ज्यादातर समय उसे उपयोग कर सकते हैं जो ऑपरेटिंग सिस्टम में पहले से ही बने होते हैं और आवश्यक सेवाएँ लोड करने के लिए उपयोग किए जाते हैं। \n\nइनिट के इस कार्यान्वयन का उपयोग करने के फायदे यह हैं कि इसके आपसी आधारितता को हल करना अधिक सरल है, क्योंकि आप जानते हैं कि फू-ए फू-बी से पहले आता है, हालांकि प्रदर्शन अच्छा नहीं है क्योंकि आम तौर पर एक समय में कुछ एक चीज शुरू या बंद हो रही है। \n\nसिस वी का उपयोग करते समय, मशीन की स्थिति रनलेवल्स द्वारा परिभाषित होती है जो 0 से 6 तक सेट किए जाते हैं। ये विभिन्न मोड वितरण पर निर्भर करेंगे, लेकिन अधिकांश समय निम्नलिखित की तरह दिखेंगे: \n\n<ul>\n<li>0: शटडाउन</li>\n<li>1: एकल उपयोगकर्ता मोड</li>\n<li>2: नेटवर्किंग के बिना मल्टीयूजर मोड</li>\n<li>3: नेटवर्किंग के साथ मल्टीयूजर मोड</li>\n<li>4: अप्रयुक्त</li>\n<li>5: नेटवर्किंग और जीयूआई के साथ मल्टीयूजर मोड</li>\n<li>6: रिबूट</li>\n</ul>\n\nजब आपकी सिस्टम शुरू होती है, तो यह देखने के लिए कि आप किस रनलेवल में हैं और उस रनलेवल कॉन्फ़िगरेशन में स्थित स्क्रिप्ट को निष्पादित करती है। स्क्रिप्ट <b>/etc/rc.d/rc[रनलेवल संख्या].d/</b> या <b>/etc/init.d</b> में स्थित होती हैं। S(शुरू) या K(किल) के साथ शुरू होने वाली या बंद होने वाली स्क्रिप्ट चलेंगी, क्रमशः। इनके पास इन अक्षरों के साथ नंबर होते हैं जो उनकी क्रमशः चलने की क्रम होती है। \n\nउदाहरण के लिए:\n\n<pre>\nपीट@आइसबॉक्स:/etc/rc.d/rc0.d$ ls\nK10अपडेट  K80ओपनवीपीएन        \n</pre>\n\nहम देखते हैं कि हम जब रनलेवल 0 या शटडाउन मोड में स्विच करते हैं, हमारी मशीन को अपडेट सेवाओं को मारने की कोशिश करेगी और फिर ओपनवीपीएन। अपनी मशीन का डिफ़ॉल्ट रनलेवल क्या है, इसे जानने के लिए आप /etc/inittab फ़ाइल में डिफ़ॉल्ट रनलेवल देख सकते हैं। आप इस फ़ाइल में अपना डिफ़ॉल्ट रनलेवल भी बदल सकते हैं। \n\nएक बात ध्यान देने योग्य है, सिस्टम वी धीरे-धीरे बदल रहा है, शायद आज, या यहाँ तक कि वर्षों बाद भी नहीं। हालांकि, आपको देखने को मिल सकता है कि अन्य इनिट कार्यान्वयनों में रनलेवल आते हैं, यह मुख्य रूप से उन सेवाओं का समर्थन करने के लिए है जो केवल सिस्टम वी इनिट स्क्रिप्ट का उपयोग करके शुरू या बंद किए जाते हैं।",
  "exercise": "यदि आप सिस्टम वी चला रहे हैं, तो अपनी मशीन का डिफ़ॉल्ट रनलेवल को कुछ और बदलें और देखें कि क्या होता है।",
  "quizQuestion": "शटडाउन के लिए सामान्यत: कौन सा रनलेवल उपयोग किया जाता है?",
  "quizAnswer": "0",
  "slug": "sysvoverview"
}