{
  "id": 3,
  "title": "उपस्थिति अवलोकन",
  "lessonContent": "अपस्टार्ट को कैनोनिकल ने विकसित किया था, इसलिए यह उबुंटू पर एक समय के लिए आरंभन अंमलन था, हालांकि आधुनिक उबुंटू स्थापनाओं पर अब सिस्टमडी का उपयोग होता है। अपस्टार्ट को सिस वी की समस्याओं को सुधारने के लिए बनाया गया था, जैसे कि सख्त स्टार्टअप प्रक्रियाएँ, कार्यों को ब्लॉक करना, आदि। अपस्टार्ट का घटना और नौकरी निर्देशित मॉडल इसे घटनाओं का सम्मान करने की अनुमति देता है। \n\nयदि आप यह जानना चाहते हैं कि आप अपस्टार्ट का उपयोग कर रहे हैं, तो यदि आपके पास /usr/share/upstart निर्देशिका है तो यह एक अच्छा संकेत है। \n\nनौकरियाँ वे क्रियाएँ हैं जो अपस्टार्ट करता है और घटनाएँ वे संदेश हैं जो अन्य प्रक्रियाओं से प्राप्त होते हैं ताकि नौकरियाँ ट्रिगर हो सकें। नौकरियों और उनके विन्यास की सूची देखने के लिए:\n\n<pre>\npete@icebox:~$ ls /etc/init\nacpid.conf                   mountnfs.sh.conf\nalsa-restore.conf            mtab.sh.conf\nalsa-state.conf              networking.conf\nalsa-store.conf              network-interface.conf\nanacron.conf                 network-interface-container.conf\n</pre>\n\nइन नौकरी विन्यासों में, नौकरियों को शुरू करने और नौकरियों को कब शुरू करना है, इस पर जानकारी शामिल होगी।\n\nउदाहरण के लिए, नेटवर्किंग.conf फ़ाइल में, यह कुछ इस प्रकार हो सकता है:\n<pre>\nstart on runlevel [235]\nstop on runlevel [0]\n</pre>\n\nइसका मतलब है कि यह रनलेवल 2, 3 या 5 पर नेटवर्किंग सेट करना शुरू करेगा और रनलेवल 0 पर नेटवर्किंग बंद करेगा। विन्यास फ़ाइल लिखने के कई तरीके हैं और आप उपलब्ध विभिन्न नौकरी विन्यासों को देखेंगे तो आपको यह पता चलेगा। \n\nअपस्टार्ट का काम करने का तरीका यह है: \n\n<ol>\n<li>पहले, यह /etc/init से नौकरी विन्यास लोड करता है</li>\n<li>एक स्टार्टअप घटना होने पर, उस घटना द्वारा ट्रिगर किए गए नौकरियों को चलाएगा।</li>\n<li>ये नौकरियाँ नई घटनाएँ बनाएंगी और फिर वे घटनाएँ और नौकरियों को ट्रिगर करेंगी</li>\n<li>अपस्टार्ट यह करता रहेगा जब तक वह सभी आवश्यक नौकरियाँ पूरी नहीं कर लेता</li>\n</ol>",
  "exercise": "यदि आप अपस्टार्ट चला रहे हैं, तो देखें कि क्या आप /etc/init में नौकरी विन्यासों को समझ सकते हैं।",
  "quizQuestion": "उबुंटू द्वारा उपयोग किया जाने वाला आरंभन अंमलन क्या है?",
  "quizAnswer": "अपस्टार्ट",
  "slug": "upstartoverview"
}