{
  "id": 4,
  "title": "उपस्थिति नौकरियां",
  "lessonContent": "उपस्थिति बहुत सारे घटनाओं और नौकरियों को चालू कर सकता है, दुर्भाग्य से किसी घटना या नौकरी का मूल क्या है, इसे देखने का कोई आसान तरीका नहीं है, इसलिए आपको /etc/init में नौकरी के विन्यास के चारों ओर छेदखानी करनी पड़ेगी। अधिकांश समय, आपको कभी भी उपस्थिति नौकरी विन्यास फ़ाइलों को देखने की आवश्यकता नहीं होगी, लेकिन आप कुछ विशिष्ट नौकरियों को आसानी से नियंत्रित करना चाहेंगे। उपस्थिति प्रणाली में आपका उपयोग करने के लिए कई उपयोगी कमांड हैं।\n\n<b>नौकरियां देखें</b>\n\n<pre>initctl list\n\nshutdown stop/waiting\nconsole stop/waiting\n...\n</pre>\n\nआप उपस्थिति नौकरियों की सूची देखेंगे जिन पर विभिन्न स्थितियाँ लागू होती हैं। प्रत्येक पंक्ति में, नौकरी का नाम पहला मान है और दूसरा क्षेत्र (स्लेश के पहले) वास्तव में नौकरी का लक्ष्य है, तीसरा मान (स्लेश के बाद) वर्तमान स्थिति है। इसलिए हम देखते हैं कि हमारी बंद करने की नौकरी आखिरकार रुकना चाहती है, लेकिन वर्तमान में एक प्रतीक्षा की स्थिति में है। नौकरी की स्थिति और लक्ष्य जैसे ही आप नौकरियां शुरू या बंद करते हैं, वे बदल जाएंगे।\n\n<b>विशिष्ट नौकरी देखें</b>\n\n<pre>initctl status networking\nnetworking start/running\n</pre>\n\nहम उपस्थिति नौकरी विन्यास कैसे लिखें के विवरण में नहीं जाएंगे, हालांकि हम यह पहले से ही जानते हैं कि नौकरियां इन विन्यासों में बंद, शुरू और पुनः आरंभ होती हैं। ये नौकरियां घटनाएँ भी उत्पन्न करती हैं, इसलिए वे अन्य नौकरियों को शुरू कर सकती हैं। हम उपस्थिति क्रियान्वयन के मैन्युअल कमांडों के माध्यम से जाएँगे, लेकिन यदि आप उत्सुक हैं, तो आपको .conf फ़ाइलों में अधिक गहराई से खोजना चाहिए।\n\n<b>मैन्युअल रूप से एक नौकरी शुरू करें</b>\n\n<pre>$ sudo initctl start networking</pre>\n\n<b>मैन्युअल रूप से एक नौकरी बंद करें</b>\n\n<pre>$ sudo initctl stop networking</pre>\n\n<b>मैन्युअल रूप से एक नौकरी पुनः आरंभ करें</b>\n\n<pre>$ sudo initctl restart networking</pre>\n\n<b>मैन्युअल रूप से एक घटना उत्पन्न करें</b>\n\n<pre>$ sudo initctl emit some_event</pre>",
  "exercise": "अपनी उपस्थिति नौकरियों की सूची का अवलोकन करें, अब आज हमने सीखे किसी कमांड के साथ नौकरी स्थिति बदलें। इसके बाद आप क्या देखते हैं?",
  "quizQuestion": "मैं कैसे मैन्युअल रूप से एक उपस्थिति नौकरी जिसे मूंगफली कहा जाता है पुनः आरंभ करूँ?",
  "quizAnswer": "sudo initctl restart peanuts",
  "slug": "upstartjobs"
}