{
  "id": 9,
  "title": "DHCP-Übersicht",
  "lessonContent": "Ein wichtiges Netzwerkkonzept, das wir noch nicht behandelt haben, ist DHCP (Dynamic Host Configuration Protocol)\n\nDHCP weist IP-Adressen, Subnetzmasken und Gateways unseren Geräten zu. Zum Beispiel, nehmen wir an, Sie haben ein Handy und möchten eine Telefonnummer erhalten, um mit anderen Personen zu sprechen. Sie müssen Ihren Mobilfunkanbieter anrufen und dieser wird Ihnen eine Nummer geben. Solange Sie Ihre Rechnungen bezahlen, können Sie Ihr Handy weiterhin nutzen. DHCP ist in diesem Fall der Mobilfunkanbieter, der Ihnen eine IP-Adresse gibt, damit Sie mit anderen IP-Adressen kommunizieren können. Ihnen wird auch eine IP-Adresse zugewiesen, die für eine bestimmte Zeit gültig ist und je nach Ihren Leasingeinstellungen erneuert wird.\n\nDHCP ist aus vielen Gründen großartig, es ermöglicht einem Netzwerkadministrator, sich keine Gedanken über die Zuweisung von IP-Adressen machen zu müssen und verhindert auch die Einrichtung von doppelten IP-Adressen. Jedes physische Netzwerk sollte seinen eigenen DHCP-Server haben, damit ein Host eine IP-Adresse anfordern kann. In einer normalen häuslichen Umgebung fungiert der Router normalerweise als DHCP-Server.\n\nDer Weg, wie DHCP alle Ihre dynamischen Host-Informationen erhält, ist:\n\n<ol>\n<li>DHCP DISCOVER - Diese Nachricht wird gesendet, um nach einem DHCP-Server zu suchen.</li>\n<li>DHCP OFFER - Der DHCP-Server im Netzwerk antwortet mit einer Angebotsnachricht. Das Angebot enthält ein Paket mit DHCP-Leasezeit, Subnetzmaske, IP-Adresse usw.</li>\n<li>DHCP REQUEST - Der Client sendet erneut eine Broadcast-Nachricht, um allen DHCP-Servern mitzuteilen, welches Angebot er akzeptiert hat.</li>\n<li>DHCP ACK - Die Bestätigung wird vom Server gesendet.</li>\n</ol>\n\nDHCP wird noch komplexer, aber das ist das Wesentliche.",
  "exercise": "Keine Übungen für diese Lektion.",
  "quizQuestion": "Was sind die Schritte in einer DHCP-Anfrage?",
  "quizAnswer": "DISCOVER, OFFER, REQUEST, ACK",
  "slug": "dhcpoverview"
}