{
  "id": 8,
  "title": "Link Layer",
  "lessonContent": "Am unteren Ende des TCP/IP-Modells befindet sich die Link-Schicht. Diese Schicht ist die hardware-spezifische Schicht.\n\nIn der Link-Schicht wird unser Paket erneut in etwas namens Frame verkapselt. Der Frame-Header fügt die Quell- und Ziel-MAC-Adressen unserer Hosts, Prüfsummen und Pakettrennzeichen hinzu, damit der Empfänger erkennen kann, wann ein Paket endet. \n\nGlücklicherweise sind wir im selben Netzwerk, sodass unser Paket nicht allzu weit reisen muss. Zuerst fügt die Link-Schicht meine Quell-MAC-Adresse dem Frame-Header hinzu, aber sie muss auch Pattys MAC-Adresse kennen. Wie weiß sie das und wie finde ich sie, da sie nicht im Internet ist? Wir verwenden ARP!\n\n<b>ARP (Adressauflösungsprotokoll)</b>\n\nARP findet die MAC-Adresse, die mit einer IP-Adresse verbunden ist. ARP wird innerhalb desselben Netzwerks verwendet. Wenn Patty nicht im selben Netzwerk wäre, würden wir ein Routing-System verwenden, um den nächsten Router zu bestimmen, der das Paket empfangen würde, und sobald wir im selben Netzwerk wären, könnten wir ARP verwenden. \n\nSobald wir im selben Netzwerk sind, verwenden Systeme zuerst die ARP-Look-up-Tabelle, die Informationen darüber speichert, welche IP-Adressen mit welchen MAC-Adressen verbunden sind. Wenn der Wert dort nicht vorhanden ist, wird ARP verwendet. Dann sendet das System eine Broadcast-Nachricht an das Netzwerk mit dem ARP-Protokoll, um herauszufinden, welcher Host die IP 10.10.1.4 hat. Eine Broadcast-Nachricht ist eine spezielle Nachricht, die an alle Hosts in einem Netzwerk gesendet wird (passenderweise für das Senden eines Broadcasts benannt). Jede Maschine mit der angeforderten IP-Adresse antwortet mit einem ARP-Paket, das die IP-Adresse und die MAC-Adresse enthält.\n\nNun, da wir alle notwendigen Daten haben, die wir brauchen, IP-Adresse und MAC-Adressen, leitet unsere Link-Schicht diesen Frame über unsere Netzwerkschnittstellenkarte weiter zum nächsten Gerät und findet Pattys Netzwerk. Dieser Schritt ist etwas komplexer als ich es gerade erklärt habe, aber wir werden in dem Routing-Kurs mehr Details besprechen.\n\nUnd da ist es, ein einfacher (oder nicht so einfacher) Paketdurchlauf durch die TCP/IP-Schicht. Bedenken Sie, dass Pakete nicht in einer Einbahnstraße wie dieser reisen. Wir sind noch nicht einmal in Pattys Netzwerk angekommen! Beim Durchqueren von Netzwerken ist es erforderlich, das TCP/IP-Modell mindestens zweimal zu durchlaufen, bevor Daten gesendet oder empfangen werden. In der Realität würde das Aussehen dieses Pakets etwa so aussehen: \n\n<b>Paketdurchlauf</b>\n\n<ol>\n<li>Pete sendet Patty eine E-Mail: Diese Daten werden an die Transportschicht gesendet.</li>\n<li>Die Transportschicht verkapselt die Daten in einen TCP- oder UDP-Header, um ein Segment zu bilden. Das Segment fügt die Ziel- und Quell-TCP- oder UDP-Port hinzu und wird dann an die Netzwerkschicht gesendet.</li>\n<li>Die Netzwerkschicht verkapselt das TCP-Segment in ein IP-Paket, fügt die Quell- und Ziel-IP-Adresse hinzu. Routet dann das Paket zur Link-Schicht.</li>\n<li>Das Paket erreicht dann Petes physische Hardware und wird in einem Frame verkapselt. Die Quell- und Ziel-MAC-Adresse werden dem Frame hinzugefügt.</li>\n<li>Patty empfängt diesen Datenframe über ihre physische Schicht und überprüft jeden Frame auf Datenintegrität, dekapselt dann den Frameinhalt und sendet das IP-Paket an die Netzwerkschicht.</li>\n<li>Die Netzwerkschicht liest das Paket, um die zuvor angehängte Quell- und Ziel-IP zu finden. Sie überprüft, ob ihre IP mit der Ziel-IP übereinstimmt, was der Fall ist! Sie dekapselt das Paket und sendet das Segment an die Transportschicht.</li>\n<li>Die Transportschicht dekapselt die Segmente, überprüft die TCP- oder UDP-Portnummern und stellt eine Verbindung zur Anwendungsschicht basierend auf diesen Portnummern her.</li>\n<li>Die Anwendungsschicht empfängt die Daten von der Transportschicht auf dem angegebenen Port und präsentiert sie Patty in Form der endgültigen E-Mail-Nachricht</li>\n</ol>",
  "exercise": "Keine Übungen für diese Lektion.",
  "quizQuestion": "Was wird verwendet, um die MAC-Adresse im selben Netzwerk zu finden?",
  "quizAnswer": "ARP",
  "slug": "linklayer"
}