{
  "id": 4,
  "title": "Netzwerkadressierung",
  "lessonContent": "Bevor wir uns damit beschäftigen, wie ein Paket über ein Netzwerk bewegt wird, müssen wir uns mit einigen Begriffen vertraut machen. Wenn Sie einen Brief versenden, müssen Sie wissen, an wen er gesendet wird und woher er kommt. Pakete benötigen dieselben Informationen, unsere Hosts und andere Hosts werden mithilfe von MAC (Media Access Control)-Adressen und IP-Adressen identifiziert. Um es uns Menschen leichter zu machen, verwenden wir Hostnamen, um einen Host zu identifizieren.\n\n<b>MAC-Adressen</b>\n\nEine MAC-Adresse ist ein eindeutiger Bezeichner, der als Hardwareadresse verwendet wird. Diese Adresse ändert sich nie. Wenn Sie Zugriff auf das Internet erhalten möchten, benötigt Ihr Gerät eine sogenannte Netzwerkschnittstellenkarte. Dieser Netzwerkadapter verfügt über seine eigene Hardwareadresse, die zur Identifizierung Ihres Geräts verwendet wird. Eine MAC-Adresse für ein Ethernet-Gerät sieht etwa so aus: 00:C4:B5:45:B2:43. MAC-Adressen werden den Netzwerkadaptern bei der Herstellung zugewiesen. Jeder Hersteller hat eine organisationsspezifische Kennung (OUI), um sie als Hersteller zu identifizieren. Diese OUI wird durch die ersten 3 Bytes der MAC-Adresse angegeben. Zum Beispiel hat Dell 00-14-22, sodass ein Netzwerkadapter von Dell eine MAC-Adresse wie: 00-14-22-34-B2-C2 haben könnte. \n\n<b>IP-Adressen</b>\n\nEine IP-Adresse wird verwendet, um ein Gerät in einem Netzwerk zu identifizieren. Sie sind hardwareunabhängig und können je nach Verwendung von IPv4 oder IPv6 in der Syntax variieren (dazu später mehr). Für den Moment gehen wir davon aus, dass Sie IPv4 verwenden, sodass eine typische IP-Adresse so aussehen würde: 10.24.12.4. IP-Adressen werden auf der Softwareseite des Netzwerks verwendet. Jedes Mal, wenn ein System mit dem Internet verbunden ist, sollte es eine IP-Adresse haben. Sie können sich auch ändern, wenn sich Ihr Netzwerk ändert, und sind eindeutig für das gesamte Internet (dies ist nicht immer der Fall, wenn wir über NAT lernen). \n\nDenken Sie daran, dass es sowohl Software als auch Hardware benötigt, um Pakete über Netzwerke zu bewegen. Daher haben wir zwei Bezeichner für jede, MAC (Hardware) und IP (Software).\n\n<b>Hostnamen</b>\n\nEine letzte Möglichkeit, Ihre Geräte zu identifizieren, ist durch Hostnamen. Hostnamen nehmen Ihre IP-Adresse und ermöglichen es Ihnen, diese Adresse mit einem menschenlesbaren Namen zu verknüpfen. Anstatt sich 192.12.41.4 zu merken, können Sie sich einfach myhost.com merken.",
  "exercise": "Für diese Lektion sind keine Übungen verfügbar.",
  "quizQuestion": "Wie viele Bytes hat eine IPv4-Adresse?",
  "quizAnswer": "4",
  "slug": "netzwerkadressierung"
}