{
  "id": 3,
  "title": "TCP/IP-Modell",
  "lessonContent": "Das OSI-Modell hat letztendlich zum TCP/IP-Modell geführt, das die Grundlage des Internets bildet. Es handelt sich um die tatsächliche Implementierung von Netzwerken. Das TCP/IP-Modell verwendet die TCP/IP-Protokollsuite, die wir einfach als TCP/IP bezeichnen. Diese Protokolle arbeiten zusammen, um festzulegen, wie Daten gesammelt, adressiert, übertragen und durch ein Netzwerk geroutet werden sollen. Mit dem TCP/IP-Modell können wir sehen, wie diese Protokolle verwendet werden, um aufzuschlüsseln, wie ein Paket durch das Netzwerk reist.\n\n<b>Anwendungsschicht</b>\n\nDie oberste Schicht des TCP/IP-Modells. Sie bestimmt, wie die Programme Ihres Computers (wie z.B. Ihr Webbrowser) mit den Transportdiensten der Transportschicht interagieren, um die gesendeten oder empfangenen Daten anzuzeigen.\n\nDiese Schicht verwendet:\n<ul>\n<li>HTTP (Hypertext Transfer Protocol) - für Webseiten im Internet verwendet.</li>\n<li>SMTP (Simple Mail Transfer Protocol) - Übertragung von E-Mails</li>\n</ul>\n\n<b>Transportschicht</b>\n\nWie Daten übertragen werden, umfasst die Überprüfung der richtigen Ports, die Integrität der Daten und im Wesentlichen die Zustellung unserer Pakete.\n\nDiese Schicht verwendet:\n<ul>\n<li>TCP (Transmission Control Protocol) - zuverlässige Datenübertragung</li>\n<li>UDP (User Datagram Protocol) - unzuverlässige Datenübertragung</li>\n</ul>\n\n<b>Netzwerkschicht</b>\n\nDiese Schicht legt fest, wie Pakete zwischen Hosts und über Netzwerke hinweg bewegt werden.\n\nDiese Schicht verwendet:\n<ul>\n<li>IP (Internet Protocol) - Hilft dabei, Pakete von einer Maschine zur anderen zu routen.</li>\n<li>ICMP (Internet Control Message Protocol) - Hilft uns zu verstehen, was passiert, z.B. Fehlermeldungen und Debugging-Informationen.</li>\n</ul>\n\n<b>Verbindungsschicht</b>\n\nDiese Schicht legt fest, wie Daten über ein physisches Hardwarestück gesendet werden. Beispielsweise Daten, die über Ethernet, Glasfaser usw. übertragen werden.\n\nDie oben aufgeführten Listen von Protokollen, die jede Schicht verwendet, sind nicht umfassend, und Sie werden auf viele andere Protokolle stoßen, die eine Rolle spielen.\n\nIn den folgenden Lektionen werden wir uns mit jeder dieser Schichten befassen und besprechen, wie unser Paket durch das Netzwerk im Rahmen des TCP/IP-Modells verläuft (es gibt viele Perspektiven, wie ein Paket über Netzwerke reist, wir werden sie nicht alle betrachten, aber seien Sie sich bewusst, dass sie existieren).",
  "exercise": "Keine Übungen für diese Lektion.",
  "quizQuestion": "Was ist die oberste Schicht des TCP/IP-Modells?",
  "quizAnswer": "Anwendung",
  "slug": "tcpipmodel"
}