{
  "id": 6,
  "title": "Transportschicht",
  "lessonContent": "Die Transportschicht hilft uns, unsere Daten auf eine Weise zu übertragen, die von Netzwerken gelesen werden kann. Sie zerlegt unsere Daten in Stücke, die transportiert und in der richtigen Reihenfolge wieder zusammengesetzt werden. Diese Stücke werden als Segmente bezeichnet. Segmente erleichtern den Datentransport über Netzwerke. \n\n<b>Ports</b>\n\nObwohl wir über IP-Adressen wissen, wohin wir unsere Daten senden, sind sie nicht spezifisch genug, um unsere Daten an bestimmte Prozesse oder Dienste zu senden. Dienste wie HTTP verwenden einen Kommunikationskanal über Ports. Wenn wir Webseitendaten senden möchten, müssen wir sie über den HTTP-Port (Port 80) senden. Neben der Bildung von Segmenten fügt die Transportschicht auch die Quell- und Zielports dem Segment hinzu, damit der Empfänger beim Erhalt des endgültigen Pakets weiß, welchen Port er verwenden soll. \n\n<b>UDP</b>\n\nEs gibt zwei beliebte Transportprotokolle UDP und TCP. Wir werden UDP kurz besprechen und uns hauptsächlich auf TCP konzentrieren, da es am häufigsten verwendet wird.\n\nUDP ist keine zuverlässige Methode zum Transportieren von Daten, tatsächlich ist es ihm egal, ob Sie alle Ihre Originaldaten erhalten. Das mag schrecklich klingen, aber es hat seine Verwendungen, wie z.B. für das Streamen von Medien, es ist in Ordnung, wenn Sie einige Frames verlieren, im Gegenzug erhalten Sie Ihre Daten etwas schneller. \n\n<b>TCP</b>\n\nTCP bietet eine zuverlässige, verbindungsorientierte Datenstromübertragung. TCP verwendet Ports, um Daten zu und von Hosts zu senden. Eine Anwendung öffnet eine Verbindung von einem Port auf ihrem Host zu einem anderen Port auf einem entfernten Host. Um die Verbindung herzustellen, verwenden wir den TCP-Handshake. \n\n<ul>\n<li>Der Client (verbindender Prozess) sendet dem Server ein SYN-Segment, um eine Verbindung anzufordern</li>\n<li>Der Server sendet dem Client ein SYN-ACK-Segment, um die Verbindungsanforderung des Clients zu bestätigen</li>\n<li>Der Client sendet dem Server ein ACK, um die Verbindungsanforderung des Servers zu bestätigen</li>\n</ul>\n\nSobald diese Verbindung hergestellt ist, können Daten über eine TCP-Verbindung ausgetauscht werden. Die Daten werden in verschiedenen Segmenten gesendet und mit TCP-Sequenznummern verfolgt, damit sie in der richtigen Reihenfolge angeordnet werden können, wenn sie übermittelt werden. In unserem E-Mail-Beispiel fügt die Transportschicht dem Quellport des Quellhosts den Zielport (25) hinzu.",
  "exercise": "Für diese Lektion sind keine Übungen verfügbar.",
  "quizQuestion": "Was ist ein zuverlässiges Transportprotokoll?",
  "quizAnswer": "TCP",
  "slug": "transportschicht"
}