{
  "id": 8,
  "title": "Слой связи",
  "lessonContent": "Внизу модели TCP/IP находится Слой связи. Этот слой является аппаратно-специфическим слоем.\n\nНа уровне связи наш пакет еще раз инкапсулируется во что-то, называемое кадром. Заголовок кадра прикрепляет MAC-адреса источника и назначения наших хостов, контрольные суммы и разделители пакетов, чтобы приемник мог определить, когда заканчивается пакет. \n\nК счастью, мы находимся в одной сети, поэтому наш пакет не должен будет проходить далеко. Сначала на уровне связи прикрепляется мой MAC-адрес источника к заголовку кадра, но ему также нужно знать MAC-адрес Пэтти. Как он это узнает и как я могу его найти, поскольку он не в Интернете? Мы используем ARP!\n\n<b>ARP (Протокол разрешения адресов)</b>\n\nARP находит MAC-адрес, связанный с IP-адресом. ARP используется в пределах одной сети. Если Пэтти не находится в одной сети, мы бы использовали систему маршрутизации для определения следующего маршрутизатора, который получит пакет, и после того, как мы окажемся в одной сети, мы могли бы использовать ARP. \n\nКогда мы находимся в одной сети, системы сначала используют таблицу поиска ARP, которая хранит информацию о том, какие IP-адреса связаны с какими MAC-адресами. Если значения там нет, то используется ARP. Затем система отправит широковещательное сообщение в сеть с использованием протокола ARP, чтобы узнать, какой хост имеет IP-адрес 10.10.1.4. Широковещательное сообщение - это специальное сообщение, которое отправляется всем хостам в сети (удачно названо для отправки широковещания). Любая машина с запрошенным IP-адресом ответит ARP-пакетом, содержащим IP-адрес и MAC-адрес.\n\nТеперь, когда у нас есть все необходимые данные, IP-адрес и MAC-адреса, наш слой связи пересылает этот кадр через нашу сетевую карту, к следующему устройству и находит сеть Пэтти. Этот шаг немного сложнее, чем я только что объяснил, но мы обсудим более подробно в курсе по маршрутизации.\n\nИ вот простой (или не такой уж простой) проход пакета по слоям TCP/IP. Имейте в виду, что пакеты не передаются в одностороннем порядке, как это. Мы даже еще не попали в сеть Пэтти! При прохождении через сети требуется как минимум дважды проходить через модель TCP/IP, прежде чем какие-либо данные будут отправлены или получены. На самом деле, внешний вид этого пакета будет примерно таким: \n\n<b>Прохождение пакета</b>\n\n<ol>\n<li>Пит отправляет Пэтти электронное письмо: эти данные отправляются на транспортный уровень.</li>\n<li>Транспортный уровень инкапсулирует данные в заголовок TCP или UDP для формирования сегмента, сегмент прикрепляет порт назначения и источника TCP или UDP, затем сегмент отправляется на сетевой уровень.</li>\n<li>Сетевой уровень инкапсулирует TCP-сегмент внутри IP-пакета, он прикрепляет исходный и целевой IP-адреса. Затем маршрутизирует пакет на уровень связи.</li>\n<li>Пакет достигает физического оборудования Пита и инкапсулируется в кадр. MAC-адрес источника и назначения добавляются к кадру.</li>\n<li>Пэтти получает этот кадр данных через свой физический уровень и проверяет каждый кадр на целостность данных, затем деинкапсулирует содержимое кадра и отправляет IP-пакет на сетевой уровень.</li>\n<li>Сетевой уровень читает пакет, чтобы найти прикрепленные ранее исходный и целевой IP-адреса. Он проверяет, совпадает ли его IP с целевым IP, что так и есть! Он деинкапсулирует пакет и отправляет сегмент на транспортный уровень.</li>\n<li>Транспортный уровень деинкапсулирует сегменты, проверяет номера портов TCP или UDP и устанавливает соединение с уровнем приложения на основе этих портов.</li>\n<li>Уровень приложения получает данные от транспортного уровня на указанном порту и представляет их Пэтти в виде окончательного электронного письма</li>\n</ol>",
  "exercise": "Урок не содержит упражнений.",
  "quizQuestion": "Что используется для нахождения MAC-адреса в одной сети?",
  "quizAnswer": "ARP",
  "slug": "linklayer"
}