{
  "id": 4,
  "title": "Сетевое адресование",
  "lessonContent": "Прежде чем мы приступим к изучению того, как пакет перемещается по сети, нам необходимо ознакомиться с некоторой терминологией. Когда вы отправляете письмо, вам необходимо знать, кому оно адресовано и откуда оно исходит. Пакеты также требуют этой информации, наши хосты и другие хосты идентифицируются с использованием MAC-адресов (адресов управления доступом к среде) и IP-адресов, для удобства нас, людей, мы используем имена хостов для идентификации хоста.\n\n<b>MAC-адреса</b>\n\nMAC-адрес является уникальным идентификатором, используемым в качестве аппаратного адреса. Этот адрес никогда не изменится. Когда вы хотите получить доступ в Интернет, вашему устройству необходимо иметь устройство под названием сетевая карта. Этот сетевой адаптер имеет свой собственный аппаратный адрес, который используется для идентификации вашего устройства. MAC-адрес для устройства Ethernet выглядит примерно так: 00:C4:B5:45:B2:43. MAC-адреса присваиваются сетевым адаптерам при производстве. У каждого производителя есть уникальный идентификатор организации (OUI), который идентифицирует их как производителя. Этот OUI обозначается первыми 3 байтами MAC-адреса. Например, у Dell есть 00-14-22, поэтому сетевой адаптер от Dell может иметь MAC-адрес, например, такой: 00-14-22-34-B2-C2.\n\n<b>IP-адреса</b>\n\nIP-адрес используется для идентификации устройства в сети, они не зависят от аппаратных средств и могут отличаться по синтаксису в зависимости от того, используете ли вы IPv4 или IPv6 (о чем позже). На данный момент мы предположим, что вы используете IPv4, поэтому типичный IP-адрес будет выглядеть так: 10.24.12.4. IP-адреса используются на программном уровне сетевого взаимодействия. Всякий раз, когда система подключена к Интернету, у нее должен быть IP-адрес. Они также могут изменяться, если меняется ваша сеть, и они уникальны для всего Интернета (это не всегда так, как только мы узнаем о NAT).\n\nПомните, что для перемещения пакетов по сетям требуется как программное, так и аппаратное обеспечение, поэтому у нас есть два идентификатора для каждого, MAC (аппаратный) и IP (программный).\n\n<b>Имена хостов</b>\n\nЕще один способ идентификации ваших устройств - это через имена хостов. Имена хостов берут ваш IP-адрес и позволяют связать этот адрес с понятным для человека именем. Вместо того чтобы запоминать 192.12.41.4, вы можете просто запомнить myhost.com.",
  "exercise": "Урок не содержит упражнений.",
  "quizQuestion": "Сколько байтов в IPv4-адресе?",
  "quizAnswer": "4",
  "slug": "networkaddressing"
}