{
  "id": 3,
  "title": "Модель TCP/IP",
  "lessonContent": "Модель OSI породила то, что в конечном итоге стало моделью TCP/IP, и именно на этой модели основан Интернет. Это фактическая реализация сетевого взаимодействия. Модель TCP/IP использует набор протоколов TCP/IP, который мы обычно называем просто TCP/IP. Эти протоколы взаимодействуют между собой, чтобы определить, как данные должны быть собраны, адресованы, переданы и маршрутизированы через сеть. Используя модель TCP/IP, мы можем увидеть, как эти протоколы используются для демонстрации пути, по которому пакет проходит через сеть.\n\n<b>Прикладной уровень</b>\n\nВерхний уровень модели TCP/IP. Он определяет, как программы вашего компьютера (например, веб-браузер) взаимодействуют с услугами транспортного уровня для просмотра отправляемых или принимаемых данных.\n\nНа этом уровне используются:\n<ul>\n<li>HTTP (Протокол передачи гипертекста) - используется для веб-страниц в Интернете.</li>\n<li>SMTP (Простой протокол передачи почты) - передача электронной почты</li>\n</ul>\n\n<b>Транспортный уровень</b>\n\nОпределяет, как данные будут передаваться, включая проверку правильных портов, целостность данных и в основном доставку наших пакетов.\n\nНа этом уровне используются:\n<ul>\n<li>TCP (Протокол управления передачей) - надежная доставка данных</li>\n<li>UDP (Протокол пользовательских датаграмм) - ненадежная доставка данных</li>\n</ul>\n\n<b>Сетевой уровень</b>\n\nЭтот уровень определяет, как перемещать пакеты между хостами и через сети.\n\nНа этом уровне используются:\n<ul>\n<li>IP (Протокол интернета) - помогает маршрутизировать пакеты от одной машины к другой.</li>\n<li>ICMP (Протокол управления сообщениями Интернета) - помогает сообщить нам, что происходит, такие как сообщения об ошибках и отладочная информация.</li>\n</ul>\n\n<b>Уровень канала</b>\n\nЭтот уровень определяет, как отправлять данные через физическое оборудование, такое как передача данных через Ethernet, оптоволокно и т. д.\n\nПриведенные выше списки протоколов, используемых каждым уровнем, не исчерпывающи и вы столкнетесь с многими другими протоколами, которые также играют роль.\n\nВ следующих уроках мы рассмотрим каждый из этих уровней и обсудим, как наш пакет проходит через сеть с точки зрения модели TCP/IP (существует много точек зрения на то, как пакет проходит через сети, мы не рассмотрим их все, но будьте в курсе, что они существуют).",
  "exercise": "Урок не содержит упражнений.",
  "quizQuestion": "Какой верхний уровень модели TCP/IP?",
  "quizAnswer": "Прикладной",
  "slug": "tcpipmodel"
}