{
  "id": 6,
  "title": "Транспортный уровень",
  "lessonContent": "Транспортный уровень помогает нам передавать наши данные таким образом, чтобы сети могли их прочитать. Он разбивает наши данные на кусочки, которые будут транспортироваться и собираться в правильном порядке. Эти кусочки известны как сегменты. Сегменты упрощают транспортировку данных по сетям. \n\n<b>Порты</b>\n\nНесмотря на то, что мы знаем, куда отправляем наши данные по IP-адресам, они не достаточно конкретны, чтобы отправить наши данные определенным процессам или службам. Службы, такие как HTTP, используют канал связи через порты. Если мы хотим отправить данные веб-страницы, нам нужно отправить их через порт HTTP (порт 80). Помимо формирования сегментов, транспортный уровень также присоединяет к сегменту исходные и конечные порты, чтобы получатель, получив окончательный пакет, знал, какой порт использовать. \n\n<b>UDP</b>\n\nСуществуют два популярных транспортных протокола: UDP и TCP. Мы кратко обсудим UDP и проведем большую часть времени на TCP, поскольку он наиболее часто используется.\n\nUDP не является надежным методом передачи данных, на самом деле ему не важно, получите ли вы все ваши исходные данные. Это может показаться ужасным, но у него есть свои преимущества, например, для потоковой передачи мультимедиа, нормально, если вы потеряете несколько кадров, зато данные придут немного быстрее. \n\n<b>TCP</b>\n\nTCP обеспечивает надежное соединение, ориентированное на поток данных. TCP использует порты для отправки данных от и к хостам. Приложение открывает соединение с одного порта на своем хосте на другой порт на удаленном хосте. Для установления соединения мы используем рукопожатие TCP. \n\n<ul>\n<li>Клиент (процесс подключения) отправляет серверу сегмент SYN для запроса соединения</li>\n<li>Сервер отправляет клиенту сегмент SYN-ACK для подтверждения запроса клиента на соединение</li>\n<li>Клиент отправляет ACK серверу для подтверждения запроса сервера на соединение</li>\n</ul>\n\nПосле установления этого соединения данные могут обмениваться по TCP-соединению. Данные отправляются различными сегментами и отслеживаются с помощью номеров последовательности TCP, чтобы их можно было упорядочить в правильном порядке при доставке. В нашем примере с электронной почтой транспортный уровень присоединяет конечный порт (25) к исходному порту исходного хоста.",
  "exercise": "Урок не содержит упражнений.",
  "quizQuestion": "Что такое надежный транспортный протокол?",
  "quizAnswer": "TCP",
  "slug": "transportlayer"
}