{
  "id": 7,
  "title": "dd",
  "lessonContent": "डीडी टूल डेटा कनवर्ट और कॉपी करने के लिए बहुत उपयोगी है। यह एक फ़ाइल या डेटा स्ट्रीम से इनपुट पढ़ता है और इसे एक फ़ाइल या डेटा स्ट्रीम में लिखता है। \n\nनिम्नलिखित कमांड को ध्यान से देखें: \n\n<pre>$ dd if=/home/pete/backup.img of=/dev/sdb bs=1024 </pre>\n\nयह कमांड backup.img की सामग्री को /dev/sdb पर कॉपी कर रहा है। यह 1024 बाइट के ब्लॉक में डेटा कॉपी करेगा जब तक कॉपी करने के लिए डेटा न रह जाए। \n\n<ul>\n<li>if=file - इनपुट फ़ाइल, स्टैंडर्ड इनपुट की बजाय फ़ाइल से पढ़ें</li>\n<li>of=file - आउटपुट फ़ाइल, स्टैंडर्ड आउटपुट की बजाय फ़ाइल में लिखें</li>\n<li>bs=bytes - ब्लॉक साइज़, यह इस संख्या के बाइट डेटा को पढ़ता और लिखता है। आप आकार को k के साथ निर्दिष्ट करके विभिन्न आकार मेट्रिक का उपयोग कर सकते हैं, जैसे 1024 बाइट 1k है</li>\n<li>count=number - कॉपी करने के लिए ब्लॉकों की संख्या।</li>\n</ul>\n\nआपको कुछ dd कमांड देखने को मिलेंगे जो काउंट विकल्प का उपयोग करते हैं, सामान्यत: dd if के साथ जब आप एक 1 मेगाबाइट फ़ाइल कॉपी करना चाहते हैं, तो आप उस फ़ाइल को 1 मेगाबाइट के रूप में देखना चाहेंगे। मान लें आप निम्नलिखित कमांड चलाते हैं: \n\n<pre>$ dd if=/home/pete/backup.img of=/dev/sdb bs=1M count=2</pre>\n\nहमारी backup.img फ़ाइल 10M है, हालांकि, हम इस कमांड में केवल 1M को 2 बार कॉपी करने के लिए कह रहे हैं, इसलिए केवल 2M कॉपी किया जा रहा है, हमारा कॉपी किया डेटा अधूरा है। काउंट बहुत सी स्थितियों में उपयोगी हो सकता है, लेकिन यदि आप केवल डेटा कॉपी कर रहे हैं, तो आप काउंट और बीएस को छोड़ सकते हैं। यदि आप वास्तव में अपने डेटा स्थानांतरण को अनुकूल करना चाहते हैं, तो आपको उन विकल्पों का उपयोग करना होगा।\n\ndd अत्यधिक शक्तिशाली है, आप इसका उपयोग किसी भी चीज़ की बैकअप बनाने, पूरे डिस्क ड्राइव की बैकअप बनाने, डिस्क इमेजेस को पुनर्स्थापित करने और अधिक कुछ करने के लिए कर सकते हैं। सावधान रहें, यदि आप नहीं जानते कि आप क्या कर रहे हैं तो वह शक्तिशाली टूल एक मूल्य पर आ सकता है।",
  "exercise": "अपने ड्राइव की बैकअप बनाने के लिए dd कमांड का उपयोग करें और आउटपुट को .img फ़ाइल में सेट करें।",
  "quizQuestion": "ब्लॉक साइज़ के लिए dd विकल्प क्या है?",
  "quizAnswer": "bs",
  "slug": "ddcommand"
}