{
  "id": 2,
  "title": "डिवाइस प्रकार",
  "lessonContent": "हम डिवाइस कैसे प्रबंधित किए जाते हैं इसके बारे में चर्चा करने से पहले, चलो वास्तव में कुछ डिवाइसों को देखते हैं।\n\n<pre>$ ls -l /dev\nbrw-rw----   1 root disk      8,   0 Dec 20 20:13 sda\ncrw-rw-rw-   1 root root      1,   3 Dec 20 20:13 null\nsrw-rw-rw-   1 root root           0 Dec 20 20:13 log\nprw-r--r--   1 root root           0 Dec 20 20:13 fdata\n</pre>\n\nकॉलम निम्नलिखित हैं बाएं से दाएं:\n\n<ul>\n<li>अनुमतियाँ</li>\n<li>मालिक</li>\n<li>समूह</li>\n<li>मेजर डिवाइस नंबर</li>\n<li>माइनर डिवाइस नंबर</li>\n<li>समयचिह्न</li>\n<li>डिवाइस नाम</li>\n</ul>\n\nध्यान दें कि ls कमांड में आप प्रत्येक पंक्ति के पहले बिट के साथ फ़ाइल के प्रकार को देख सकते हैं। डिवाइस फ़ाइलें निम्नलिखित रूप में दर्शाई जाती हैं:\n\n<ul>\n<li>c - character</li>\n<li>b - block</li>\n<li>p - pipe</li>\n<li>s - socket</li>\n</ul>\n\n<b>चरित्र डिवाइस</b>\n\nये डिवाइस डेटा स्थानांतरित करते हैं, लेकिन एक बार में केवल एक चरित्र। आप चरित्र डिवाइस के रूप में बहुत सारी जाली डिवाइसेस (/dev/null) देखेंगे, ये डिवाइसेस वास्तव में मशीन से भौतिक रूप से जुड़े नहीं हैं, लेकिन इन्हें ऑपरेटिंग सिस्टम को अधिक कार्यक्षमता प्रदान करने दिया जाता है।\n\n<b>ब्लॉक डिवाइस</b>\n\nये डिवाइस डेटा स्थानांतरित करते हैं, लेकिन बड़े निश्चित आकार के ब्लॉक में। आप डेटा ब्लॉक का उपयोग करने वाली डिवाइसेस को ब्लॉक डिवाइस के रूप में सबसे अधिक देखेंगे, जैसे हार्ड ड्राइव्स, फ़ाइल सिस्टम्स, आदि।\n\n<b>पाइप डिवाइस</b>\n\nनेम्ड पाइप्स दो या दो से अधिक प्रक्रियाओं को एक-दूसरे के साथ संवाद करने की अनुमति देती हैं, ये चरित्र डिवाइसेस के लगभग समान हैं, लेकिन उनका आउटपुट एक डिवाइस पर भेजने की जगह, दूसरी प्रक्रिया को भेजा जाता है।\n\n<b>सॉकेट डिवाइस</b>\n\nसॉकेट डिवाइसेस प्रक्रियाओं के बीच संवाद को सुविधाजनक बनाती हैं, पाइप डिवाइसेस के समान हैं लेकिन इन्हें एक साथ कई प्रक्रियाओं के साथ संवाद करने की अनुमति होती है।\n\n<b>डिवाइस चरित्रीकरण</b>\n\nडिवाइस को दो संख्याओं, <b>मेजर डिवाइस नंबर</b> और <b>माइनर डिवाइस नंबर</b> का उपयोग करके चरित्रीकृत किया जाता है। आप उपरोक्त ls उदाहरण में इन नंबरों को देख सकते हैं, इन्हें एक कमा द्वारा अलग किया गया है। उदाहरण के लिए, चलो कहें कि एक डिवाइस के पास डिवाइस नंबर हैं: <b>8, 0</b>:\n\nमेजर डिवाइस नंबर उस डिवाइस ड्राइवर को प्रतिनिधित करता है जिसका उपयोग किया जाता है, इस मामले में 8, जो अक्सर एसडी ब्लॉक डिवाइसेस के लिए मेजर नंबर होता है। माइनर नंबर कर्नल को बताता है कि इस ड्राइवर वर्ग में यह अद्वितीय डिवाइस कौन सा है, इस मामले में 0 पहले डिवाइस (ए) को प्रतिनिधित करने के लिए उपयोग किया जाता है।",
  "exercise": "अपने /dev निर्देशिका पर नजर डालें और देखें कि आप किस प्रकार की डिवाइस देख सकते हैं।",
  "quizQuestion": "ls -l कमांड में चरित्र डिवाइस के लिए प्रतीक क्या है?",
  "quizAnswer": "c",
  "slug": "devicetypes"
}