{
  "id": 3,
  "title": "सीडी (डायरेक्टरी बदलें)",
  "lessonContent": "अब जब आप जान चुके हैं कि आप कहाँ हैं, तो चलिए देखते हैं कि हम फाइल सिस्टम में थोड़ा घूम सकते हैं। ध्यान रखें हमें पथ का उपयोग करके अपना मार्ग निर्धारित करना होगा। पथ को निर्दिष्ट करने के दो विभिन्न तरीके हैं, अधिसूचित और सांदरिक पथों के साथ।\n\n<ul>\n<li>अधिसूचित पथ: यह मूल डायरेक्टरी से पथ है। मूल डायरेक्टरी मुख्य है। मूल डायरेक्टरी को सामान्य रूप से एक स्लैश के रूप में दिखाया जाता है। हर बार जब आपका पथ / के साथ शुरू होता है तो इसका मतलब है कि आप मूल डायरेक्टरी से शुरू कर रहे हैं। उदाहरण के लिए, /home/pete/Desktop।</li>\n\n<li>सांदरिक पथ: यह वह पथ है जो आप वर्तमान में फाइल सिस्टम में हैं। यदि मैं स्थान /home/pete/Documents में हो और मुझे Documents के भीतर एक डायरेक्टरी में जाना है जिसका नाम taxes है, तो मुझे पूरे पथ को निर्दिष्ट करने की आवश्यकता नहीं है जैसे कि /home/pete/Documents/taxes, मैं taxes/ में जा सकता हूँ।</li>\n</ul>\n\nअब जब आपको पथ काम करने के बारे में पता चल गया है, हमें बस उस डायरेक्टरी में जाने के लिए कुछ चाहिए। भाग्य से, हमारे पास सीडी या “डायरेक्टरी बदलें” है जो ऐसा करने में मदद करेगा।\n\n<pre>$ cd /home/pete/Pictures</pre> \n\nइसलिए अब मैंने अपनी डायरेक्टरी स्थान को /home/pete/Pictures में बदल दिया है।\n\nअब इस डायरेक्टरी से मेरे पास Hawaii नामक एक फोल्डर है, मैं उस फोल्डर में जा सकता हूँ इसके साथ:\n\n<pre>$ cd Hawaii</pre>\n\nध्यान दें कि मैंने फोल्डर का नाम ही क्यों इस्तेमाल किया? यह इसलिए कि मैं पहले से ही /home/pete/Pictures में था।\n\nयह अधिसूचित और सांदरिक पथों के साथ हर समय घूमना थका देने वाला हो सकता है, भाग्य से आपकी मदद के लिए कुछ शॉर्टकट हैं।\n\n<ul>\n<li>. (वर्तमान डायरेक्टरी). यह वह डायरेक्टरी है जिसमें आप वर्तमान में हैं। </li>\n<li>.. (पिछली डायरेक्टरी). आपको आपकी वर्तमान से ऊपर की डायरेक्टरी में ले जाता है।</li>\n<li>~ (होम डायरेक्टरी). यह डायरेक्टरी आपकी “होम डायरेक्टरी” पर डिफ़ॉल्ट होती है। जैसे कि /home/pete।</li>\n<li>- (पिछली डायरेक्टरी). यह आपको उस पिछली डायरेक्टरी में ले जाएगा जिसमें आप अभी थे।</li>\n</ul>\n\n<pre>$ cd .\n$ cd ..\n$ cd ~\n$ cd -\n</pre>\nउन्हें एक बार आजमाएँ!",
  "exercise": "<ol>\n<li>किसी भी फ्लैग के बिना सीडी कमांड चलाएं, यह आपको कहाँ ले जाता है?</li>\n</ol>",
  "quizQuestion": "/home/pete/Pictures में अगर आप /home/pete जाना चाहते हैं, तो कौन सा अच्छा शॉर्टकट उपयोग करना चाहिए?",
  "quizAnswer": "cd ..",
  "slug": "changedirectorycdcommand"
}