{
  "id": 4,
  "title": "ls (लिस्ट डायरेक्टरीज)",
  "lessonContent": "अब जब हमें प्रणाली में घूमने का तरीका पता चल गया है, तो हम कैसे पता करें कि हमारे लिए क्या उपलब्ध है? अभी तक ऐसा लगता है कि हम अंधेरे में घूम रहे हैं। अच्छा, हम विचित्र ls कमांड का उपयोग कर सकते हैं ताकि डायरेक्टरी सामग्री की सूची बना सकें। ls कमांड डिफ़ॉल्ट रूप से वर्तमान डायरेक्टरी में डायरेक्टरी और फ़ाइलों की सूची दिखाएगा, हालांकि आप यह भी निर्दिष्ट कर सकते हैं कि आप किस पथ की डायरेक्टरियों की सूची देखना चाहते हैं।\n\n<pre>$ ls\n$ ls /home/pete</pre>\n\nls एक काफी उपयोगी उपकरण है, यह आपको उन फ़ाइलों और डायरेक्टरियों के बारे में विस्तृत जानकारी भी दिखाता है जिन्हें आप देख रहे हैं।\n\nध्यान दें कि एक डायरेक्टरी में सभी फ़ाइलें दिखाई नहीं देती हैं। . से शुरू होने वाले फ़ाइलनाम छिपे होते हैं, आप उन्हें ls कमांड के साथ देख सकते हैं और उसे -a फ़्लैग पास कर सकते हैं (a सभी के लिए)।\n\n<pre>$ ls -a</pre>\n\nएक और उपयोगी ls फ़्लैग भी है, -l लंबा के लिए, यह एक विस्तृत सूची दिखाएगा। यह आपको विस्तृत जानकारी दिखाएगा, बाएं से शुरू होकर: फ़ाइल अनुमतियाँ, लिंकों की संख्या, मालिक का नाम, मालिक समूह, फ़ाइल का आकार, पिछले संशोधन का समयचिह्न, और फ़ाइल/डायरेक्टरी का नाम।\n\n<pre>$ ls -l</pre>\n\n<pre>pete@icebox:~$ ls -l\ntotal 80\ndrwxr-x--- 7 pete penguingroup   4096 Nov 20 16:37 Desktop\ndrwxr-x--- 2 pete penguingroup   4096 Oct 19 10:46  Documents\ndrwxr-x--- 4 pete penguingroup   4096 Nov 20 09:30 Downloads\ndrwxr-x--- 2 pete penguingroup   4096 Oct  7 13:13   Music\ndrwxr-x--- 2 pete penguingroup   4096 Sep 21 14:02 Pictures\ndrwxr-x--- 2 pete penguingroup   4096 Jul 27 12:41   Public\ndrwxr-x--- 2 pete penguingroup   4096 Jul 27 12:41   Templates\ndrwxr-x--- 2 pete penguingroup   4096 Jul 27 12:41   Videos</pre>\n\nकमांड्स के पास चीज़ें होती हैं जिन्हें फ़्लैग्स (या तर्क या विकल्प भी कह सकते हैं) कहा जाता है जो अधिक कार्यक्षमता जोड़ने के लिए होते हैं। देखें कैसे हमने -a और -l जोड़ दिए, अच्छा आप उन्हें -la के साथ एक साथ जोड़ सकते हैं। फ़्लैग्स के क्रम यह निर्धारित करता है कि यह किस क्रम में जाता है, ज्यादातर समय यह काफी मायने नहीं रखता है तो आप ls -al भी कर सकते हैं और यह काम करेगा।\n\n<pre>$ ls -la</pre>",
  "exercise": "विभिन्न फ्लैग्स के साथ ls चलाएं और प्राप्त की गई आउटपुट देखें।",
  "quizQuestion": "छिपी हुई फ़ाइलें देखने के लिए आप कौन सा कमांड उपयोग करेंगे?",
  "quizAnswer": "ls -a",
  "slug": "listdirectorieslscommand"
}