{
  "id": 4,
  "title": "netstat",
  "lessonContent": "<b>Puertos Bien Conocidos</b>\n\nHemos discutido la transmisión de datos a través de puertos en nuestra máquina, veamos algunos puertos bien conocidos.\n\nPuedes obtener una lista de puertos bien conocidos mirando el archivo <b>/etc/services</b>: \n\n<pre>\nftp             21/tcp\nssh             22/tcp\nsmtp            25/tcp \ndomain          53/tcp  # DNS\nhttp            80/tcp\nhttps           443/tcp\n..etc..\n</pre>\n\nLa primera columna es el nombre del servicio, luego el número de puerto y el protocolo de capa de transporte que utiliza.\n\n<b>netstat</b>\n\nUna herramienta extremadamente útil para obtener información detallada sobre tu red es <b>netstat</b>. Netstat muestra varias informaciones relacionadas con la red como conexiones de red, tablas de enrutamiento, información sobre interfaces de red y más, es la navaja suiza de las herramientas de red. Nos enfocaremos principalmente en una característica que tiene netstat y es el estado de las conexiones de red. Antes de ver un ejemplo, hablemos primero sobre sockets y puertos. Un socket es una interfaz que permite a los programas enviar y recibir datos mientras que un puerto se utiliza para identificar qué aplicación debe enviar o recibir datos. La dirección del socket es la combinación de la dirección IP y el puerto. Cada conexión entre un host y un destino requiere un socket único. Por ejemplo, HTTP es un servicio que se ejecuta en el puerto 80, sin embargo, podemos tener muchas conexiones HTTP y para mantener cada conexión se crea un socket por conexión.\n\n<pre>\npete@icebox:~$ netstat -at\nConexiones activas de Internet (servidores y establecidas)\nProto Recv-Q Send-Q Dirección local           Dirección remota         Estado      \ntcp        0      0 icebox:domain           *:*                     LISTEN     \ntcp        0      0 localhost:ipp           *:*                     LISTEN     \ntcp        0      0 icebox.lan:44468        124.28.28.50:http       TIME_WAIT  \ntcp        0      0 icebox.lan:34751        124.28.29.50:http       TIME_WAIT  \ntcp        0      0 icebox.lan:34604        economy.canonical.:http TIME_WAIT  \ntcp6       0      0 ip6-localhost:ipp       [::]:*                  LISTEN     \ntcp6       1      0 ip6-localhost:35094     ip6-localhost:ipp       CLOSE_WAIT \ntcp6       0      0 ip6-localhost:ipp       ip6-localhost:35094     FIN_WAIT2\n</pre>\n\nEl comando netstat -a muestra los sockets que escuchan y los que no escuchan para las conexiones de red, la bandera -t muestra solo las conexiones tcp. \n\nLas columnas son las siguientes de izquierda a derecha:\n\n<ul>\n<li>Proto: Protocolo utilizado, TCP o UDP.</li>\n<li>Recv-Q: Datos en cola para ser recibidos</li>\n<li>Send-Q: Datos en cola para ser enviados</li>\n<li>Dirección Local: Host conectado localmente</li>\n<li>Dirección Remota: Host conectado remotamente</li>\n<li>Estado: El estado del socket</li>\n</ul>\n\nConsulta la página del manual para ver una lista de estados de socket, pero aquí tienes algunos:\n\n<ul>\n<li>LISTENING: El socket está escuchando conexiones entrantes, recuerda que cuando hacemos una conexión TCP nuestro destino tiene que estar escuchando antes de que podamos conectar.</li>\n<li>SYN_SENT: El socket está intentando activamente establecer una conexión.</li>\n<li>ESTABLISHED: El socket tiene una conexión establecida</li>\n<li>CLOSE_WAIT: El host remoto se ha desconectado y estamos esperando que el socket se cierre</li>\n<li>TIME_WAIT: El socket está esperando después de cerrarse para manejar paquetes que aún están en la red</li>\n </ul>",
  "exercise": "Mira la página del manual de netstat y aprende todas las funciones que tiene para ofrecer.",
  "quizQuestion": "¿Qué puerto se utiliza para HTTPS?",
  "quizAnswer": "443",
  "slug": "netstat"
}