{
  "id": 5,
  "title": "Análisis de paquetes",
  "lessonContent": "El tema del análisis de paquetes podría llenar un curso completo y hay muchos libros escritos solo sobre el análisis de paquetes. Sin embargo, hoy solo aprenderemos lo básico. Hay dos analizadores de paquetes extremadamente populares, Wireshark y tcpdump. Estas herramientas escanean las interfaces de red, capturan la actividad de los paquetes, analizan los paquetes y nos muestran la información. Nos permiten adentrarnos en los detalles del análisis de red y meternos en cosas de bajo nivel. Usaremos tcpdump ya que tiene una interfaz más simple, sin embargo, si decidieras incorporar el análisis de paquetes a tu cinturón de herramientas, te recomendaría investigar Wireshark.\n\n<b>Instalar tcpdump</b>\n\n<pre>\n$ sudo apt install tcpdump\n</pre>\n\n<b>Capturar datos de paquetes en una interfaz</b>\n\n<pre>\npete@icebox:~$ sudo tcpdump -i wlan0\ntcpdump: salida detallada suprimida, usa -v o -vv para decodificación de protocolo completa\nescuchando en wlan0, tipo de enlace EN10MB (Ethernet), tamaño de captura 65535 bytes\n11:28:23.958840 IP icebox.lan > nuq04s29-in-f4.1e100.net: solicitud de eco ICMP, id 1901, seq 2, longitud 64\n11:28:23.970928 IP nuq04s29-in-f4.1e100.net > icebox.lan: respuesta de eco ICMP, id 1901, seq 2, longitud 64\n11:28:24.960464 IP icebox.lan > nuq04s29-in-f4.1e100.net: solicitud de eco ICMP, id 1901, seq 3, longitud 64\n11:28:24.979299 IP nuq04s29-in-f4.1e100.net > icebox.lan: respuesta de eco ICMP, id 1901, seq 3, longitud 64\n11:28:25.961869 IP icebox.lan > nuq04s29-in-f4.1e100.net: solicitud de eco ICMP, id 1901, seq 4, longitud 64\n11:28:25.976176 IP nuq04s29-in-f4.1e100.net > icebox.lan: respuesta de eco ICMP, id 1901, seq 4, longitud 64\n11:28:26.963667 IP icebox.lan > nuq04s29-in-f4.1e100.net: solicitud de eco ICMP, id 1901, seq 5, longitud 64\n11:28:26.976137 IP nuq04s29-in-f4.1e100.net > icebox.lan: respuesta de eco ICMP, id 1901, seq 5, longitud 64\n11:28:30.674953 ARP, Solicitud de quién tiene 172.254.1.0 informa a ThePickleParty.lan, longitud 28\n11:28:31.190665 IP ThePickleParty.lan.51056 > 192.168.86.255.rfe: UDP, longitud 306\n</pre>\n\nNotarás que ocurren muchas cosas cuando ejecutas una captura de paquetes, bueno, se espera que haya mucha actividad de red en segundo plano. En mi ejemplo anterior, he tomado solo un fragmento de mi captura específicamente en el momento en que decidí hacer ping a www.google.com. \n\n<b>Entendiendo la salida</b>\n\n<pre>\n11:28:23.958840 IP icebox.lan > nuq04s29-in-f4.1e100.net: solicitud de eco ICMP, id 1901, seq 2, longitud 64\n11:28:23.970928 IP nuq04s29-in-f4.1e100.net > icebox.lan: respuesta de eco ICMP, id 1901, seq 2, longitud 64\n</pre>\n\n<ul>\n<li>El primer campo es una marca de tiempo de la actividad de red</li>\n<li>IP, esto contiene la información del protocolo</li>\n<li>A continuación, verás la dirección de origen y destino: icebox.lan > nuq04s29-in-f4.1e100.net</li>\n<li>seq, este es el número de secuencia de inicio y finalización de los paquetes TCP</li>\n<li>longitud, longitud en bytes</li>\n</ul>\n\nComo se puede ver en nuestra salida de tcpdump, ¡estamos enviando un paquete de solicitud de eco ICMP a www.google.com y recibiendo un paquete de respuesta de eco ICMP a cambio! También ten en cuenta que diferentes paquetes mostrarán diferente información, consulta la página del manual para ver cuáles son.\n\n<b>Escribir la salida de tcpdump en un archivo</b>\n\n<pre>\n$ sudo tcpdump -w /algún/archivo\n</pre>\n\n\nAlgunas reflexiones finales: solo hemos arañado la superficie del tema del análisis de paquetes. Hay mucho que puedes explorar y ni siquiera hemos tocado el ir aún más profundo con la salida en Hex y ASCII. Hay muchas recursos en línea para ayudarte a aprender más sobre analizadores de paquetes y te insto a encontrarlos!",
  "exercise": "Descarga e instala la herramienta Wireshark y juega con la interfaz.",
  "quizQuestion": "¿Cuál es la bandera para capturar una interfaz específica con tcpdump?",
  "quizAnswer": "-i",
  "slug": "analisispaquetes"
}