{
  "id": 2,
  "title": "ping",
  "lessonContent": "Una de las herramientas de red más simples <b>ping</b>, se utiliza para probar si un paquete puede llegar a un host. Funciona enviando paquetes de solicitud de eco ICMP (Tipo 8) al host de destino y esperando una respuesta de eco ICMP (Tipo 0). El ping es exitoso cuando un host envía el paquete de solicitud y recibe una respuesta del objetivo. Veamos un ejemplo: \n\n<pre>\npete@icebox:~$ ping -c 3 www.google.com\nPING www.google.com (74.125.239.112) 56(84) bytes of data.\n64 bytes from nuq05s01-in-f16.1e100.net (74.125.239.112): icmp_seq=1 ttl=128 time=29.0 ms\n64 bytes from nuq05s01-in-f16.1e100.net (74.125.239.112): icmp_seq=2 ttl=128 time=23.7 ms\n64 bytes from nuq05s01-in-f16.1e100.net (74.125.239.112): icmp_seq=3 ttl=128 time=15.1 ms\n</pre>\n\nEn este ejemplo, estamos usando ping para verificar si podemos llegar a www.google.com. La bandera -c (conteo) se utiliza para dejar de enviar paquetes de solicitud de eco después de que se haya alcanzado el conteo. \n\nLa primera parte dice que estamos enviando paquetes de 64 bytes a 74.125.239.112 (google.com) y el resto nos muestra los detalles del viaje. Por defecto, envía un paquete por segundo.\n\n<b>icmp_seq</b>\n\nEl campo icmp_seq se utiliza para mostrar el número de secuencia de los paquetes enviados, por lo que en este caso, envié 3 paquetes y podemos ver que 3 paquetes regresaron. Si haces un ping y te faltan algunos números de secuencia, eso significa que hay algún problema de conectividad y no todos tus paquetes están llegando. Si el número de secuencia está fuera de orden, tu conexión probablemente es muy lenta ya que tus paquetes están excediendo el valor predeterminado de un segundo. \n\n<b>ttl</b>\n\nEl campo Tiempo de Vida (ttl) se utiliza como contador de saltos, a medida que haces saltos, decrementa el contador en uno y una vez que el contador de saltos llega a 0, nuestro paquete muere. Esto está destinado a darle al paquete una vida útil, no queremos que nuestros paquetes viajen para siempre.\n\n<b>time</b>\n\nEl tiempo de ida y vuelta que tomó desde que enviaste el paquete de solicitud de eco hasta recibir una respuesta de eco.",
  "exercise": "Realiza un ping a un sitio web y observa la salida que recibes.",
  "quizQuestion": "¿Cuál es la unidad de medida del tiempo de ida y vuelta?",
  "quizAnswer": "ms",
  "slug": "ping"
}