{
  "id": 2,
  "title": "Modificando Permisos",
  "lessonContent": "Cambiar permisos se puede hacer fácilmente con el comando <b>chmod</b>. \n\nPrimero, elige qué conjunto de permisos deseas cambiar, usuario, grupo u otro. Puedes agregar o quitar permisos con un <b>+</b> o un <b>-</b>, veamos algunos ejemplos.\n\n<b>Agregar un bit de permiso en un archivo</b>\n<pre>$ chmod u+x myfile</pre>\n\nEl comando anterior se lee así: cambia el permiso en myfile agregando un bit de permiso ejecutable en el conjunto de usuario. ¡Así que ahora el usuario tiene permiso ejecutable en este archivo!\n\n<b>Quitar un bit de permiso en un archivo</b>\n<pre>$ chmod u-x myfile</pre>\n\n<b>Agregar múltiples bits de permiso en un archivo</b>\n<pre>$ chmod ug+w</pre>\n\nHay otra forma de cambiar permisos usando formato numérico. Este método te permite cambiar todos los permisos de una vez. En lugar de usar r, w o x para representar permisos, usarás una representación numérica para un solo conjunto de permisos. Así que no es necesario especificar el grupo con g o el usuario con u.\n\nLas representaciones numéricas se muestran a continuación:\n\n<ul>\n<li>4: permiso de lectura</li>\n<li>2: permiso de escritura</li>\n<li>1: permiso de ejecución</li>\n</ul>\n\nVeamos un ejemplo: \n\n<pre>$ chmod 755 myfile</pre>\n\n¿Puedes adivinar qué permisos estamos dando a este archivo? Vamos a desglosarlo, entonces ahora 755 cubre los permisos para todos los conjuntos. El primer número (7) representa los permisos de usuario, el segundo número (5) representa los permisos de grupo y el último 5 representa los permisos de otros. \n\nEspera un minuto, 7 y 5 no se mencionaron anteriormente, ¿de dónde sacamos estos números? Recuerda que estamos combinando todos los permisos en un solo número ahora, así que tendrás que hacer un poco de matemáticas.\n\n7 = 4 + 2 + 1, entonces 7 son los permisos de usuario y tiene permisos de lectura, escritura y ejecución\n\n5 = 4 + 1, el grupo tiene permisos de lectura y ejecución\n\n5 = 4 + 1, y todos los demás usuarios tienen permisos de lectura y ejecución\n\nUna cosa a tener en cuenta: no es una gran idea cambiar permisos sin ton ni son, podrías potencialmente exponer un archivo sensible para que todos lo modifiquen, sin embargo muchas veces quieres cambiar permisos legítimamente, solo toma precauciones al usar el comando chmod.",
  "exercise": "Cambia algunos permisos básicos de archivos de texto y observa cómo cambian los bits al hacer un ls -l.",
  "quizQuestion": "¿Qué número representa el permiso de lectura al usar formato numérico?",
  "quizAnswer": "4",
  "slug": "modificandopermisos"
}