{
  "id": 7,
  "title": "Permisos de Procesos",
  "lessonContent": "Vamos a adentrarnos un poco en los permisos de procesos, ¿recuerdas cuando te dije que al ejecutar el comando passwd con el bit de permiso SUID habilitado ejecutarás el programa como root? Eso es cierto, sin embargo, ¿significa eso que al ser temporalmente root puedes modificar las contraseñas de otros usuarios? ¡No, afortunadamente no!\n\nEsto se debe a los muchos UIDs que implementa Linux. Hay tres UIDs asociados con cada proceso:\n\nCuando lanzas un proceso, se ejecuta con los mismos permisos que el usuario o grupo que lo inició, esto se conoce como un <b>UID de usuario efectivo</b>. Este UID se utiliza para otorgar derechos de acceso a un proceso. Por lo tanto, naturalmente, si Bob ejecutara el comando touch, el proceso se ejecutaría como él y cualquier archivo que creara estaría bajo su propiedad.\n\nHay otro UID, llamado <b>UID de usuario real</b>, que es el ID del usuario que inició el proceso. Estos se utilizan para rastrear quién es el usuario que inició el proceso.\n\nUn último UID es el <b>UID de usuario guardado</b>, que permite a un proceso cambiar entre el UID efectivo y el UID real, viceversa. Esto es útil porque no queremos que nuestro proceso se ejecute con privilegios elevados todo el tiempo, es una buena práctica utilizar privilegios especiales en momentos específicos. \n\nAhora vamos a unir todo esto mirando el comando passwd una vez más. \n\nAl ejecutar el comando passwd, tu UID efectivo es tu ID de usuario, digamos que es 500 por ahora. Oh, pero espera, recuerda que el comando passwd tiene el permiso SUID habilitado. Entonces, cuando lo ejecutas, tu UID efectivo es ahora 0 (0 es el UID de root). Ahora este programa puede acceder a archivos como root.\n\nDigamos que pruebas un poco de poder y quieres modificar la contraseña de Sally, Sally tiene un UID de 600. Bueno, estarás de mala suerte, afortunadamente el proceso también tiene tu UID real en este caso 500. Sabe que tu UID es 500 y por lo tanto no puedes modificar la contraseña del UID 600. (Esto, por supuesto, siempre se pasa por alto si eres un superusuario en una máquina y puedes controlar y cambiar todo).\n\nComo ejecutaste passwd, iniciará el proceso usando tu UID real, y guardará el UID del propietario del archivo (UID efectivo), para que puedas cambiar entre los dos. No es necesario modificar todos los archivos con acceso de root si no es necesario. \n\nLa mayoría de las veces, el UID real y el UID efectivo son iguales, pero en casos como el comando passwd cambiarán.",
  "exercise": "Todavía no hemos discutido procesos, aún así podemos ver este cambio en tiempo real: \n\n<ol>\n<li>Abre una ventana de terminal y ejecuta el comando: <b>watch -n 1 \"ps aux | grep passwd\"</b>. Esto observará el proceso de passwd.</li>\n<li>Abre una segunda ventana de terminal y ejecuta: <b>passwd</b></li>\n<li>Mira la primera ventana de terminal, verás un proceso para passwd. ¡La primera columna en la tabla de procesos es el UID de usuario efectivo, y es el usuario root!</li>\n</ol>",
  "quizQuestion": "¿Qué UID decide qué acceso otorgar?",
  "quizAnswer": "efectivo",
  "slug": "permisosdeprocesos"
}