{
  "id": 5,
  "title": "Setuid",
  "lessonContent": "Hay muchos casos en los que los usuarios normales necesitan acceso elevado para hacer cosas. El administrador del sistema no siempre puede estar presente para ingresar una contraseña de root cada vez que un usuario necesita acceso a un archivo protegido, por lo que existen bits especiales de permisos de archivo para permitir este comportamiento. El ID de usuario establecido (SUID) permite a un usuario ejecutar un programa como el propietario del archivo del programa en lugar de como ellos mismos.\n\nVeamos un ejemplo: \n\nDigamos que quiero cambiar mi contraseña, ¿simple verdad? Solo uso el comando passwd:\n\n<pre>$ passwd</pre>\n\n¿Qué hace el comando de contraseña? Está modificando un par de archivos, pero lo más importante es que está modificando el archivo /etc/shadow. Echemos un vistazo a ese archivo por un segundo: \n\n<pre>$ ls -l /etc/shadow\n\n-rw-r----- 1 root shadow 1134 1 dic 11:45 /etc/shadow\n</pre>\n\n¡Espera un minuto aquí, ¿este archivo es propiedad de root? ¿Cómo es posible que podamos modificar un archivo propiedad de root? \n\nVeamos otro conjunto de permisos, esta vez del comando que ejecutamos: \n\n<pre>$ ls -l /usr/bin/passwd\n\n-rwsr-xr-x 1 root root 47032 1 dic 11:45 /usr/bin/passwd\n</pre>\n\nNotarás un nuevo bit de permiso aquí <b>s</b>. Este bit de permiso es el SUID, cuando un archivo tiene este permiso establecido, permite a los usuarios que lanzaron el programa obtener el permiso del propietario del archivo, así como el permiso de ejecución, en este caso root. Por lo tanto, mientras un usuario está ejecutando el comando de contraseña, está ejecutándose como root.\n\nPor eso podemos acceder a un archivo protegido como /etc/shadow cuando ejecutamos el comando passwd. Ahora, si quitas ese bit, verás que no podrás modificar /etc/shadow y, por lo tanto, cambiar tu contraseña. \n\n<b>Modificando SUID</b>\n\nAl igual que los permisos regulares, hay dos formas de modificar los permisos SUID. \n\n<i>Forma simbólica:</i>\n<pre>$ sudo chmod u+s myfile</pre>\n\n<i>Forma numérica:</i>\n<pre> sudo chmod 4755 myfile</pre>\n\nComo puedes ver, el SUID se denota con un 4 y se antepone al conjunto de permisos. Puedes ver el SUID denotado como una <b>S</b> mayúscula, esto significa que sigue haciendo lo mismo, pero no tiene permisos de ejecución.",
  "exercise": "Observa detenidamente los permisos de /etc/passwd, ¿notas algo más? Los archivos con SUID habilitado también son fácilmente distinguibles.",
  "quizQuestion": "¿Qué número representa el SUID?",
  "quizAnswer": "4",
  "slug": "setuidsetuserid"
}