{
  "id": 5,
  "title": "पैकेट विश्लेषण",
  "lessonContent": "पैकेट विश्लेषण का विषय एक पूरे कोर्स को भर सकता है और इस पर कई किताबें लिखी गई हैं। हालांकि, आज हम केवल मूल बातें सीखेंगे। दो बहुत ही लोकप्रिय पैकेट विश्लेषक हैं, वायरशार्क और tcpdump। ये उपकरण आपके नेटवर्क इंटरफेस को स्कैन करते हैं, पैकेट गतिविधि को कैप्चर करते हैं, पैकेजों को विश्लेषित करते हैं और हमें दिखाने के लिए जानकारी उत्पन्न करते हैं। ये हमें नेटवर्क विश्लेषण के विस्तृत अंश में जाने की अनुमति देते हैं और लो लेवल की चीजों में जाने की अनुमति देते हैं। हम tcpdump का उपयोग करेंगे क्योंकि इसमें एक सरल इंटरफेस है, हालांकि अगर आप अपने टूलबेल्ट के लिए पैकेट विश्लेषण करना चाहें तो मैं वायरशार्क की ओर देखने की सिफारिश करूँगा।\n\n<b>tcpdump को इंस्टॉल करें</b>\n\n<pre>\n$ sudo apt install tcpdump\n</pre>\n\n<b>इंटरफेस पर पैकेट डेटा कैप्चर करें</b>\n\n<pre>\npete@icebox:~$ sudo tcpdump -i wlan0\ntcpdump: verbose output suppressed, use -v or -vv for full protocol decode\nlistening on wlan0, link-type EN10MB (Ethernet), capture size 65535 bytes\n11:28:23.958840 IP icebox.lan > nuq04s29-in-f4.1e100.net: ICMP echo request, id 1901, seq 2, length 64\n11:28:23.970928 IP nuq04s29-in-f4.1e100.net > icebox.lan: ICMP echo reply, id 1901, seq 2, length 64\n11:28:24.960464 IP icebox.lan > nuq04s29-in-f4.1e100.net: ICMP echo request, id 1901, seq 3, length 64\n11:28:24.979299 IP nuq04s29-in-f4.1e100.net > icebox.lan: ICMP echo reply, id 1901, seq 3, length 64\n11:28:25.961869 IP icebox.lan > nuq04s29-in-f4.1e100.net: ICMP echo request, id 1901, seq 4, length 64\n11:28:25.976176 IP nuq04s29-in-f4.1e100.net > icebox.lan: ICMP echo reply, id 1901, seq 4, length 64\n11:28:26.963667 IP icebox.lan > nuq04s29-in-f4.1e100.net: ICMP echo request, id 1901, seq 5, length 64\n11:28:26.976137 IP nuq04s29-in-f4.1e100.net > icebox.lan: ICMP echo reply, id 1901, seq 5, length 64\n11:28:30.674953 ARP, Request who-has 172.254.1.0 tell ThePickleParty.lan, length 28\n11:28:31.190665 IP ThePickleParty.lan.51056 > 192.168.86.255.rfe: UDP, length 306\n</pre>\n\nजब आप पैकेट कैप्चर चलाते हैं तो आपको बहुत कुछ होते हुए देखने को मिलेगा, यह उम्मीद की जा सकती है कि पिछली ओर बहुत सारी नेटवर्क गतिविधि हो रही है। मेरे ऊपर के उदाहरण में, मैंने केवल अपने कैप्चर का एक छोटा सा टुकड़ा लिया है विशेष रूप से जब मैंने व्व्व.गूगल.कॉम पर पिंग करने का निर्णय लिया।\n\n<b>आउटपुट को समझना</b>\n\n<pre>\n11:28:23.958840 IP icebox.lan > nuq04s29-in-f4.1e100.net: ICMP echo request, id 1901, seq 2, length 64\n11:28:23.970928 IP nuq04s29-in-f4.1e100.net > icebox.lan: ICMP echo reply, id 1901, seq 2, length 64\n</pre>\n\n<ul>\n<li>पहला फ़ील्ड नेटवर्क गतिविधि का टाइमस्टैम्प है</li>\n<li>आईपी, इसमें प्रोटोकॉल जानकारी होती है</li>\n<li>अगले, आप स्रोत और गंतव्य पता देखेंगे: icebox.lan > nuq04s29-in-f4.1e100.net</li>\n<li>seq, यह TCP पैकेट की शुरुआती और समाप्ति क्रमांक है</li>\n<li>लंबाई, बाइट में लंबाई</li>\n</ul>\n\nहमारे tcpdump आउटपुट से देखें, हम www.google.com पर एक ICMP इको अनुरोध पैकेट भेज रहे हैं और उसका जवाब प्राप्त कर रहे हैं! यह भी ध्यान दें कि विभिन्न पैकेट्स विभिन्न जानकारी उत्पन्न करेंगे, उनके बारे में जानने के लिए मैनपेज का संदर्भ देखें।\n\n<b>tcpdump आउटपुट को फ़ाइल में लिखना</b>\n\n<pre>\n$ sudo tcpdump -w /कोई/फ़ाइल\n</pre>\n\nकुछ अंतिम विचार: हमने पैकेट विश्लेषण के विषय की सतह ही छू ली है। आप देख सकते हैं कि आप कितना देख सकते हैं और हमने हेक्स और एएससी आउटपुट के साथ और गहराई से जाने के बारे में अभी तक नहीं छूआ है। पैकेट विश्लेषकों के बारे में और अधिक सीखने के लिए बहुत सारे संसाधन ऑनलाइन हैं और मैं आपको उन्हें खोजने की प्रेरणा देता हूँ!",
  "exercise": "वायरशार्क टूल डाउनलोड और इंस्टॉल करें और इंटरफेस के साथ खेलें।",
  "quizQuestion": "tcpdump के साथ एक विशिष्ट इंटरफेस को कैप्चर करने के लिए झंडा क्या है?",
  "quizAnswer": "-i",
  "slug": "packetanalysis"
}