{
  "id": 2,
  "title": "पिंग",
  "lessonContent": "सबसे सरल नेटवर्किंग टूलों में से एक <b>पिंग</b>, यह होस्ट तक पैकेट पहुंच पा रहा है या नहीं यह जांचने के लिए उपयोग किया जाता है। यह गंतव्य होस्ट को ICMP इको अनुरोध (प्रकार 8) पैकेट भेजकर काम करता है और एक ICMP इको उत्तर (प्रकार 0) के लिए प्रतीक्षा करता है। पिंग सफल होता है जब एक होस्ट निर्देशित होस्ट से अनुरोध पैकेट भेजता है और लक्षित से एक प्रतिक्रिया प्राप्त करता है। चलिए एक उदाहरण देखते हैं: \n\n<pre>\npete@icebox:~$ ping -c 3 www.google.com\nPING www.google.com (74.125.239.112) 56(84) bytes of data.\n64 bytes from nuq05s01-in-f16.1e100.net (74.125.239.112): icmp_seq=1 ttl=128 time=29.0 ms\n64 bytes from nuq05s01-in-f16.1e100.net (74.125.239.112): icmp_seq=2 ttl=128 time=23.7 ms\n64 bytes from nuq05s01-in-f16.1e100.net (74.125.239.112): icmp_seq=3 ttl=128 time=15.1 ms\n</pre>\n\nइस उदाहरण में, हम www.google.com तक पहुंच सकते हैं या नहीं यह जांचने के लिए पिंग का उपयोग कर रहे हैं। -c ध्वज (गणना) का उपयोग गणना पूरी होने के बाद इको अनुरोध पैकेट भेजना बंद करने के लिए किया जाता है। \n\nपहला हिस्सा कहता है कि हम 64-बाइट पैकेट भेज रहे हैं 74.125.239.112 (google.com) और बाकी हमें यात्रा का विवरण दिखाते हैं। डिफ़ॉल्ट रूप से यह प्रति सेकंड एक पैकेट भेजता है।\n\n<b>icmp_seq</b>\n\nicmp_seq फ़ील्ड का उपयोग भेजे गए पैकेटों के क्रम संख्या दिखाने के लिए किया जाता है, इसलिए इस मामले में, मैंने 3 पैकेट भेजे और हम देख सकते हैं कि 3 पैकेट वापस आए। यदि आप पिंग करते हैं और आपको कुछ क्रम संख्याएँ गायब मिलती हैं, तो इसका अर्थ है कि कुछ कनेक्टिविटी समस्या हो रही है और आपके सभी पैकेट नहीं जा रहे हैं। यदि क्रम संख्या अव्यवस्थित है, तो आपका कनेक्शन शायद बहुत धीमा है क्योंकि आपके पैकेट डिफ़ॉल्ट एक सेकंड से अधिक हो रहे हैं। \n\n<b>ttl</b>\n\nटाइम टू लिव (ttl) फ़ील्ड एक हॉप काउंटर के रूप में उपयोग किया जाता है, जैसे ही आप हॉप करते हैं, यह गिनती को एक से कम कर देता है और एक बार हॉप काउंटर 0 तक पहुंच जाता है, हमारा पैकेट मर जाता है। यह पैकेट को एक जीवनकाल देने के लिए है, हम नहीं चाहते हैं कि हमारे पैकेट सदैव घूमते रहें।\n\n<b>time</b>\n\nयह राउंडट्रिप समय है जो आपको इको अनुरोध पैकेट भेजने से उत्तर प्राप्त होने में लिया गया।",
  "exercise": "एक वेबसाइट पर पिंग करें और जो आप प्राप्त करते हैं, उसे देखें।",
  "quizQuestion": "राउंडट्रिप समय की मात्रक क्या है?",
  "quizAnswer": "मिलीसेकंड",
  "slug": "पिंग"
}